EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
/*************************************************************************************************************
 * @file    ht32f675x5_reg.h
 * @version V1.0
 * @date    2021-02-06
 * @brief   
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/
/*!
************************************************************
* \file
*    ht32f675x5_reg.h
*    ht32f675x5 configuration registers address definition      
* generated by rbus_gen_soft automatically,dont modify it
 
*    start_address   end_address  size(KB)  module_name  
*    0x00000000       0x0001FFFF    128       ROM_CODE     
*    0x00020000       0x007FFFFF    8064        Rsv          
*    0x00800000       0x0093FFFF    1280      SRAM_CODE    
*    0x00940000       0x0FFFFFFF    252672    Rsv          
*    0x10000000       0x11FFFFFF    32768       QSPI0_CODE   
*    0x12000000       0x1FFFFFFF    229376    Rsv          
*    0x20000000       0x2013FFFF    1280      SRAM_DATA    
*    0x20140000       0x2FFFFFFF    260864    Rsv          
*    0x30000000       0x31FFFFFF    32768       QSPI0_DATA   
*    0x32000000       0x33FFFFFF    32768       QSPI1_DATA   
*    0x34000000       0x35FFFFFF    32768       QSPI2_DATA   
*    0x36000000       0x37FFFFFF    32768       QSPI3_DATA   
*    0x38000000       0x39FFFFFF    32748     Rsv          
*    0x3A000000       0x3A01FFFF    128       ROM_DATA     
*    0x3A020000       0x3FFFFFFF    98176     Rsv          
*    0x40000000       0x400003FF    1           LLC_CFG      
*    0x40000400       0x400007FF    1           LLC_STA      
*    0x40000800       0x40000FFF    2           Rsv          
*    0x40001000       0x40001FFF    4           TRNG         
*    0x40002000       0x40007FFF    24        Rsv          
*    0x40008000       0x400087FF    2           RF_MDM_SECA  
*    0x40008800       0x40008FFF    2           RF_MDM_SECB  
*    0x40009000       0x400097FF    2           RF_MDM_SECF  
*    0x40009800       0x40009FFF    2           RF_MDM_SECG  
*    0x4000A000       0x4000A7FF    2           RF_MDM_SECR  
*    0x4000A800       0x4000ABFF    1           RF_MDM_PMU   
*    0x4000AC00       0x4000AFFF    1           RF_MDM_TABLE 
*    0x4000B000       0x4000B3FF    1         CPTO_CFG     
*    0x4000B400       0x4000B7FF    1           CPTO_STA     
*    0x4000B800       0x4FFFFFFF    262098    Rsv          
*    0x50000000       0x50000FFF    4           QSPI0_CFG    
*    0x50001000       0x50001FFF    4           QSPI1_CFG    
*    0x50002000       0x50002FFF    4           QSPI2_CFG    
*    0x50003000       0x50003FFF    4           QSPI3_CFG    
*    0x50004000       0x50007FFF    16        SRAM_CACHE   
*    0x50008000       0x50008FFF    4           DMA_CFG      
*    0x50009000       0x50009FFF    4           CACHE_CFG    
*    0x5000A000       0x5000AFFF    4           PLCD         
*    0x5000B000       0x5000BFFF    4           USB          
*    0x5000C000       0x5FFFFFFF    262096    Rsv          
*    0x60000000       0x600003FF    1           UART0        
*    0x60000400       0x600007FF    1           UART1        
*    0x60000800       0x60000BFF    1           UART2/SCD    
*    0x60000C00       0x60000FFF    1           Rsv          
*    0x60001000       0x60001FFF    4           SPI0         
*    0x60002000       0x60002FFF    4           SPI1         
*    0x60003000       0x600033FF    1           I2C0         
*    0x60003400       0x600037FF    1           I2C1         
*    0x60003800       0x60003BFF    1           I2C2         
*    0x60003C00       0x60003FFF    1           Rsv          
*    0x60004000       0x60004FFF    4           IOMUX        
*    0x60005000       0x6001FFFF    108       Rsv          
*    0x60020000       0x600203FF    1           GPADC        
*    0x60020400       0x6002CFFF    51        Rsv          
*    0x6002D000       0x6002D3FF    1           I2S          
*    0x6002D400       0x6002DFFF    3           Rsv          
*    0x6002E000       0x6002EFFF    4           CIC          
*    0x6002F000       0x6002F3FF    1           EFUSE_ARRY   
*    0x6002F400       0x6002FFFF    3           EFUSE_REG    
*    0x60030000       0x60030FFF    4           QDEC         
*    0x60031000       0x60031FFF    4           Rsv          
*    0x60032000       0x60032FFF    4           GTIM0        
*    0x60033000       0x60033FFF    4           GTIM1        
*    0x60034000       0x6003AFFF    28        Rsv          
*    0x6003B000       0x6003BFFF    4           GTIM2        
*    0x6003C000       0x6003CFFF    4           GTIM3        
*    0x6003D000       0x6004AFFF    56        Rsv          
*    0x6004B000       0x6004BFFF    4           GPIO         
*    0x6004C000       0x6004CFFF    4           Rsv          
*    0x6004D000       0x6004DFFF    4           RTC          
*    0x6004E000       0x6004E7FF    2           WDT0         
*    0x6004E800       0x6004EFFF    2           WDT1         
*    0x6004F000       0x6004FFFF    4           CRG          
*    0x60050000       0x60050FFF    4           PMU          
*    0x60051000       0x60051FFF    4           SYS_CTRL     
*    0x60052000       0x60052FFF    4           STIM0        
*    0x60053000       0x60053FFF    4           STIM1        
*    0x60054000       0xFFFFFFFF    2621104   Rsv          
************************************************************
*/
#ifndef __HT32F675X5_REG_H__
#define __HT32F675X5_REG_H__


//---------------------------------------------------
// llc in  domain address definition
//---------------------------------------------------

#define reg_llc_int_state_reg                                         (*(volatile uint32_t *)0x40000000)
#define adr_llc_int_state_reg                                                               (0x40000000)
#define mask_llc_int_state_reg_int_state                                (0xffffff)                      

