EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_llc_ret_pd_int_en_ctrl                                    (*(volatile uint32_t *)0x40000004)
#define adr_llc_ret_pd_int_en_ctrl                                                          (0x40000004)
#define mask_llc_ret_pd_int_en_ctrl_int_wake_up_en                      (0x800000)                      
#define mask_llc_ret_pd_int_en_ctrl_int_mdm_sync                        (0x400000)                      
#define mask_llc_ret_pd_int_en_ctrl_int_p24g_en                         (0x3f0000)                      
#define mask_llc_ret_pd_int_en_ctrl_int_en                              (0xffff)                        

#define reg_llc_int_clr_ctrl_reg                                      (*(volatile uint32_t *)0x40000008)
#define adr_llc_int_clr_ctrl_reg                                                            (0x40000008)
#define mask_llc_int_clr_ctrl_reg_int_clr_trig                          (0xffffff)                      

#define reg_llc_ret_pd_llc_ltrx_ctrl                                  (*(volatile uint32_t *)0x4000000c)
#define adr_llc_ret_pd_llc_ltrx_ctrl                                                        (0x4000000c)
#define mask_llc_ret_pd_llc_ltrx_ctrl_tx_data_rate                      (0xc)                           
#define mask_llc_ret_pd_llc_ltrx_ctrl_rx_data_rate                      (0x3)                           

#define reg_llc_ret_pd_llc_control                                    (*(volatile uint32_t *)0x40000010)
#define adr_llc_ret_pd_llc_control                                                          (0x40000010)
#define mask_llc_ret_pd_llc_control_int_hw_mask                         (0x80)                          
#define mask_llc_ret_pd_llc_control_trxs_host_tx_en                     (0x40)                          
#define mask_llc_ret_pd_llc_control_trxs_host_rx_en                     (0x20)                          
#define mask_llc_ret_pd_llc_control_trxs_host_mode                      (0x10)                          
#define mask_llc_ret_pd_llc_control_close_whiten                        (0x8)                           
#define mask_llc_ret_pd_llc_control_byp_en                              (0x4)                           
#define mask_llc_ret_pd_llc_control_dtm_en                              (0x2)                           
#define mask_llc_ret_pd_llc_control_ltc_en                              (0x1)                           

#define reg_llc_ltrx_stop_trig                                        (*(volatile uint32_t *)0x40000014)
#define adr_llc_ltrx_stop_trig                                                              (0x40000014)
#define mask_llc_ltrx_stop_trig_trx_force_stop_trig                     (0x2)                           
#define mask_llc_ltrx_stop_trig_rx_restart_trig                         (0x1)                           

#define reg_ltc_trig_cfg                                              (*(volatile uint32_t *)0x40000018)
#define adr_ltc_trig_cfg                                                                    (0x40000018)
#define mask_ltc_trig_cfg_sch_reload_trig                               (0x20)                          
#define mask_ltc_trig_cfg_sync_regs_to_slp_clk_trig                     (0x10)                          
#define mask_ltc_trig_cfg_itv_reload_trig                               (0x8)                           
#define mask_ltc_trig_cfg_read_trig                                     (0x4)                           
#define mask_ltc_trig_cfg_wakeup_begin                                  (0x2)                           
#define mask_ltc_trig_cfg_slp_begin                                     (0x1)                           

#define reg_ltc_ltc_cfg                                               (*(volatile uint32_t *)0x4000001c)
#define adr_ltc_ltc_cfg                                                                     (0x4000001c)
#define mask_ltc_ltc_cfg_clk_ratio_sel                                  (0x10000)                       
#define mask_ltc_ltc_cfg_clk_ratio                                      (0xffff)                        

#define reg_llc_ret_pd_tx_header_cfg                                  (*(volatile uint32_t *)0x40000020)
#define adr_llc_ret_pd_tx_header_cfg                                                        (0x40000020)
#define mask_llc_ret_pd_tx_header_cfg_tx_header                         (0xffffff)                      

#define reg_llc_ret_pd_rx_header_cfg                                  (*(volatile uint32_t *)0x40000024)
#define adr_llc_ret_pd_rx_header_cfg                                                        (0x40000024)
#define mask_llc_ret_pd_rx_header_cfg_rx_header                         (0xffff00)                      
#define mask_llc_ret_pd_rx_header_cfg_dch_max_len                       (0xff)                          

#define reg_ltrx_ret_pd_ltrx_chidx_sel                                (*(volatile uint32_t *)0x40000028)
#define adr_ltrx_ret_pd_ltrx_chidx_sel                                                      (0x40000028)
#define mask_ltrx_ret_pd_ltrx_chidx_sel_snd_adv_chn                     (0x40)                          
#define mask_ltrx_ret_pd_ltrx_chidx_sel_chidx                           (0x3f)                          

#define reg_ltrx_ret_pd_tx_access_code                                (*(volatile uint32_t *)0x4000002c)
#define adr_ltrx_ret_pd_tx_access_code                                                      (0x4000002c)

#define reg_p24g_ret_pd_tx_def_data                                   (*(volatile uint32_t *)0x40000030)
#define adr_p24g_ret_pd_tx_def_data                                                         (0x40000030)

#define reg_llc_ret_pd_ble_cfg                                        (*(volatile uint32_t *)0x40000034)
#define adr_llc_ret_pd_ble_cfg                                                              (0x40000034)
#define mask_llc_ret_pd_ble_cfg_rx_end_sel                              (0x8)                           
#define mask_llc_ret_pd_ble_cfg_mode                                    (0x7)                           

#define reg_llc_ret_pd_ble_ctrl                                       (*(volatile uint32_t *)0x40000038)
#define adr_llc_ret_pd_ble_ctrl                                                             (0x40000038)
#define mask_llc_ret_pd_ble_ctrl_lsm_type_ck_en                         (0x4)                           
#define mask_llc_ret_pd_ble_ctrl_lsm_rsv_rx_en                          (0x2)                           
#define mask_llc_ret_pd_ble_ctrl_lsm_scan_act_en                        (0x1)                           

