EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_p24g_ret_pd_work_mode_cfg                                 (*(volatile uint32_t *)0x40000040)
#define adr_p24g_ret_pd_work_mode_cfg                                                       (0x40000040)
#define mask_p24g_ret_pd_work_mode_cfg_work_mode                        (0x7)                           

#define reg_p24g_ret_pd_p24g_ctrl                                     (*(volatile uint32_t *)0x40000044)
#define adr_p24g_ret_pd_p24g_ctrl                                                           (0x40000044)
#define mask_p24g_ret_pd_p24g_ctrl_trx_need_ready_trig_en               (0x8)                           
#define mask_p24g_ret_pd_p24g_ctrl_continue_en                          (0x4)                           
#define mask_p24g_ret_pd_p24g_ctrl_wl_fail_stp_auto                     (0x2)                           
#define mask_p24g_ret_pd_p24g_ctrl_csma_en                              (0x1)                           

#define reg_p24g_ret_pd_csma_control                                  (*(volatile uint32_t *)0x40000048)
#define adr_p24g_ret_pd_csma_control                                                        (0x40000048)
#define mask_p24g_ret_pd_csma_control_csma_stop_time                    (0xffff0000)                    
#define mask_p24g_ret_pd_csma_control_csma_len                          (0xffff)                        

#define reg_p24g_tx_rx_trig                                           (*(volatile uint32_t *)0x4000004c)
#define adr_p24g_tx_rx_trig                                                                 (0x4000004c)
#define mask_p24g_tx_rx_trig_start_trx_trig                             (0x2)                           
#define mask_p24g_tx_rx_trig_ready_to_trx_trig                          (0x1)                           

#define reg_ltrx_ret_pd_crc_init                                      (*(volatile uint32_t *)0x40000050)
#define adr_ltrx_ret_pd_crc_init                                                            (0x40000050)

#define reg_llc_ret_pd_rx_crc_ctrl                                    (*(volatile uint32_t *)0x40000054)
#define adr_llc_ret_pd_rx_crc_ctrl                                                          (0x40000054)
#define mask_llc_ret_pd_rx_crc_ctrl_rx_nbit_tail                        (0x3)                           

#define reg_ltrx_ret_pd_crc_code_rd_sel                               (*(volatile uint32_t *)0x40000058)
#define adr_ltrx_ret_pd_crc_code_rd_sel                                                     (0x40000058)

#define reg_ltc_ret_pd_slp_len                                        (*(volatile uint32_t *)0x40000080)
#define adr_ltc_ret_pd_slp_len                                                              (0x40000080)

#define reg_ltc_slp_cycle_to_act                                      (*(volatile uint32_t *)0x40000084)
#define adr_ltc_slp_cycle_to_act                                                            (0x40000084)

#define reg_ltc_ret_pd_itv_len_hi                                     (*(volatile uint32_t *)0x40000088)
#define adr_ltc_ret_pd_itv_len_hi                                                           (0x40000088)

#define reg_ltc_ret_pd_itv_len_lo                                     (*(volatile uint32_t *)0x4000008c)
#define adr_ltc_ret_pd_itv_len_lo                                                           (0x4000008c)

#define reg_ltc_itv_reload_value_hi                                   (*(volatile uint32_t *)0x40000090)
#define adr_ltc_itv_reload_value_hi                                                         (0x40000090)
#define mask_ltc_itv_reload_value_hi_itv_reload_plus                    (0x40)                          
#define mask_ltc_itv_reload_value_hi_itv_reload_delta_hi                (0x3f)                          

#define reg_ltc_itv_reload_value_lo                                   (*(volatile uint32_t *)0x40000094)
#define adr_ltc_itv_reload_value_lo                                                         (0x40000094)
#define mask_ltc_itv_reload_value_lo_itv_reload_delta_lo                (0xffffffff)                    

#define reg_ltc_ret_pd_itv_reload_max_hi                              (*(volatile uint32_t *)0x40000098)
#define adr_ltc_ret_pd_itv_reload_max_hi                                                    (0x40000098)

#define reg_ltc_ret_pd_itv_reload_max_lo                              (*(volatile uint32_t *)0x4000009c)
#define adr_ltc_ret_pd_itv_reload_max_lo                                                    (0x4000009c)

#define reg_ltc_ret_pd_itv_reload_min_hi                              (*(volatile uint32_t *)0x400000a0)
#define adr_ltc_ret_pd_itv_reload_min_hi                                                    (0x400000a0)

#define reg_ltc_ret_pd_itv_reload_min_lo                              (*(volatile uint32_t *)0x400000a4)
#define adr_ltc_ret_pd_itv_reload_min_lo                                                    (0x400000a4)

#define reg_ltc_ret_pd_itv_auto_reload_en                             (*(volatile uint32_t *)0x400000a8)
#define adr_ltc_ret_pd_itv_auto_reload_en                                                   (0x400000a8)

#define reg_ltc_ret_pd_tx_ifs_len_ctrl                                (*(volatile uint32_t *)0x400000c0)
#define adr_ltc_ret_pd_tx_ifs_len_ctrl                                                      (0x400000c0)
#define mask_ltc_ret_pd_tx_ifs_len_ctrl_ifs_tx_len_500k                 (0xffff0000)                    
#define mask_ltc_ret_pd_tx_ifs_len_ctrl_ifs_tx_len                      (0xffff)                        

#define reg_ltc_ret_pd_rx_ifs_len_ctrl                                (*(volatile uint32_t *)0x400000c4)
#define adr_ltc_ret_pd_rx_ifs_len_ctrl                                                      (0x400000c4)
#define mask_ltc_ret_pd_rx_ifs_len_ctrl_ifs_rx_len                      (0xffff)                        

#define reg_ltc_ret_pd_ifs_wnd_ctrl                                   (*(volatile uint32_t *)0x400000c8)
#define adr_ltc_ret_pd_ifs_wnd_ctrl                                                         (0x400000c8)
#define mask_ltc_ret_pd_ifs_wnd_ctrl_ifs_wnd                            (0xffff)                        

#define reg_ltc_ret_pd_itv_lsn_bgn_hi                                 (*(volatile uint32_t *)0x40000100)
#define adr_ltc_ret_pd_itv_lsn_bgn_hi                                                       (0x40000100)

#define reg_ltc_ret_pd_itv_lsn_bgn_lo                                 (*(volatile uint32_t *)0x40000104)
#define adr_ltc_ret_pd_itv_lsn_bgn_lo                                                       (0x40000104)

