EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_ltc_ret_pd_itv_lsn_end_hi                                 (*(volatile uint32_t *)0x40000108)
#define adr_ltc_ret_pd_itv_lsn_end_hi                                                       (0x40000108)

#define reg_ltc_ret_pd_itv_lsn_end_lo                                 (*(volatile uint32_t *)0x4000010c)
#define adr_ltc_ret_pd_itv_lsn_end_lo                                                       (0x4000010c)

#define reg_ltc_ret_pd_rx_stop_before_lsn_end_hi                      (*(volatile uint32_t *)0x40000110)
#define adr_ltc_ret_pd_rx_stop_before_lsn_end_hi                                            (0x40000110)

#define reg_ltc_ret_pd_rx_stop_before_lsn_end_lo                      (*(volatile uint32_t *)0x40000114)
#define adr_ltc_ret_pd_rx_stop_before_lsn_end_lo                                            (0x40000114)

#define reg_ltc_ret_pd_itv_pre_time                                   (*(volatile uint32_t *)0x40000118)
#define adr_ltc_ret_pd_itv_pre_time                                                         (0x40000118)
#define mask_ltc_ret_pd_itv_pre_time_itv_tx_pre_time                    (0x3ffe000)                     
#define mask_ltc_ret_pd_itv_pre_time_itv_rx_pre_time                    (0x1fff)                        

#define reg_llc_ret_pd_tx_rx_stop_before_intvl_hi                     (*(volatile uint32_t *)0x4000011c)
#define adr_llc_ret_pd_tx_rx_stop_before_intvl_hi                                           (0x4000011c)

#define reg_llc_ret_pd_tx_rx_stop_before_intvl_lo                     (*(volatile uint32_t *)0x40000120)
#define adr_llc_ret_pd_tx_rx_stop_before_intvl_lo                                           (0x40000120)

#define reg_ltc_ret_pd_ifs_pre_time                                   (*(volatile uint32_t *)0x40000124)
#define adr_ltc_ret_pd_ifs_pre_time                                                         (0x40000124)
#define mask_ltc_ret_pd_ifs_pre_time_ifs_tx_pre_time                    (0x3ffe000)                     
#define mask_ltc_ret_pd_ifs_pre_time_ifs_rx_pre_time                    (0x1fff)                        

#define reg_ltc_ccm_prepare_time                                      (*(volatile uint32_t *)0x40000128)
#define adr_ltc_ccm_prepare_time                                                            (0x40000128)
#define mask_ltc_ccm_prepare_time_ccm_tx_pre_time                       (0xffff0000)                    
#define mask_ltc_ccm_prepare_time_ccm_rx_pre_time                       (0xffff)                        

#define reg_ltc_ret_pd_burst_on_time_btxen_brxen                      (*(volatile uint32_t *)0x4000012c)
#define adr_ltc_ret_pd_burst_on_time_btxen_brxen                                            (0x4000012c)
#define mask_ltc_ret_pd_burst_on_time_btxen_brxen_btxen_on_time         (0x1fff0000)                    
#define mask_ltc_ret_pd_burst_on_time_btxen_brxen_brxen_on_time         (0x1fff)                        

#define reg_ltrx_ret_pd_burst_off_time_btxen_brxen                    (*(volatile uint32_t *)0x40000130)
#define adr_ltrx_ret_pd_burst_off_time_btxen_brxen                                          (0x40000130)
#define mask_ltrx_ret_pd_burst_off_time_btxen_brxen_brf_btxen_off_time  (0xfff000)                      
#define mask_ltrx_ret_pd_burst_off_time_btxen_brxen_brf_brxen_off_time  (0xfff)                         

#define reg_llc_ret_pd_interrupt_delay                                (*(volatile uint32_t *)0x40000140)
#define adr_llc_ret_pd_interrupt_delay                                                      (0x40000140)
#define mask_llc_ret_pd_interrupt_delay_int_rx_end_dly                  (0xff0000)                      
#define mask_llc_ret_pd_interrupt_delay_int_rx_pdu_end_dly              (0xff00)                        
#define mask_llc_ret_pd_interrupt_delay_int_tx_end_dly                  (0xff)                          

#define reg_lsm_ret_pd_init_addr_h                                    (*(volatile uint32_t *)0x40000144)
#define adr_lsm_ret_pd_init_addr_h                                                          (0x40000144)

#define reg_lsm_ret_pd_init_addr_l                                    (*(volatile uint32_t *)0x40000148)
#define adr_lsm_ret_pd_init_addr_l                                                          (0x40000148)

#define reg_lsm_ret_pd_adv_addr_h                                     (*(volatile uint32_t *)0x4000014c)
#define adr_lsm_ret_pd_adv_addr_h                                                           (0x4000014c)

#define reg_lsm_ret_pd_adv_addr_l                                     (*(volatile uint32_t *)0x40000150)
#define adr_lsm_ret_pd_adv_addr_l                                                           (0x40000150)

#define reg_lsm_ret_pd_device_addr_match_en                           (*(volatile uint32_t *)0x40000154)
#define adr_lsm_ret_pd_device_addr_match_en                                                 (0x40000154)

#define reg_llc_debug_brk_point                                       (*(volatile uint32_t *)0x40000158)
#define adr_llc_debug_brk_point                                                             (0x40000158)

#define reg_llc_debug_sel_adv                                         (*(volatile uint32_t *)0x4000015c)
#define adr_llc_debug_sel_adv                                                               (0x4000015c)

#define reg_ltc_slp_ind                                               (*(volatile uint32_t *)0x40000180)
#define adr_ltc_slp_ind                                                                     (0x40000180)

#define reg_p24g_trx_vld                                              (*(volatile uint32_t *)0x40000184)
#define adr_p24g_trx_vld                                                                    (0x40000184)

#define reg_ltrx_ble_tx_status                                        (*(volatile uint32_t *)0x40000188)
#define adr_ltrx_ble_tx_status                                                              (0x40000188)
#define mask_ltrx_ble_tx_status_ble_tx_ext_advmode                      (0xc0)                          
#define mask_ltrx_ble_tx_status_ble_tx_ext_hlen                         (0x3f)                          

