EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_llc_ble_tx_update_status                                  (*(volatile uint32_t *)0x4000018c)
#define adr_llc_ble_tx_update_status                                                        (0x4000018c)
#define mask_llc_ble_tx_update_status_tx_cteinfo                        (0xff00)                        
#define mask_llc_ble_tx_update_status_tx_extheader_flg                  (0xff)                          

#define reg_ltrx_ble_rx_status                                        (*(volatile uint32_t *)0x40000190)
#define adr_ltrx_ble_rx_status                                                              (0x40000190)
#define mask_ltrx_ble_rx_status_ci                                      (0x300)                         
#define mask_ltrx_ble_rx_status_ble_rx_ext_advmode                      (0xc0)                          
#define mask_ltrx_ble_rx_status_ble_rx_ext_hlen                         (0x3f)                          

#define reg_llc_ble_rx_update_status                                  (*(volatile uint32_t *)0x40000194)
#define adr_llc_ble_rx_update_status                                                        (0x40000194)
#define mask_llc_ble_rx_update_status_rx_cteinfo                        (0xff00)                        
#define mask_llc_ble_rx_update_status_rx_extheader_flg                  (0xff)                          

#define reg_ltrx_rx_header                                            (*(volatile uint32_t *)0x40000198)
#define adr_ltrx_rx_header                                                                  (0x40000198)

#define reg_ltrx_crc_code_flg                                         (*(volatile uint32_t *)0x4000019c)
#define adr_ltrx_crc_code_flg                                                               (0x4000019c)
#define mask_ltrx_crc_code_flg_crc_err                                  (0x1000000)                     
#define mask_ltrx_crc_code_flg_crc_code                                 (0xffffff)                      

#define reg_lsm_llc_state                                             (*(volatile uint32_t *)0x400001a0)
#define adr_lsm_llc_state                                                                   (0x400001a0)

#define reg_ltrx_rx_nesn                                              (*(volatile uint32_t *)0x400001a4)
#define adr_ltrx_rx_nesn                                                                    (0x400001a4)

#define reg_ltrx_rx_sn                                                (*(volatile uint32_t *)0x400001a8)
#define adr_ltrx_rx_sn                                                                      (0x400001a8)

#define reg_p24g_lsm_state                                            (*(volatile uint32_t *)0x400001ac)
#define adr_p24g_lsm_state                                                                  (0x400001ac)

#define reg_ltc_itv_act_cnt_hi                                        (*(volatile uint32_t *)0x400001c0)
#define adr_ltc_itv_act_cnt_hi                                                              (0x400001c0)

#define reg_ltc_itv_act_cnt_lo                                        (*(volatile uint32_t *)0x400001c4)
#define adr_ltc_itv_act_cnt_lo                                                              (0x400001c4)

#define reg_ltc_itv_trig_act_cnt_hi                                   (*(volatile uint32_t *)0x400001c8)
#define adr_ltc_itv_trig_act_cnt_hi                                                         (0x400001c8)

#define reg_ltc_itv_trig_act_cnt_lo                                   (*(volatile uint32_t *)0x400001cc)
#define adr_ltc_itv_trig_act_cnt_lo                                                         (0x400001cc)

#define reg_ltc_ifs_cnt                                               (*(volatile uint32_t *)0x400001d0)
#define adr_ltc_ifs_cnt                                                                     (0x400001d0)

#define reg_ltc_trig_ifs_cnt                                          (*(volatile uint32_t *)0x400001d4)
#define adr_ltc_trig_ifs_cnt                                                                (0x400001d4)

#define reg_ltc_sch_act_cnt_hi                                        (*(volatile uint32_t *)0x400001d8)
#define adr_ltc_sch_act_cnt_hi                                                              (0x400001d8)

#define reg_ltc_sch_act_cnt_lo                                        (*(volatile uint32_t *)0x400001dc)
#define adr_ltc_sch_act_cnt_lo                                                              (0x400001dc)

#define reg_ltc_sch_trig_act_cnt_hi                                   (*(volatile uint32_t *)0x400001e0)
#define adr_ltc_sch_trig_act_cnt_hi                                                         (0x400001e0)

#define reg_ltc_sch_trig_act_cnt_lo                                   (*(volatile uint32_t *)0x400001e4)
#define adr_ltc_sch_trig_act_cnt_lo                                                         (0x400001e4)

#define reg_ltc_slp_cnt                                               (*(volatile uint32_t *)0x400001e8)
#define adr_ltc_slp_cnt                                                                     (0x400001e8)

#define reg_ltc_slp_to_act_rlt_hi                                     (*(volatile uint32_t *)0x400001ec)
#define adr_ltc_slp_to_act_rlt_hi                                                           (0x400001ec)

#define reg_ltc_slp_to_act_rlt_lo                                     (*(volatile uint32_t *)0x400001f0)
#define adr_ltc_slp_to_act_rlt_lo                                                           (0x400001f0)

#define reg_ltc_anc_pos_hi                                            (*(volatile uint32_t *)0x40000200)
#define adr_ltc_anc_pos_hi                                                                  (0x40000200)

#define reg_ltc_anc_pos_lo                                            (*(volatile uint32_t *)0x40000204)
#define adr_ltc_anc_pos_lo                                                                  (0x40000204)

