EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_ltc_sch_auxptr_cnt_hi                                     (*(volatile uint32_t *)0x40000208)
#define adr_ltc_sch_auxptr_cnt_hi                                                           (0x40000208)

#define reg_ltc_sch_auxptr_cnt_lo                                     (*(volatile uint32_t *)0x4000020c)
#define adr_ltc_sch_auxptr_cnt_lo                                                           (0x4000020c)

#define reg_llc_wakeup_flg                                            (*(volatile uint32_t *)0x40000210)
#define adr_llc_wakeup_flg                                                                  (0x40000210)

#define reg_cte_ret_pd_time_limit                                     (*(volatile uint32_t *)0x40000240)
#define adr_cte_ret_pd_time_limit                                                           (0x40000240)

#define reg_ltc_sch_reload_value_hi                                   (*(volatile uint32_t *)0x40000244)
#define adr_ltc_sch_reload_value_hi                                                         (0x40000244)

#define reg_ltc_sch_reload_value_lo                                   (*(volatile uint32_t *)0x40000248)
#define adr_ltc_sch_reload_value_lo                                                         (0x40000248)

#define reg_ltc_ret_pd_lsn_bgn_sel_en                                 (*(volatile uint32_t *)0x4000024c)
#define adr_ltc_ret_pd_lsn_bgn_sel_en                                                       (0x4000024c)

#define reg_ltc_ret_pd_snd_wnd_en                                     (*(volatile uint32_t *)0x40000250)
#define adr_ltc_ret_pd_snd_wnd_en                                                           (0x40000250)

#define reg_ltc_ret_pd_itv_snd_wnd_hi                                 (*(volatile uint32_t *)0x40000254)
#define adr_ltc_ret_pd_itv_snd_wnd_hi                                                       (0x40000254)

#define reg_ltc_ret_pd_itv_snd_wnd_lo                                 (*(volatile uint32_t *)0x40000258)
#define adr_ltc_ret_pd_itv_snd_wnd_lo                                                       (0x40000258)

#define reg_llc_ret_pd_ext_cg_en                                      (*(volatile uint32_t *)0x4000025c)
#define adr_llc_ret_pd_ext_cg_en                                                            (0x4000025c)

#define reg_llc_ret_pd_back_door_cfg                                  (*(volatile uint32_t *)0x40000280)
#define adr_llc_ret_pd_back_door_cfg                                                        (0x40000280)
#define mask_llc_ret_pd_back_door_cfg_wakeup_int_source_sel             (0x8)                           
#define mask_llc_ret_pd_back_door_cfg_ifs_len_sel                       (0x4)                           
#define mask_llc_ret_pd_back_door_cfg_close_init_no_lsn_end_function    (0x2)                           
#define mask_llc_ret_pd_back_door_cfg_modify_condition_tx_stop          (0x1)                           

#define reg_llc_test_start                                            (*(volatile uint32_t *)0x40000284)
#define adr_llc_test_start                                                                  (0x40000284)

#define reg_test_time                                                 (*(volatile uint32_t *)0x40000288)
#define adr_test_time                                                                       (0x40000288)

#define reg_test_pkt_cnt                                              (*(volatile uint32_t *)0x4000028c)
#define adr_test_pkt_cnt                                                                    (0x4000028c)
#define mask_test_pkt_cnt_pkt_ok_cnt                                    (0xffff0000)                    
#define mask_test_pkt_cnt_pkt_err_cnt                                   (0xffff)                        

#define reg_test_down                                                 (*(volatile uint32_t *)0x40000290)
#define adr_test_down                                                                       (0x40000290)


//---------------------------------------------------
// trng in  domain address definition
//---------------------------------------------------

#define reg_trng_fifo_data                                         (*(volatile uint32_t *)0x40001000)
#define adr_trng_fifo_data                                                               (0x40001000)
#define mask_trng_fifo_data_ehr_data0                                (0xffffffff)                    

#define reg_trng_imr_reg                                           (*(volatile uint32_t *)0x40001100)
#define adr_trng_imr_reg                                                                 (0x40001100)
#define mask_trng_imr_reg_read_underflow_int_mask                    (0x20)                          
#define mask_trng_imr_reg_write_overflow_int_mask                    (0x10)                          
#define mask_trng_imr_reg_vn_err_int_mask                            (0x8)                           
#define mask_trng_imr_reg_crngt_err_int_mask                         (0x4)                           
#define mask_trng_imr_reg_autocorr_err_int_mask                      (0x2)                           
#define mask_trng_imr_reg_ehr_valid_int_mask                         (0x1)                           

#define reg_trng_isr_reg                                           (*(volatile uint32_t *)0x40001104)
#define adr_trng_isr_reg                                                                 (0x40001104)
#define mask_trng_isr_reg_read_underflow_err                         (0x20)                          
#define mask_trng_isr_reg_write_overflow_err                         (0x10)                          
#define mask_trng_isr_reg_vn_err                                     (0x8)                           
#define mask_trng_isr_reg_crngt_err                                  (0x4)                           
#define mask_trng_isr_reg_autocorr_err                               (0x2)                           
#define mask_trng_isr_reg_ehr_valid                                  (0x1)                           

