EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_trng_rng_icr_reg                                       (*(volatile uint32_t *)0x40001108)
#define adr_trng_rng_icr_reg                                                             (0x40001108)
#define mask_trng_rng_icr_reg_read_underflow_err                     (0x20)                          
#define mask_trng_rng_icr_reg_write_overflow_err                     (0x10)                          
#define mask_trng_rng_icr_reg_vn_err                                 (0x8)                           
#define mask_trng_rng_icr_reg_crngt_err                              (0x4)                           
#define mask_trng_rng_icr_reg_autocorr_err                           (0x2)                           
#define mask_trng_rng_icr_reg_ehr_valid                              (0x1)                           

#define reg_trng_trng_config                                       (*(volatile uint32_t *)0x4000110c)
#define adr_trng_trng_config                                                             (0x4000110c)
#define mask_trng_trng_config_sop_sel                                (0x100)                         
#define mask_trng_trng_config_rnd_src3_sel                           (0xc0)                          
#define mask_trng_trng_config_rnd_src2_sel                           (0x30)                          
#define mask_trng_trng_config_rnd_src1_sel                           (0xc)                           
#define mask_trng_trng_config_rnd_src0_sel                           (0x3)                           

#define reg_trng_trng_valid                                        (*(volatile uint32_t *)0x40001110)
#define adr_trng_trng_valid                                                              (0x40001110)
#define mask_trng_trng_valid_ehr_valid                               (0x1)                           

#define reg_trng_ehr_data0                                         (*(volatile uint32_t *)0x40001114)
#define adr_trng_ehr_data0                                                               (0x40001114)
#define mask_trng_ehr_data0_ehr_data0                                (0xffffffff)                    

#define reg_trng_ehr_data1                                         (*(volatile uint32_t *)0x40001118)
#define adr_trng_ehr_data1                                                               (0x40001118)
#define mask_trng_ehr_data1_ehr_data1                                (0xffffffff)                    

#define reg_trng_ehr_data2                                         (*(volatile uint32_t *)0x4000111c)
#define adr_trng_ehr_data2                                                               (0x4000111c)
#define mask_trng_ehr_data2_ehr_data2                                (0xffffffff)                    

#define reg_trng_ehr_data3                                         (*(volatile uint32_t *)0x40001120)
#define adr_trng_ehr_data3                                                               (0x40001120)
#define mask_trng_ehr_data3_ehr_data3                                (0xffffffff)                    

#define reg_trng_ehr_data4                                         (*(volatile uint32_t *)0x40001124)
#define adr_trng_ehr_data4                                                               (0x40001124)
#define mask_trng_ehr_data4_ehr_data4                                (0xffffffff)                    

#define reg_trng_ehr_data5                                         (*(volatile uint32_t *)0x40001128)
#define adr_trng_ehr_data5                                                               (0x40001128)
#define mask_trng_ehr_data5_ehr_data5                                (0xffffffff)                    

#define reg_trng_rnd_source_enable                                 (*(volatile uint32_t *)0x4000112c)
#define adr_trng_rnd_source_enable                                                       (0x4000112c)
#define mask_trng_rnd_source_enable_dma_en                           (0x20)                          
#define mask_trng_rnd_source_enable_ana_rnd_src_en                   (0x10)                          
#define mask_trng_rnd_source_enable_rnd_src3_en                      (0x8)                           
#define mask_trng_rnd_source_enable_rnd_src2_en                      (0x4)                           
#define mask_trng_rnd_source_enable_rnd_src1_en                      (0x2)                           
#define mask_trng_rnd_source_enable_rnd_src0_en                      (0x1)                           

#define reg_trng_sample_cnt1                                       (*(volatile uint32_t *)0x40001130)
#define adr_trng_sample_cnt1                                                             (0x40001130)
#define mask_trng_sample_cnt1_sample_cntr1                           (0xffffffff)                    

#define reg_trng_autocorr_statistic                                (*(volatile uint32_t *)0x40001134)
#define adr_trng_autocorr_statistic                                                      (0x40001134)
#define mask_trng_autocorr_statistic_autocorr_fails                  (0x3fc000)                      
#define mask_trng_autocorr_statistic_autocorr_trys                   (0x3fff)                        

#define reg_trng_trng_debug_control                                (*(volatile uint32_t *)0x40001138)
#define adr_trng_trng_debug_control                                                      (0x40001138)
#define mask_trng_trng_debug_control_rng_parallel_data_sel           (0x40)                          
#define mask_trng_trng_debug_control_rng_debug_enable                (0x20)                          
#define mask_trng_trng_debug_control_lfsr_bypass                     (0x10)                          
#define mask_trng_trng_debug_control_auto_correlate_bypass           (0x8)                           
#define mask_trng_trng_debug_control_trng_crngt_bypass               (0x4)                           
#define mask_trng_trng_debug_control_vnc_bypass                      (0x2)                           
#define mask_trng_trng_debug_control_reserved                        (0x1)                           

#define reg_trng_trng_bit_number                                   (*(volatile uint32_t *)0x4000113c)
#define adr_trng_trng_bit_number                                                         (0x4000113c)
#define mask_trng_trng_bit_number_trng_bit_number                    (0xffffffff)                    

#define reg_trng_trng_sw_reset                                     (*(volatile uint32_t *)0x40001140)
#define adr_trng_trng_sw_reset                                                           (0x40001140)
#define mask_trng_trng_sw_reset_trng_sw_reset                        (0x1)                           

#define reg_trng_trng_busy                                         (*(volatile uint32_t *)0x400011b8)
#define adr_trng_trng_busy                                                               (0x400011b8)
#define mask_trng_trng_busy_trng_busy                                (0x1)                           

#define reg_trng_rst_bits_counter                                  (*(volatile uint32_t *)0x400011bc)
#define adr_trng_rst_bits_counter                                                        (0x400011bc)
#define mask_trng_rst_bits_counter_rst_bits_counter                  (0x1)                           

#define reg_trng_trng_version                                      (*(volatile uint32_t *)0x400011c0)
#define adr_trng_trng_version                                                            (0x400011c0)
#define mask_trng_trng_version_trng_version                          (0xff)                          

#define reg_trng_rng_bist_cntr0                                    (*(volatile uint32_t *)0x400011e0)
#define adr_trng_rng_bist_cntr0                                                          (0x400011e0)
#define mask_trng_rng_bist_cntr0_rosc_cntr_val0                      (0x3fffff)                      

#define reg_trng_rng_bist_cntr1                                    (*(volatile uint32_t *)0x400011e4)
#define adr_trng_rng_bist_cntr1                                                          (0x400011e4)
#define mask_trng_rng_bist_cntr1_rosc_cntr_val1                      (0x3fffff)                      

#define reg_trng_rng_bist_cntr2                                    (*(volatile uint32_t *)0x400011e8)
#define adr_trng_rng_bist_cntr2                                                          (0x400011e8)
#define mask_trng_rng_bist_cntr2_rosc_cntr_val2                      (0x3fffff)                      

#define reg_trnga_ana_cnt1                                         (*(volatile uint32_t *)0x400011ec)
#define adr_trnga_ana_cnt1                                                               (0x400011ec)
#define mask_trnga_ana_cnt1_reserved2                                (0xffe00000)                    
#define mask_trnga_ana_cnt1_trnga_ext_cg_en                          (0x100000)                      
#define mask_trnga_ana_cnt1_trnga_clk_div                            (0xf0000)                       
#define mask_trnga_ana_cnt1_reserved1                                (0xffc0)                        
#define mask_trnga_ana_cnt1_clk_manual                               (0x20)                          
#define mask_trnga_ana_cnt1_clk_manual_sel                           (0x10)                          
#define mask_trnga_ana_cnt1_reserved0                                (0x8)                           
#define mask_trnga_ana_cnt1_mode                                     (0x4)                           
#define mask_trnga_ana_cnt1_dly_sel                                  (0x3)                           

#define reg_trnga_trnga_dat                                        (*(volatile uint32_t *)0x400011f0)
#define adr_trnga_trnga_dat                                                              (0x400011f0)
#define mask_trnga_trnga_dat_trnga_dat                               (0xffff)                        


//---------------------------------------------------
// trxs_ret_pd in  domain address definition
//---------------------------------------------------

#define reg_trxs_ret_pd_t1t2_sel                                        (*(volatile uint32_t *)0x40008000)
#define adr_trxs_ret_pd_t1t2_sel                                                              (0x40008000)
#define mask_trxs_ret_pd_t1t2_sel_t2_time                                 (0xff00)                        
#define mask_trxs_ret_pd_t1t2_sel_t1_time                                 (0xff)                          

