EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_trxs_ret_pd_t3t4t5_sel                                      (*(volatile uint32_t *)0x40008004)
#define adr_trxs_ret_pd_t3t4t5_sel                                                            (0x40008004)
#define mask_trxs_ret_pd_t3t4t5_sel_bp_2g4_lock                           (0x8000)                        
#define mask_trxs_ret_pd_t3t4t5_sel_t1_ov_set                             (0x7000)                        
#define mask_trxs_ret_pd_t3t4t5_sel_t5_time                               (0xf00)                         
#define mask_trxs_ret_pd_t3t4t5_sel_t3_time                               (0xc0)                          
#define mask_trxs_ret_pd_t3t4t5_sel_t4_time                               (0x3f)                          

#define reg_trxs_ret_pd_t6t7_sel                                        (*(volatile uint32_t *)0x40008008)
#define adr_trxs_ret_pd_t6t7_sel                                                              (0x40008008)
#define mask_trxs_ret_pd_t6t7_sel_t7_cycle                                (0xff00)                        
#define mask_trxs_ret_pd_t6t7_sel_t6_cycle                                (0xff)                          

#define reg_trxs_ret_pd_t8_time                                         (*(volatile uint32_t *)0x4000800c)
#define adr_trxs_ret_pd_t8_time                                                               (0x4000800c)

#define reg_trxs_ret_pd_lo_adrs                                         (*(volatile uint32_t *)0x40008010)
#define adr_trxs_ret_pd_lo_adrs                                                               (0x40008010)

#define reg_trxs_ret_pd_auto_write_en                                   (*(volatile uint32_t *)0x40008014)
#define adr_trxs_ret_pd_auto_write_en                                                         (0x40008014)

#define reg_trxs_ret_pd_base_offset                                     (*(volatile uint32_t *)0x40008018)
#define adr_trxs_ret_pd_base_offset                                                           (0x40008018)

#define reg_trxs_ret_pd_tx_bgn_dat_reg                                  (*(volatile uint32_t *)0x40008020)
#define adr_trxs_ret_pd_tx_bgn_dat_reg                                                        (0x40008020)
#define mask_trxs_ret_pd_tx_bgn_dat_reg_tx_bgn_dat                        (0xffff)                        

#define reg_trxs_ret_pd_tx_end_dat_reg                                  (*(volatile uint32_t *)0x40008024)
#define adr_trxs_ret_pd_tx_end_dat_reg                                                        (0x40008024)
#define mask_trxs_ret_pd_tx_end_dat_reg_tx_end_dat                        (0xffff)                        

#define reg_trxs_ret_pd_rx_bgn_dat_reg                                  (*(volatile uint32_t *)0x40008028)
#define adr_trxs_ret_pd_rx_bgn_dat_reg                                                        (0x40008028)
#define mask_trxs_ret_pd_rx_bgn_dat_reg_rx_bgn_dat                        (0xffff)                        

#define reg_trxs_ret_pd_rx_end_dat_reg                                  (*(volatile uint32_t *)0x4000802c)
#define adr_trxs_ret_pd_rx_end_dat_reg                                                        (0x4000802c)
#define mask_trxs_ret_pd_rx_end_dat_reg_rx_end_dat                        (0xffff)                        

#define reg_trxs_ret_pd_tx_bgn_adr_set                                  (*(volatile uint32_t *)0x40008030)
#define adr_trxs_ret_pd_tx_bgn_adr_set                                                        (0x40008030)
#define mask_trxs_ret_pd_tx_bgn_adr_set_tx_bgn_burst_en                   (0x8000)                        
#define mask_trxs_ret_pd_tx_bgn_adr_set_tx_bgn_adr                        (0x7fff)                        

#define reg_trxs_ret_pd_tx_end_adr_set                                  (*(volatile uint32_t *)0x40008034)
#define adr_trxs_ret_pd_tx_end_adr_set                                                        (0x40008034)
#define mask_trxs_ret_pd_tx_end_adr_set_tx_end_burst_en                   (0x8000)                        
#define mask_trxs_ret_pd_tx_end_adr_set_tx_end_adr                        (0x7fff)                        

#define reg_trxs_ret_pd_rx_bgn_adr_set                                  (*(volatile uint32_t *)0x40008038)
#define adr_trxs_ret_pd_rx_bgn_adr_set                                                        (0x40008038)
#define mask_trxs_ret_pd_rx_bgn_adr_set_rx_bgn_burst_en                   (0x8000)                        
#define mask_trxs_ret_pd_rx_bgn_adr_set_rx_bgn_adr                        (0x7fff)                        

#define reg_trxs_ret_pd_rx_end_adr_set                                  (*(volatile uint32_t *)0x4000803c)
#define adr_trxs_ret_pd_rx_end_adr_set                                                        (0x4000803c)
#define mask_trxs_ret_pd_rx_end_adr_set_rx_end_burst_en                   (0x8000)                        
#define mask_trxs_ret_pd_rx_end_adr_set_rx_end_adr                        (0x7fff)                        

#define reg_trxs_ret_pd_slot_set                                        (*(volatile uint32_t *)0x40008040)
#define adr_trxs_ret_pd_slot_set                                                              (0x40008040)
#define mask_trxs_ret_pd_slot_set_slot_time_host_en                       (0x10)                          
#define mask_trxs_ret_pd_slot_set_host_slot_time                          (0xc)                           
#define mask_trxs_ret_pd_slot_set_aoa_slot_time                           (0x3)                           

#define reg_trxs_ret_pd_ant_set1                                        (*(volatile uint32_t *)0x40008044)
#define adr_trxs_ret_pd_ant_set1                                                              (0x40008044)
#define mask_trxs_ret_pd_ant_set1_ant_cfg3                                (0x7000)                        
#define mask_trxs_ret_pd_ant_set1_ant_cfg2                                (0xe00)                         
#define mask_trxs_ret_pd_ant_set1_ant_cfg1                                (0x1c0)                         
#define mask_trxs_ret_pd_ant_set1_txant_cfg0                              (0x38)                          
#define mask_trxs_ret_pd_ant_set1_ant_num                                 (0x7)                           

#define reg_trxs_ret_pd_ant_set2                                        (*(volatile uint32_t *)0x40008048)
#define adr_trxs_ret_pd_ant_set2                                                              (0x40008048)
#define mask_trxs_ret_pd_ant_set2_rxant_cfg0                              (0x7000)                        
#define mask_trxs_ret_pd_ant_set2_ant_cfg7                                (0xe00)                         
#define mask_trxs_ret_pd_ant_set2_ant_cfg6                                (0x1c0)                         
#define mask_trxs_ret_pd_ant_set2_ant_cfg5                                (0x38)                          
#define mask_trxs_ret_pd_ant_set2_ant_cfg4                                (0x7)                           

