EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_trxs_ret_pd_sw_offset_cfg                                   (*(volatile uint32_t *)0x4000804c)
#define adr_trxs_ret_pd_sw_offset_cfg                                                         (0x4000804c)
#define mask_trxs_ret_pd_sw_offset_cfg_tone_bgn_ofset                     (0xff0)                         
#define mask_trxs_ret_pd_sw_offset_cfg_tone_switch_offset                 (0xf)                           

#define reg_trxs_ret_pd_lo_on_off_cfg                                   (*(volatile uint32_t *)0x40008050)
#define adr_trxs_ret_pd_lo_on_off_cfg                                                         (0x40008050)
#define mask_trxs_ret_pd_lo_on_off_cfg_lo_off                             (0x7c00)                        
#define mask_trxs_ret_pd_lo_on_off_cfg_rx_lo_on                           (0x3e0)                         
#define mask_trxs_ret_pd_lo_on_off_cfg_tx_lo_on                           (0x1f)                          

#define reg_rdmode_ret_pd_mode_host_reg                                 (*(volatile uint32_t *)0x40008054)
#define adr_rdmode_ret_pd_mode_host_reg                                                       (0x40008054)
#define mask_rdmode_ret_pd_mode_host_reg_tx_en                            (0x8000)                        
#define mask_rdmode_ret_pd_mode_host_reg_rx_en                            (0x4000)                        
#define mask_rdmode_ret_pd_mode_host_reg_nbt_ble                          (0x2000)                        
#define mask_rdmode_ret_pd_mode_host_reg_clk_ana_dig_en                   (0x1000)                        
#define mask_rdmode_ret_pd_mode_host_reg_rst_act_n                        (0x800)                         
#define mask_rdmode_ret_pd_mode_host_reg_reserved                         (0x600)                         
#define mask_rdmode_ret_pd_mode_host_reg_data_rate                        (0x180)                         
#define mask_rdmode_ret_pd_mode_host_reg_chn_num                          (0x7f)                          

#define reg_mode_ret_pd_ctrl_reg                                        (*(volatile uint32_t *)0x40008058)
#define adr_mode_ret_pd_ctrl_reg                                                              (0x40008058)
#define mask_mode_ret_pd_ctrl_reg_act_digen_sel                           (0x1000)                        
#define mask_mode_ret_pd_ctrl_reg_act_rst_sel                             (0x800)                         
#define mask_mode_ret_pd_ctrl_reg_radio_reg_spi_read                      (0x400)                         
#define mask_mode_ret_pd_ctrl_reg_agc_sel                                 (0x200)                         
#define mask_mode_ret_pd_ctrl_reg_chn_num_sel                             (0x100)                         
#define mask_mode_ret_pd_ctrl_reg_txdata                                  (0xc0)                          
#define mask_mode_ret_pd_ctrl_reg_trxen                                   (0x30)                          
#define mask_mode_ret_pd_ctrl_reg_rate                                    (0xc)                           
#define mask_mode_ret_pd_ctrl_reg_nbt_ble                                 (0x3)                           

#define reg_ctrl_ret_pd_rd_mode                                         (*(volatile uint32_t *)0x4000805c)
#define adr_ctrl_ret_pd_rd_mode                                                               (0x4000805c)
#define mask_ctrl_ret_pd_rd_mode_rd_dbg_rstclk_force1_en                  (0x8)                           
#define mask_ctrl_ret_pd_rd_mode_rd_clk_free_en                           (0x4)                           
#define mask_ctrl_ret_pd_rd_mode_rd_rst_free_en                           (0x2)                           
#define mask_ctrl_ret_pd_rd_mode_adc_fpga_en                              (0x1)                           

#define reg_clk_ret_pd_clk_ext_cg_en_reg                                (*(volatile uint32_t *)0x400080cc)
#define adr_clk_ret_pd_clk_ext_cg_en_reg                                                      (0x400080cc)
#define mask_clk_ret_pd_clk_ext_cg_en_reg_sdm_cg_en                       (0x800)                         
#define mask_clk_ret_pd_clk_ext_cg_en_reg_vcocali_cg_en                   (0x400)                         
#define mask_clk_ret_pd_clk_ext_cg_en_reg_apb_ext_cg_en                   (0x200)                         
#define mask_clk_ret_pd_clk_ext_cg_en_reg_trxs_ext_cg_en                  (0x100)                         
#define mask_clk_ret_pd_clk_ext_cg_en_reg_lo_ext_cg_en                    (0x80)                          
#define mask_clk_ret_pd_clk_ext_cg_en_reg_adc_ana_ext_cg_en               (0x40)                          
#define mask_clk_ret_pd_clk_ext_cg_en_reg_dyn_dcoc_ext_cg_en              (0x20)                          
#define mask_clk_ret_pd_clk_ext_cg_en_reg_rfmux_ext_cg_en                 (0x10)                          
#define mask_clk_ret_pd_clk_ext_cg_en_reg_dtm_ext_cg_en                   (0x4)                           
#define mask_clk_ret_pd_clk_ext_cg_en_reg_modem_rx_ext_cg_en              (0x2)                           
#define mask_clk_ret_pd_clk_ext_cg_en_reg_modem_tx_ext_cg_en              (0x1)                           

#define reg_clk_ret_pd_clk_en_reg                                       (*(volatile uint32_t *)0x400080d0)
#define adr_clk_ret_pd_clk_en_reg                                                             (0x400080d0)
#define mask_clk_ret_pd_clk_en_reg_sdm_lo_gate_by_syn_ldo                 (0x40)                          
#define mask_clk_ret_pd_clk_en_reg_out_sel                                (0x30)                          
#define mask_clk_ret_pd_clk_en_reg_out_en                                 (0x8)                           
#define mask_clk_ret_pd_clk_en_reg_rfdig_fd_en                            (0x4)                           
#define mask_clk_ret_pd_clk_en_reg_rfdig_iomux_en                         (0x2)                           
#define mask_clk_ret_pd_clk_en_reg_rfdig_dcoc_en                          (0x1)                           

#define reg_rfdig_ret_pd_soft_reset_reg                                 (*(volatile uint32_t *)0x400080d4)
#define adr_rfdig_ret_pd_soft_reset_reg                                                       (0x400080d4)
#define mask_rfdig_ret_pd_soft_reset_reg_rst_sdm_n                        (0x100)                         
#define mask_rfdig_ret_pd_soft_reset_reg_rst_trxs_n                       (0x80)                          
#define mask_rfdig_ret_pd_soft_reset_reg_rst_lo16_n                       (0x40)                          
#define mask_rfdig_ret_pd_soft_reset_reg_rst_dtm_n                        (0x20)                          
#define mask_rfdig_ret_pd_soft_reset_reg_rst_mdm_n                        (0x10)                          
#define mask_rfdig_ret_pd_soft_reset_reg_rst_txp_n                        (0x8)                           
#define mask_rfdig_ret_pd_soft_reset_reg_rfmux_reset_n                    (0x4)                           
#define mask_rfdig_ret_pd_soft_reset_reg_fd_reset_n                       (0x2)                           
#define mask_rfdig_ret_pd_soft_reset_reg_dcoc_reset_n                     (0x1)                           

#define reg_brxp_ret_pd_brxp_ctrl_reg                                   (*(volatile uint32_t *)0x400080d8)
#define adr_brxp_ret_pd_brxp_ctrl_reg                                                         (0x400080d8)
#define mask_brxp_ret_pd_brxp_ctrl_reg_agc_dc_remove_step                 (0xc0)                          
#define mask_brxp_ret_pd_brxp_ctrl_reg_gpadc_edge_sel                     (0x20)                          
#define mask_brxp_ret_pd_brxp_ctrl_reg_lsb_zero                           (0x10)                          
#define mask_brxp_ret_pd_brxp_ctrl_reg_clk_edge_sel                       (0x8)                           
#define mask_brxp_ret_pd_brxp_ctrl_reg_iq_swap                            (0x4)                           
#define mask_brxp_ret_pd_brxp_ctrl_reg_i_en                               (0x2)                           
#define mask_brxp_ret_pd_brxp_ctrl_reg_q_en                               (0x1)                           

#define reg_rfmux_ret_pd_btrx_rx_2m_rate_fd_offset                      (*(volatile uint32_t *)0x400080dc)
#define adr_rfmux_ret_pd_btrx_rx_2m_rate_fd_offset                                            (0x400080dc)
#define mask_rfmux_ret_pd_btrx_rx_2m_rate_fd_offset_btrx_rx_fd_offset_2m  (0x7f)                          

