EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_rfmux_ret_pd_host_btrx_fd_offset_reg                        (*(volatile uint32_t *)0x400080e0)
#define adr_rfmux_ret_pd_host_btrx_fd_offset_reg                                              (0x400080e0)
#define mask_rfmux_ret_pd_host_btrx_fd_offset_reg_RX_FD_OFFSET            (0x7f)                          

#define reg_rfmux_ret_pd_holtek_mode_table_idx_reg                      (*(volatile uint32_t *)0x400080e8)
#define adr_rfmux_ret_pd_holtek_mode_table_idx_reg                                            (0x400080e8)
#define mask_rfmux_ret_pd_holtek_mode_table_idx_reg_mode_idx              (0x3)                           

#define reg_rfmux_ret_pd_control_mode_cfg                               (*(volatile uint32_t *)0x400080ec)
#define adr_rfmux_ret_pd_control_mode_cfg                                                     (0x400080ec)
#define mask_rfmux_ret_pd_control_mode_cfg_exlna_polarity                 (0x800)                         
#define mask_rfmux_ret_pd_control_mode_cfg_exlna_host                     (0x400)                         
#define mask_rfmux_ret_pd_control_mode_cfg_exlna_host_en                  (0x200)                         
#define mask_rfmux_ret_pd_control_mode_cfg_expa_polarity                  (0x100)                         
#define mask_rfmux_ret_pd_control_mode_cfg_expa_host                      (0x80)                          
#define mask_rfmux_ret_pd_control_mode_cfg_expa_sel                       (0x60)                          
#define mask_rfmux_ret_pd_control_mode_cfg_txpower_host_en                (0x10)                          
#define mask_rfmux_ret_pd_control_mode_cfg_btrx_host_en                   (0x8)                           
#define mask_rfmux_ret_pd_control_mode_cfg_sw_host_en                     (0x4)                           
#define mask_rfmux_ret_pd_control_mode_cfg_mode_ht32_en                   (0x2)                           
#define mask_rfmux_ret_pd_control_mode_cfg_mode_host_en                   (0x1)                           

#define reg_fd_ret_pd_tune_sel                                          (*(volatile uint32_t *)0x400080f0)
#define adr_fd_ret_pd_tune_sel                                                                (0x400080f0)

#define reg_fd_ret_pd_btrx_tune_ctrl                                    (*(volatile uint32_t *)0x400080f4)
#define adr_fd_ret_pd_btrx_tune_ctrl                                                          (0x400080f4)

#define reg_ioproc_ret_pd_io_proc_sel_reg                               (*(volatile uint32_t *)0x400080f8)
#define adr_ioproc_ret_pd_io_proc_sel_reg                                                     (0x400080f8)
#define mask_ioproc_ret_pd_io_proc_sel_reg_trx_glitch_en                  (0x20)                          
#define mask_ioproc_ret_pd_io_proc_sel_reg_agc_pos_sel                    (0x10)                          
#define mask_ioproc_ret_pd_io_proc_sel_reg_rate_pos_sel                   (0x8)                           
#define mask_ioproc_ret_pd_io_proc_sel_reg_gfsk_pos_sel                   (0x4)                           
#define mask_ioproc_ret_pd_io_proc_sel_reg_brxp_input_data_sel            (0x3)                           

#define reg_rfmux_ret_pd_pa_gain_sel                                    (*(volatile uint32_t *)0x400080fc)
#define adr_rfmux_ret_pd_pa_gain_sel                                                          (0x400080fc)
#define mask_rfmux_ret_pd_pa_gain_sel_pa_gain                             (0x7)                           

#define reg_rfmux_ret_pd_mode_en_tbl_idle_wd0_reg                       (*(volatile uint32_t *)0x40008100)
#define adr_rfmux_ret_pd_mode_en_tbl_idle_wd0_reg                                             (0x40008100)
#define mask_rfmux_ret_pd_mode_en_tbl_idle_wd0_reg_mode_en_tbl_idle_wd0   (0xffff)                        

#define reg_rfmux_ret_pd_mode_en_tbl_tx_wd0_reg                         (*(volatile uint32_t *)0x40008104)
#define adr_rfmux_ret_pd_mode_en_tbl_tx_wd0_reg                                               (0x40008104)
#define mask_rfmux_ret_pd_mode_en_tbl_tx_wd0_reg_mode_en_tbl_tx_wd0       (0xffff)                        

#define reg_rfmux_ret_pd_mode_en_tbl_rx_wd0_reg                         (*(volatile uint32_t *)0x40008108)
#define adr_rfmux_ret_pd_mode_en_tbl_rx_wd0_reg                                               (0x40008108)
#define mask_rfmux_ret_pd_mode_en_tbl_rx_wd0_reg_mode_en_tbl_rx_wd0       (0xffff)                        

#define reg_rfmux_ret_pd_btrx_rx_fd_offset_reg                          (*(volatile uint32_t *)0x4000810c)
#define adr_rfmux_ret_pd_btrx_rx_fd_offset_reg                                                (0x4000810c)
#define mask_rfmux_ret_pd_btrx_rx_fd_offset_reg_btrx_rx_fd_offset_entry1  (0x3f80)                        
#define mask_rfmux_ret_pd_btrx_rx_fd_offset_reg_btrx_rx_fd_offset_entry0  (0x7f)                          

#define reg_soi_ret_pd_tbl_cfg0                                         (*(volatile uint32_t *)0x40008110)
#define adr_soi_ret_pd_tbl_cfg0                                                               (0x40008110)
#define mask_soi_ret_pd_tbl_cfg0_rfon_time_sel                            (0x200)                         
#define mask_soi_ret_pd_tbl_cfg0_ctrl3                                    (0x1c0)                         
#define mask_soi_ret_pd_tbl_cfg0_ctrl2                                    (0x38)                          
#define mask_soi_ret_pd_tbl_cfg0_ctrl1                                    (0x7)                           

#define reg_soi_ret_pd_tbl_cfg1                                         (*(volatile uint32_t *)0x40008114)
#define adr_soi_ret_pd_tbl_cfg1                                                               (0x40008114)
#define mask_soi_ret_pd_tbl_cfg1_ctrl7                                    (0xe00)                         
#define mask_soi_ret_pd_tbl_cfg1_ctrl6                                    (0x1c0)                         
#define mask_soi_ret_pd_tbl_cfg1_ctrl5                                    (0x38)                          
#define mask_soi_ret_pd_tbl_cfg1_ctrl4                                    (0x7)                           

#define reg_rfmux_ret_pd_bw_cfg                                         (*(volatile uint32_t *)0x40008118)
#define adr_rfmux_ret_pd_bw_cfg                                                               (0x40008118)
#define mask_rfmux_ret_pd_bw_cfg_bw1m_r                                   (0xff00)                        
#define mask_rfmux_ret_pd_bw_cfg_bw2m_r                                   (0xff)                          

#define reg_rfmux_ret_pd_dcoc_host_cfg                                  (*(volatile uint32_t *)0x4000811c)
#define adr_rfmux_ret_pd_dcoc_host_cfg                                                        (0x4000811c)
#define mask_rfmux_ret_pd_dcoc_host_cfg_pga_2m_bw_host_en                 (0x8)                           
#define mask_rfmux_ret_pd_dcoc_host_cfg_pga_2m_if_host_en                 (0x4)                           
#define mask_rfmux_ret_pd_dcoc_host_cfg_btrx_dcoc_tia_host_en             (0x2)                           
#define mask_rfmux_ret_pd_dcoc_host_cfg_btrx_dcoc_pga_host_en             (0x1)                           

#define reg_dcoc_ret_pd_dyn_set                                         (*(volatile uint32_t *)0x40008120)
#define adr_dcoc_ret_pd_dyn_set                                                               (0x40008120)
#define mask_dcoc_ret_pd_dyn_set_dyn_rng                                  (0x7e0)                         
#define mask_dcoc_ret_pd_dyn_set_dyn_dis                                  (0x10)                          
#define mask_dcoc_ret_pd_dyn_set_dyn_dly_us                               (0xf)                           

#define reg_txp_ret_pd_txp_cfg1                                         (*(volatile uint32_t *)0x40008124)
#define adr_txp_ret_pd_txp_cfg1                                                               (0x40008124)
#define mask_txp_ret_pd_txp_cfg1_ramp_bp                                  (0x4000)                        
#define mask_txp_ret_pd_txp_cfg1_acw_exg_en                               (0x2000)                        
#define mask_txp_ret_pd_txp_cfg1_rs_cnt16_sel                             (0x1000)                        
#define mask_txp_ret_pd_txp_cfg1_acw_bp                                   (0x800)                         
#define mask_txp_ret_pd_txp_cfg1_acw_dly                                  (0x700)                         
#define mask_txp_ret_pd_txp_cfg1_ramp_step                                (0xf0)                          
#define mask_txp_ret_pd_txp_cfg1_gfskscl                                  (0xf)                           

#define reg_txp_ret_pd_txp_cfg2                                         (*(volatile uint32_t *)0x40008128)
#define adr_txp_ret_pd_txp_cfg2                                                               (0x40008128)
#define mask_txp_ret_pd_txp_cfg2_a2pscl                                   (0xff)                          

#define reg_txp_ret_pd_acw_vlu_reg                                      (*(volatile uint32_t *)0x4000812c)
#define adr_txp_ret_pd_acw_vlu_reg                                                            (0x4000812c)
#define mask_txp_ret_pd_acw_vlu_reg_ramp_time                             (0xff00)                        
#define mask_txp_ret_pd_acw_vlu_reg_acw_vlu                               (0xff)                          

#define reg_txp_ret_pd_gfcw_vlu_reg                                     (*(volatile uint32_t *)0x40008130)
#define adr_txp_ret_pd_gfcw_vlu_reg                                                           (0x40008130)
#define mask_txp_ret_pd_gfcw_vlu_reg_gfcw_scl_host_en                     (0x100)                         
#define mask_txp_ret_pd_gfcw_vlu_reg_gfcw_scl_host                        (0xff)                          

#define reg_txp_ret_pd_txpower_host_reg                                 (*(volatile uint32_t *)0x40008134)
#define adr_txp_ret_pd_txpower_host_reg                                                       (0x40008134)
#define mask_txp_ret_pd_txpower_host_reg_txpower_host_vlue                (0xff)                          

