EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_modgain_ret_pd_base_freq_cfg                                (*(volatile uint32_t *)0x40008140)
#define adr_modgain_ret_pd_base_freq_cfg                                                      (0x40008140)
#define mask_modgain_ret_pd_base_freq_cfg_base_feq                        (0x3ff)                         

#define reg_modgain_ret_pd_adj_k_cfg                                    (*(volatile uint32_t *)0x40008144)
#define adr_modgain_ret_pd_adj_k_cfg                                                          (0x40008144)
#define mask_modgain_ret_pd_adj_k_cfg_k                                   (0xff)                          

#define reg_plldig_ret_pd_acw_cfg                                       (*(volatile uint32_t *)0x40008148)
#define adr_plldig_ret_pd_acw_cfg                                                             (0x40008148)
#define mask_plldig_ret_pd_acw_cfg_acw_mod_byp                            (0x4000)                        
#define mask_plldig_ret_pd_acw_cfg_acw_dly_sel                            (0x3f00)                        
#define mask_plldig_ret_pd_acw_cfg_acw_mod                                (0xff)                          

#define reg_plldig_ret_pd_fcw_cfg                                       (*(volatile uint32_t *)0x4000814c)
#define adr_plldig_ret_pd_fcw_cfg                                                             (0x4000814c)
#define mask_plldig_ret_pd_fcw_cfg_fcw_mod_byp                            (0x1000)                        
#define mask_plldig_ret_pd_fcw_cfg_fcw_mod                                (0xfff)                         

#define reg_plldig_ret_pd_fcw_dly_sel_reg                               (*(volatile uint32_t *)0x40008150)
#define adr_plldig_ret_pd_fcw_dly_sel_reg                                                     (0x40008150)
#define mask_plldig_ret_pd_fcw_dly_sel_reg_fcw_dly_sel                    (0x3f)                          

#define reg_plldig_ret_pd_fcw_ch1_reg                                   (*(volatile uint32_t *)0x40008154)
#define adr_plldig_ret_pd_fcw_ch1_reg                                                         (0x40008154)
#define mask_plldig_ret_pd_fcw_ch1_reg_fcw_byp                            (0x400)                         
#define mask_plldig_ret_pd_fcw_ch1_reg_fcw_ch1                            (0x3ff)                         

#define reg_plldig_ret_pd_fcw_ch0_reg                                   (*(volatile uint32_t *)0x40008158)
#define adr_plldig_ret_pd_fcw_ch0_reg                                                         (0x40008158)
#define mask_plldig_ret_pd_fcw_ch0_reg_fcw_ch0                            (0xffff)                        

#define reg_plldig_ret_pd_flo_ofset_reg                                 (*(volatile uint32_t *)0x4000815c)
#define adr_plldig_ret_pd_flo_ofset_reg                                                       (0x4000815c)
#define mask_plldig_ret_pd_flo_ofset_reg_flo_offset                       (0xfff)                         

#define reg_plldig_ret_pd_sdm_cfg                                       (*(volatile uint32_t *)0x40008160)
#define adr_plldig_ret_pd_sdm_cfg                                                             (0x40008160)
#define mask_plldig_ret_pd_sdm_cfg_rfdata_clkedge                         (0x2000)                        
#define mask_plldig_ret_pd_sdm_cfg_divn_dither                            (0x1000)                        
#define mask_plldig_ret_pd_sdm_cfg_divn_mash3                             (0x800)                         
#define mask_plldig_ret_pd_sdm_cfg_otw_order                              (0x600)                         
#define mask_plldig_ret_pd_sdm_cfg_otw_byp                                (0x100)                         
#define mask_plldig_ret_pd_sdm_cfg_otw_rbus                               (0xff)                          

#define reg_vcocali_ret_pd_modgain_scl_cfg                              (*(volatile uint32_t *)0x40008164)
#define adr_vcocali_ret_pd_modgain_scl_cfg                                                    (0x40008164)
#define mask_vcocali_ret_pd_modgain_scl_cfg_otw_sel                       (0x20)                          
#define mask_vcocali_ret_pd_modgain_scl_cfg_modgain_scale                 (0x1f)                          

#define reg_vcocali_ret_pd_modgain_cfg                                  (*(volatile uint32_t *)0x40008168)
#define adr_vcocali_ret_pd_modgain_cfg                                                        (0x40008168)
#define mask_vcocali_ret_pd_modgain_cfg_byp_modgain                       (0x1000)                        
#define mask_vcocali_ret_pd_modgain_cfg_modgain_rbus                      (0xfff)                         

#define reg_vcocali_ret_pd_vcotune_amp_cfg                              (*(volatile uint32_t *)0x4000816c)
#define adr_vcocali_ret_pd_vcotune_amp_cfg                                                    (0x4000816c)
#define mask_vcocali_ret_pd_vcotune_amp_cfg_vcobist                       (0x2000)                        
#define mask_vcocali_ret_pd_vcotune_amp_cfg_byp_amp                       (0x1000)                        
#define mask_vcocali_ret_pd_vcotune_amp_cfg_vcoib_rbus                    (0xf00)                         
#define mask_vcocali_ret_pd_vcotune_amp_cfg_byp_pvt                       (0x80)                          
#define mask_vcocali_ret_pd_vcotune_amp_cfg_vcotune_rbus                  (0x7f)                          

#define reg_vcocali_ret_pd_wait_cfg                                     (*(volatile uint32_t *)0x40008170)
#define adr_vcocali_ret_pd_wait_cfg                                                           (0x40008170)
#define mask_vcocali_ret_pd_wait_cfg_wait_startup                         (0x700)                         
#define mask_vcocali_ret_pd_wait_cfg_wait_gain                            (0xe0)                          
#define mask_vcocali_ret_pd_wait_cfg_wait_lock                            (0x1c)                          
#define mask_vcocali_ret_pd_wait_cfg_status_sel                           (0x3)                           

