EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_xo_ret_pd_xo_cfg                                            (*(volatile uint32_t *)0x40008174)
#define adr_xo_ret_pd_xo_cfg                                                                  (0x40008174)
#define mask_xo_ret_pd_xo_cfg_doubler_en                                  (0x4)                           
#define mask_xo_ret_pd_xo_cfg_sel                                         (0x3)                           

#define reg_radio_int_status                                            (*(volatile uint32_t *)0x40008198)
#define adr_radio_int_status                                                                  (0x40008198)

#define reg_radio_ret_pd_int_mask                                       (*(volatile uint32_t *)0x4000819c)
#define adr_radio_ret_pd_int_mask                                                             (0x4000819c)

#define reg_radio_int_clear                                             (*(volatile uint32_t *)0x400081a0)
#define adr_radio_int_clear                                                                   (0x400081a0)


//---------------------------------------------------
// RF_ret_pd in  domain address definition
//---------------------------------------------------

#define reg_RF_ret_pd_RBUS_CALI_PATH1_reg                          (*(volatile uint32_t *)0x40008800)
#define adr_RF_ret_pd_RBUS_CALI_PATH1_reg                                                (0x40008800)
#define mask_RF_ret_pd_RBUS_CALI_PATH1_reg_DCOC_COMP_RST             (0x100)                         
#define mask_RF_ret_pd_RBUS_CALI_PATH1_reg_FD_EN                     (0x80)                          
#define mask_RF_ret_pd_RBUS_CALI_PATH1_reg_PGA_OP_ICTRL              (0x60)                          
#define mask_RF_ret_pd_RBUS_CALI_PATH1_reg_PGA_DCOC_RANGE            (0x10)                          
#define mask_RF_ret_pd_RBUS_CALI_PATH1_reg_RXIF_VCM_CTRL             (0xc)                           
#define mask_RF_ret_pd_RBUS_CALI_PATH1_reg_RFBG_RES_SEL              (0x3)                           

#define reg_RF_ret_pd_RBUS_RXRF_CFG_reg                            (*(volatile uint32_t *)0x40008804)
#define adr_RF_ret_pd_RBUS_RXRF_CFG_reg                                                  (0x40008804)
#define mask_RF_ret_pd_RBUS_RXRF_CFG_reg_MIXER_DCOC_RANGE            (0x200)                         
#define mask_RF_ret_pd_RBUS_RXRF_CFG_reg_MIXER_TIA_ICTRL             (0x180)                         
#define mask_RF_ret_pd_RBUS_RXRF_CFG_reg_MIXER_LO_CTRL               (0x70)                          
#define mask_RF_ret_pd_RBUS_RXRF_CFG_reg_RXRF_LNA_TANK_CTRL          (0xf)                           

#define reg_RF_ret_pd_DCDCTEST_reg                                 (*(volatile uint32_t *)0x4000880c)
#define adr_RF_ret_pd_DCDCTEST_reg                                                       (0x4000880c)
#define mask_RF_ret_pd_DCDCTEST_reg_RXIF_TEST_EN                     (0x40)                          
#define mask_RF_ret_pd_DCDCTEST_reg_RXIF_TEST_CTRL                   (0x38)                          
#define mask_RF_ret_pd_DCDCTEST_reg_RF_DCTEST_CTRL                   (0x7)                           

#define reg_RF_ret_pd_LDOs_reg                                     (*(volatile uint32_t *)0x40008810)
#define adr_RF_ret_pd_LDOs_reg                                                           (0x40008810)
#define mask_RF_ret_pd_LDOs_reg_SYN_LOOP_FILTER_RES_RX               (0xe000)                        
#define mask_RF_ret_pd_LDOs_reg_SYN_LOOP_CP_CTRL_RX                  (0x1f00)                        
#define mask_RF_ret_pd_LDOs_reg_SYN_LOOP_FILTER_RES_TX               (0xe0)                          
#define mask_RF_ret_pd_LDOs_reg_SYN_LOOP_CP_CTRL_TX                  (0x1f)                          

#define reg_RF_ret_pd_SYN_CFG1_reg                                 (*(volatile uint32_t *)0x40008814)
#define adr_RF_ret_pd_SYN_CFG1_reg                                                       (0x40008814)
#define mask_RF_ret_pd_SYN_CFG1_reg_LDO_RF_EN_BY_SYN                 (0x200)                         
#define mask_RF_ret_pd_SYN_CFG1_reg_SYN_GATE_LO16                    (0x100)                         
#define mask_RF_ret_pd_SYN_CFG1_reg_SYN_VCO_PDET_CTRL                (0xe0)                          
#define mask_RF_ret_pd_SYN_CFG1_reg_SYN_VCOIB_RES                    (0x1c)                          
#define mask_RF_ret_pd_SYN_CFG1_reg_SYN_OTW_SMP_EDGE                 (0x2)                           
#define mask_RF_ret_pd_SYN_CFG1_reg_SYN_MMD_EDGE_SEL                 (0x1)                           

#define reg_RF_ret_pd_SYN_CFG2_reg                                 (*(volatile uint32_t *)0x40008818)
#define adr_RF_ret_pd_SYN_CFG2_reg                                                       (0x40008818)
#define mask_RF_ret_pd_SYN_CFG2_reg_SYN_CP_LEAK_CTRL                 (0x780)                         
#define mask_RF_ret_pd_SYN_CFG2_reg_SYN_CP_LEAK_DIR                  (0x40)                          
#define mask_RF_ret_pd_SYN_CFG2_reg_SYN_CP_LEAK_EN                   (0x20)                          
#define mask_RF_ret_pd_SYN_CFG2_reg_SYN_CPOUT_INIT                   (0x18)                          
#define mask_RF_ret_pd_SYN_CFG2_reg_SYN_PFD_DLY                      (0x6)                           
#define mask_RF_ret_pd_SYN_CFG2_reg_SYN_LOOP_RST                     (0x1)                           

#define reg_RF_ret_pd_PA_CTRL_reg                                  (*(volatile uint32_t *)0x4000881c)
#define adr_RF_ret_pd_PA_CTRL_reg                                                        (0x4000881c)
#define mask_RF_ret_pd_PA_CTRL_reg_PA_MODE                           (0x300)                         
#define mask_RF_ret_pd_PA_CTRL_reg_PA_ACW_SMP_BYP                    (0x80)                          
#define mask_RF_ret_pd_PA_CTRL_reg_PA_ACW_SMP_EDGE                   (0x40)                          
#define mask_RF_ret_pd_PA_CTRL_reg_PA_SYNC                           (0x20)                          
#define mask_RF_ret_pd_PA_CTRL_reg_PA_H2                             (0x1e)                          
#define mask_RF_ret_pd_PA_CTRL_reg_PA_DCC_EN                         (0x1)                           

#define reg_RF_ret_pd_RBUS_RFLDO_reg                               (*(volatile uint32_t *)0x40008820)
#define adr_RF_ret_pd_RBUS_RFLDO_reg                                                     (0x40008820)
#define mask_RF_ret_pd_RBUS_RFLDO_reg_LDO_RF_EXTCAP                  (0x8000)                        
#define mask_RF_ret_pd_RBUS_RFLDO_reg_LDO_RF_CFG                     (0x7000)                        
#define mask_RF_ret_pd_RBUS_RFLDO_reg_LDO_IF_BYP                     (0x800)                         
#define mask_RF_ret_pd_RBUS_RFLDO_reg_LDO_IF_CFG                     (0x700)                         
#define mask_RF_ret_pd_RBUS_RFLDO_reg_LDO_VCO_BYP                    (0x80)                          
#define mask_RF_ret_pd_RBUS_RFLDO_reg_LDO_VCO_CFG                    (0x70)                          
#define mask_RF_ret_pd_RBUS_RFLDO_reg_LDO_CP_BYP                     (0x8)                           
#define mask_RF_ret_pd_RBUS_RFLDO_reg_LDO_CP_CFG                     (0x7)                           

#define reg_RF_ret_pd_SYN_BACKUP                                   (*(volatile uint32_t *)0x40008824)
#define adr_RF_ret_pd_SYN_BACKUP                                                         (0x40008824)

#define reg_PGA_ret_pd_IF_R                                        (*(volatile uint32_t *)0x40008828)
#define adr_PGA_ret_pd_IF_R                                                              (0x40008828)

#define reg_RF_ret_pd_RFIO_TX_reg                                  (*(volatile uint32_t *)0x4000882c)
#define adr_RF_ret_pd_RFIO_TX_reg                                                        (0x4000882c)
#define mask_RF_ret_pd_RFIO_TX_reg_RFIO_CAP1_TX_10dBm                (0x1f00)                        
#define mask_RF_ret_pd_RFIO_TX_reg_RFIO_CAP1_TX_0dBm                 (0xf8)                          
#define mask_RF_ret_pd_RFIO_TX_reg_RFIO_CAP2_TX                      (0x7)                           

