EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_RF_ret_pd_RFIO_RX_reg                                  (*(volatile uint32_t *)0x40008830)
#define adr_RF_ret_pd_RFIO_RX_reg                                                        (0x40008830)
#define mask_RF_ret_pd_RFIO_RX_reg_RFIO_CAP1_RX                      (0x7c0)                         
#define mask_RF_ret_pd_RFIO_RX_reg_RFIO_CAP2_RX_LGAIN                (0x38)                          
#define mask_RF_ret_pd_RFIO_RX_reg_RFIO_CAP2_RX_HGAIN                (0x7)                           

#define reg_AUDIO0_RBUS_reg1                                       (*(volatile uint32_t *)0x40008884)
#define adr_AUDIO0_RBUS_reg1                                                             (0x40008884)
#define mask_AUDIO0_RBUS_reg1_MIC_BIAS_CTRL                          (0x38)                          
#define mask_AUDIO0_RBUS_reg1_ADC_EN                                 (0x4)                           
#define mask_AUDIO0_RBUS_reg1_ADC_BIAS_CFG                           (0x3)                           

#define reg_AUDIO0_RBUS_reg2                                       (*(volatile uint32_t *)0x40008888)
#define adr_AUDIO0_RBUS_reg2                                                             (0x40008888)
#define mask_AUDIO0_RBUS_reg2_MICBIAS_EXTREFA                        (0x80)                          
#define mask_AUDIO0_RBUS_reg2_MICBIAS_EXTREFB                        (0x40)                          
#define mask_AUDIO0_RBUS_reg2_MICBIAS_INTREF                         (0x20)                          
#define mask_AUDIO0_RBUS_reg2_P00_EN                                 (0x10)                          
#define mask_AUDIO0_RBUS_reg2_PGA_SHORT_INPUT                        (0x8)                           
#define mask_AUDIO0_RBUS_reg2_PGA_SINGLE_EN                          (0x4)                           
#define mask_AUDIO0_RBUS_reg2_VCM_CFG                                (0x3)                           

#define reg_AUD0_GP_ADC_AUD_reg                                    (*(volatile uint32_t *)0x4000888c)
#define adr_AUD0_GP_ADC_AUD_reg                                                          (0x4000888c)
#define mask_AUD0_GP_ADC_AUD_reg_ch_host_en                          (0x400)                         
#define mask_AUD0_GP_ADC_AUD_reg_ADC_AUD_BUF_GAIN                    (0x300)                         
#define mask_AUD0_GP_ADC_AUD_reg_ADC_AUD_BUF_EN                      (0x80)                          
#define mask_AUD0_GP_ADC_AUD_reg_ADC_AUD_BKUP                        (0x7c)                          
#define mask_AUD0_GP_ADC_AUD_reg_ADC_AUD_BIAS_CTRL                   (0x3)                           

#define reg_AUD0_ch_pga_ctrl0_cfg                                  (*(volatile uint32_t *)0x40008890)
#define adr_AUD0_ch_pga_ctrl0_cfg                                                        (0x40008890)
#define mask_AUD0_ch_pga_ctrl0_cfg_ch3_pga_g                         (0xf000)                        
#define mask_AUD0_ch_pga_ctrl0_cfg_ch2_pga_g                         (0xf00)                         
#define mask_AUD0_ch_pga_ctrl0_cfg_ch1_pga_g                         (0xf0)                          
#define mask_AUD0_ch_pga_ctrl0_cfg_ch0_pga_g                         (0xf)                           

#define reg_AUD0_ch_pga_ctrl1_cfg                                  (*(volatile uint32_t *)0x40008894)
#define adr_AUD0_ch_pga_ctrl1_cfg                                                        (0x40008894)
#define mask_AUD0_ch_pga_ctrl1_cfg_ch7_pga_g                         (0xf000)                        
#define mask_AUD0_ch_pga_ctrl1_cfg_ch6_pga_g                         (0xf00)                         
#define mask_AUD0_ch_pga_ctrl1_cfg_ch5_pga_g                         (0xf0)                          
#define mask_AUD0_ch_pga_ctrl1_cfg_ch4_pga_g                         (0xf)                           

#define reg_AUD0_ch_pga_ctrl2_cfg                                  (*(volatile uint32_t *)0x40008898)
#define adr_AUD0_ch_pga_ctrl2_cfg                                                        (0x40008898)
#define mask_AUD0_ch_pga_ctrl2_cfg_pga_host_en                       (0x100)                         
#define mask_AUD0_ch_pga_ctrl2_cfg_ch9_pga_g                         (0xf0)                          
#define mask_AUD0_ch_pga_ctrl2_cfg_ch8_pga_g                         (0xf)                           

#define reg_AUDIO1_RBUS_reg1                                       (*(volatile uint32_t *)0x400088c8)
#define adr_AUDIO1_RBUS_reg1                                                             (0x400088c8)
#define mask_AUDIO1_RBUS_reg1_MIC_BIAS_CTRL                          (0x38)                          
#define mask_AUDIO1_RBUS_reg1_ADC_EN                                 (0x4)                           
#define mask_AUDIO1_RBUS_reg1_ADC_BIAS_CFG                           (0x3)                           

#define reg_AUDIO1_RBUS_reg2                                       (*(volatile uint32_t *)0x400088cc)
#define adr_AUDIO1_RBUS_reg2                                                             (0x400088cc)
#define mask_AUDIO1_RBUS_reg2_MICBIAS_EXTREFA                        (0x80)                          
#define mask_AUDIO1_RBUS_reg2_MICBIAS_EXTREFB                        (0x40)                          
#define mask_AUDIO1_RBUS_reg2_MICBIAS_INTREF                         (0x20)                          
#define mask_AUDIO1_RBUS_reg2_P00_EN                                 (0x10)                          
#define mask_AUDIO1_RBUS_reg2_PGA_SHORT_INPUT                        (0x8)                           
#define mask_AUDIO1_RBUS_reg2_PGA_SINGLE_EN                          (0x4)                           
#define mask_AUDIO1_RBUS_reg2_VCM_CFG                                (0x3)                           

#define reg_AUD1_GP_ADC_AUD_reg                                    (*(volatile uint32_t *)0x400088d0)
#define adr_AUD1_GP_ADC_AUD_reg                                                          (0x400088d0)
#define mask_AUD1_GP_ADC_AUD_reg_ch_host_en                          (0x400)                         
#define mask_AUD1_GP_ADC_AUD_reg_ADC_AUD_BUF_GAIN                    (0x300)                         
#define mask_AUD1_GP_ADC_AUD_reg_ADC_AUD_BUF_EN                      (0x80)                          
#define mask_AUD1_GP_ADC_AUD_reg_ADC_AUD_BKUP                        (0x7c)                          
#define mask_AUD1_GP_ADC_AUD_reg_ADC_AUD_BIAS_CTRL                   (0x3)                           

