EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_AUD1_ch_pga_ctrl0_cfg                                  (*(volatile uint32_t *)0x400088d4)
#define adr_AUD1_ch_pga_ctrl0_cfg                                                        (0x400088d4)
#define mask_AUD1_ch_pga_ctrl0_cfg_ch3_pga_g                         (0xf000)                        
#define mask_AUD1_ch_pga_ctrl0_cfg_ch2_pga_g                         (0xf00)                         
#define mask_AUD1_ch_pga_ctrl0_cfg_ch1_pga_g                         (0xf0)                          
#define mask_AUD1_ch_pga_ctrl0_cfg_ch0_pga_g                         (0xf)                           

#define reg_AUD1_ch_pga_ctrl1_cfg                                  (*(volatile uint32_t *)0x400088d8)
#define adr_AUD1_ch_pga_ctrl1_cfg                                                        (0x400088d8)
#define mask_AUD1_ch_pga_ctrl1_cfg_ch7_pga_g                         (0xf000)                        
#define mask_AUD1_ch_pga_ctrl1_cfg_ch6_pga_g                         (0xf00)                         
#define mask_AUD1_ch_pga_ctrl1_cfg_ch5_pga_g                         (0xf0)                          
#define mask_AUD1_ch_pga_ctrl1_cfg_ch4_pga_g                         (0xf)                           

#define reg_AUD1_ch_pga_ctrl2_cfg                                  (*(volatile uint32_t *)0x400088dc)
#define adr_AUD1_ch_pga_ctrl2_cfg                                                        (0x400088dc)
#define mask_AUD1_ch_pga_ctrl2_cfg_pga_host_en                       (0x100)                         
#define mask_AUD1_ch_pga_ctrl2_cfg_ch9_pga_g                         (0xf0)                          
#define mask_AUD1_ch_pga_ctrl2_cfg_ch8_pga_g                         (0xf)                           


//---------------------------------------------------
// morx_ret_pd in  domain address definition
//---------------------------------------------------

#define reg_morx_ret_pd_agc_config_reg                             (*(volatile uint32_t *)0x40009000)
#define adr_morx_ret_pd_agc_config_reg                                                   (0x40009000)
#define mask_morx_ret_pd_agc_config_reg_aci_wait_num                 (0xf000)                        
#define mask_morx_ret_pd_agc_config_reg_agc_ripple_sel               (0x800)                         
#define mask_morx_ret_pd_agc_config_reg_avgf_bypass                  (0x400)                         
#define mask_morx_ret_pd_agc_config_reg_default_state                (0x200)                         
#define mask_morx_ret_pd_agc_config_reg_agc_step1_dcr_en             (0x100)                         
#define mask_morx_ret_pd_agc_config_reg_wb_dcr_n                     (0xe0)                          
#define mask_morx_ret_pd_agc_config_reg_agc_dcr_en                   (0x10)                          
#define mask_morx_ret_pd_agc_config_reg_agc_wait_num                 (0xf)                           

#define reg_morx_ret_pd_agc_rssi_max                               (*(volatile uint32_t *)0x40009004)
#define adr_morx_ret_pd_agc_rssi_max                                                     (0x40009004)
#define mask_morx_ret_pd_agc_rssi_max_agc_rssi_2_max                 (0xff00)                        
#define mask_morx_ret_pd_agc_rssi_max_agc_rssi_1_max                 (0xff)                          

#define reg_morx_ret_pd_agc_rssi_min                               (*(volatile uint32_t *)0x40009008)
#define adr_morx_ret_pd_agc_rssi_min                                                     (0x40009008)

#define reg_morx_ret_pd_agc_rssi_scl                               (*(volatile uint32_t *)0x4000900c)
#define adr_morx_ret_pd_agc_rssi_scl                                                     (0x4000900c)
#define mask_morx_ret_pd_agc_rssi_scl_agc_rssi_g1_th                 (0xfe00)                        
#define mask_morx_ret_pd_agc_rssi_scl_agc_rssi_dnscl                 (0x1c0)                         
#define mask_morx_ret_pd_agc_rssi_scl_agc_rssi_2_upscl               (0x38)                          
#define mask_morx_ret_pd_agc_rssi_scl_agc_rssi_1_upscl               (0x7)                           

#define reg_morx_ret_pd_agc_bb_ctrl                                (*(volatile uint32_t *)0x40009010)
#define adr_morx_ret_pd_agc_bb_ctrl                                                      (0x40009010)
#define mask_morx_ret_pd_agc_bb_ctrl_agc_aci_new_old                 (0x400)                         
#define mask_morx_ret_pd_agc_bb_ctrl_agc_step_sel                    (0x200)                         
#define mask_morx_ret_pd_agc_bb_ctrl_agc_gn_scl                      (0x1c0)                         
#define mask_morx_ret_pd_agc_bb_ctrl_reserved                        (0x30)                          
#define mask_morx_ret_pd_agc_bb_ctrl_bb_agc                          (0x6)                           
#define mask_morx_ret_pd_agc_bb_ctrl_bypass_mdm_agc                  (0x1)                           

#define reg_morx_ret_pd_agc_th                                     (*(volatile uint32_t *)0x40009014)
#define adr_morx_ret_pd_agc_th                                                           (0x40009014)
#define mask_morx_ret_pd_agc_th_agc_aci_step_1to0_th                 (0x7f8)                         
#define mask_morx_ret_pd_agc_th_agc_sat_th                           (0x7)                           

#define reg_morx_ret_pd_acr_process                                (*(volatile uint32_t *)0x40009018)
#define adr_morx_ret_pd_acr_process                                                      (0x40009018)
#define mask_morx_ret_pd_acr_process_aci_try_en                      (0x100)                         
#define mask_morx_ret_pd_acr_process_aci_try_sel                     (0xff)                          

#define reg_morx_ret_pd_agc_time_out_th                            (*(volatile uint32_t *)0x4000901c)
#define adr_morx_ret_pd_agc_time_out_th                                                  (0x4000901c)

#define reg_morx_ret_pd_cte                                        (*(volatile uint32_t *)0x40009028)
#define adr_morx_ret_pd_cte                                                              (0x40009028)
#define mask_morx_ret_pd_cte_samp_sel                                (0x30)                          
#define mask_morx_ret_pd_cte_samp_offset                             (0xf)                           

#define reg_morx_ret_pd_rssi_2_byte                                (*(volatile uint32_t *)0x4000902c)
#define adr_morx_ret_pd_rssi_2_byte                                                      (0x4000902c)

#define reg_morx_ret_pd_rssi_th                                    (*(volatile uint32_t *)0x40009030)
#define adr_morx_ret_pd_rssi_th                                                          (0x40009030)

#define reg_morx_ret_pd_rssi_trig                                  (*(volatile uint32_t *)0x40009034)
#define adr_morx_ret_pd_rssi_trig                                                        (0x40009034)

#define reg_morx_ret_pd_fo_ctrl                                    (*(volatile uint32_t *)0x40009038)
#define adr_morx_ret_pd_fo_ctrl                                                          (0x40009038)
#define mask_morx_ret_pd_fo_ctrl_hard_peak_th                        (0x6)                           
#define mask_morx_ret_pd_fo_ctrl_fbp_en                              (0x1)                           

#define reg_morx_ret_pd_radio_mode                                 (*(volatile uint32_t *)0x4000903c)
#define adr_morx_ret_pd_radio_mode                                                       (0x4000903c)
#define mask_morx_ret_pd_radio_mode_rd_mode                          (0x3)                           

