EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_morx_ret_pd_access_code_hi                             (*(volatile uint32_t *)0x40009040)
#define adr_morx_ret_pd_access_code_hi                                                   (0x40009040)

#define reg_morx_ret_pd_access_code_lo                             (*(volatile uint32_t *)0x40009044)
#define adr_morx_ret_pd_access_code_lo                                                   (0x40009044)

#define reg_morx_ret_pd_db_rssi_agc0                               (*(volatile uint32_t *)0x40009048)
#define adr_morx_ret_pd_db_rssi_agc0                                                     (0x40009048)

#define reg_morx_ret_pd_db_rssi_agc1                               (*(volatile uint32_t *)0x4000904c)
#define adr_morx_ret_pd_db_rssi_agc1                                                     (0x4000904c)

#define reg_morx_ret_pd_db_rssi_agc2                               (*(volatile uint32_t *)0x40009050)
#define adr_morx_ret_pd_db_rssi_agc2                                                     (0x40009050)

#define reg_morx_ret_pd_power_ant_sub_value                        (*(volatile uint32_t *)0x40009054)
#define adr_morx_ret_pd_power_ant_sub_value                                              (0x40009054)

#define reg_morx_ret_pd_agc_dco_th                                 (*(volatile uint32_t *)0x40009058)
#define adr_morx_ret_pd_agc_dco_th                                                       (0x40009058)

#define reg_morx_ret_pd_agc_pwr_th                                 (*(volatile uint32_t *)0x4000905c)
#define adr_morx_ret_pd_agc_pwr_th                                                       (0x4000905c)

#define reg_morx_ret_pd_agc_g1_th                                  (*(volatile uint32_t *)0x40009060)
#define adr_morx_ret_pd_agc_g1_th                                                        (0x40009060)

#define reg_morx_ret_pd_agc_ib_sel                                 (*(volatile uint32_t *)0x40009064)
#define adr_morx_ret_pd_agc_ib_sel                                                       (0x40009064)

#define reg_motx_ret_pd_gfsk_dly                                   (*(volatile uint32_t *)0x40009070)
#define adr_motx_ret_pd_gfsk_dly                                                         (0x40009070)

#define reg_motx_ret_pd_dat_swap_en                                (*(volatile uint32_t *)0x40009074)
#define adr_motx_ret_pd_dat_swap_en                                                      (0x40009074)

#define reg_motx_ret_pd_config                                     (*(volatile uint32_t *)0x40009078)
#define adr_motx_ret_pd_config                                                           (0x40009078)
#define mask_motx_ret_pd_config_trailing_time                        (0x70)                          
#define mask_motx_ret_pd_config_cte_dat                              (0xc)                           
#define mask_motx_ret_pd_config_sft_sel                              (0x3)                           


//---------------------------------------------------
// dbg in  domain address definition
//---------------------------------------------------

#define reg_dbg_cfg1                                               (*(volatile uint32_t *)0x40009820)
#define adr_dbg_cfg1                                                                     (0x40009820)
#define mask_dbg_cfg1_morx_sel                                       (0xf00)                         
#define mask_dbg_cfg1_adc_sel                                        (0xc0)                          
#define mask_dbg_cfg1_mdm_sel                                        (0x30)                          
#define mask_dbg_cfg1_txp_sel                                        (0xc)                           
#define mask_dbg_cfg1_out_sel                                        (0x3)                           

#define reg_rdon_sel                                               (*(volatile uint32_t *)0x40009824)
#define adr_rdon_sel                                                                     (0x40009824)
#define mask_rdon_sel_dp_sel                                         (0xf)                           

#define reg_fd_bgn                                                 (*(volatile uint32_t *)0x40009854)
#define adr_fd_bgn                                                                       (0x40009854)

#define reg_rfmux_RBUS_DCOC_CFG1_reg                               (*(volatile uint32_t *)0x40009860)
#define adr_rfmux_RBUS_DCOC_CFG1_reg                                                     (0x40009860)
#define mask_rfmux_RBUS_DCOC_CFG1_reg_MIXER_DCOCQ                    (0xff00)                        
#define mask_rfmux_RBUS_DCOC_CFG1_reg_MIXER_DCOCI                    (0xff)                          

#define reg_rfmux_RBUS_DCOC_CFG2_reg                               (*(volatile uint32_t *)0x40009864)
#define adr_rfmux_RBUS_DCOC_CFG2_reg                                                     (0x40009864)
#define mask_rfmux_RBUS_DCOC_CFG2_reg_PGA_DCOCQ                      (0xff00)                        
#define mask_rfmux_RBUS_DCOC_CFG2_reg_PGA_DCOCI                      (0xff)                          

#define reg_rfmux_RBUS_TRX_GAIN1_reg                               (*(volatile uint32_t *)0x40009868)
#define adr_rfmux_RBUS_TRX_GAIN1_reg                                                     (0x40009868)
#define mask_rfmux_RBUS_TRX_GAIN1_reg_PGA_GAIN                       (0x3c0)                         
#define mask_rfmux_RBUS_TRX_GAIN1_reg_MIXER_IF_G                     (0x38)                          
#define mask_rfmux_RBUS_TRX_GAIN1_reg_LNA_GAIN                       (0x7)                           

#define reg_rfmux_TRX_EN1_reg                                      (*(volatile uint32_t *)0x4000986c)
#define adr_rfmux_TRX_EN1_reg                                                            (0x4000986c)
#define mask_rfmux_TRX_EN1_reg_mode_en_tbl_host                      (0xffff)                        

#define reg_rfmux_2M_CFG_reg                                       (*(volatile uint32_t *)0x40009870)
#define adr_rfmux_2M_CFG_reg                                                             (0x40009870)
#define mask_rfmux_2M_CFG_reg_LNA_C                                  (0xc0)                          
#define mask_rfmux_2M_CFG_reg_RXRF_GM2_C                             (0x30)                          
#define mask_rfmux_2M_CFG_reg_RXRF_GM1_C                             (0xc)                           
#define mask_rfmux_2M_CFG_reg_PGA_2M_BW                              (0x2)                           
#define mask_rfmux_2M_CFG_reg_PGA_2M_IF                              (0x1)                           

#define reg_test_tx_en_bf_dat_time                                 (*(volatile uint32_t *)0x400098b4)
#define adr_test_tx_en_bf_dat_time                                                       (0x400098b4)

#define reg_modem_bluerf_test_set                                  (*(volatile uint32_t *)0x400098b8)
#define adr_modem_bluerf_test_set                                                        (0x400098b8)
#define mask_modem_bluerf_test_set_testber_dat_fr_adc                (0x20)                          
#define mask_modem_bluerf_test_set_tx_polsel_vld                     (0x10)                          
#define mask_modem_bluerf_test_set_test_continu_vld                  (0x8)                           
#define mask_modem_bluerf_test_set_srcsel                            (0x7)                           

#define reg_modem_process_ctrl                                     (*(volatile uint32_t *)0x400098bc)
#define adr_modem_process_ctrl                                                           (0x400098bc)
#define mask_modem_process_ctrl_test_end                             (0x4)                           
#define mask_modem_process_ctrl_ber_clr                              (0x2)                           
#define mask_modem_process_ctrl_test_start                           (0x1)                           

#define reg_test_rx_en_dur_time                                    (*(volatile uint32_t *)0x400098c0)
#define adr_test_rx_en_dur_time                                                          (0x400098c0)

#define reg_test_pkg_num                                           (*(volatile uint32_t *)0x400098c4)
#define adr_test_pkg_num                                                                 (0x400098c4)

