EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_test_pdu_length                                        (*(volatile uint32_t *)0x400098c8)
#define adr_test_pdu_length                                                              (0x400098c8)

#define reg_test_test_intv_set                                     (*(volatile uint32_t *)0x400098cc)
#define adr_test_test_intv_set                                                           (0x400098cc)
#define mask_test_test_intv_set_syn_dat_inv                          (0x800)                         
#define mask_test_test_intv_set_ble_bypass_white                     (0x400)                         
#define mask_test_test_intv_set_pkg_intv                             (0x3ff)                         

#define reg_test_ble_head                                          (*(volatile uint32_t *)0x400098d0)
#define adr_test_ble_head                                                                (0x400098d0)

#define reg_test_reg_set                                           (*(volatile uint32_t *)0x400098d4)
#define adr_test_reg_set                                                                 (0x400098d4)

#define reg_test_acc3                                              (*(volatile uint32_t *)0x400098d8)
#define adr_test_acc3                                                                    (0x400098d8)

#define reg_test_acc2                                              (*(volatile uint32_t *)0x400098dc)
#define adr_test_acc2                                                                    (0x400098dc)

#define reg_test_acc1                                              (*(volatile uint32_t *)0x400098e0)
#define adr_test_acc1                                                                    (0x400098e0)

#define reg_test_acc0                                              (*(volatile uint32_t *)0x400098e4)
#define adr_test_acc0                                                                    (0x400098e4)

#define reg_test_test_data_sel                                     (*(volatile uint32_t *)0x400098e8)
#define adr_test_test_data_sel                                                           (0x400098e8)
#define mask_test_test_data_sel_rssi_req                             (0x80)                          
#define mask_test_test_data_sel_ble_mode                             (0x40)                          
#define mask_test_test_data_sel_edr_mode                             (0x20)                          
#define mask_test_test_data_sel_rx_en                                (0x10)                          
#define mask_test_test_data_sel_code_rate                            (0xc)                           
#define mask_test_test_data_sel_data_rate                            (0x3)                           

#define reg_RF_SYN_TRX_reg                                         (*(volatile uint32_t *)0x40009938)
#define adr_RF_SYN_TRX_reg                                                               (0x40009938)
#define mask_RF_SYN_TRX_reg_idx_flo                                  (0xffc0)                        
#define mask_RF_SYN_TRX_reg_tx_sel                                   (0x20)                          
#define mask_RF_SYN_TRX_reg_SYN_OTW_SMP_BYP                          (0x10)                          
#define mask_RF_SYN_TRX_reg_adpll_start                              (0x8)                           
#define mask_RF_SYN_TRX_reg_SYN_TX_LOBUFF_EN                         (0x4)                           
#define mask_RF_SYN_TRX_reg_SYN_RX_LOBUFF_EN                         (0x2)                           
#define mask_RF_SYN_TRX_reg_SYN_LDO_SYN_EN                           (0x1)                           

#define reg_dcoc_dcoc_wait_tim_set                                 (*(volatile uint32_t *)0x40009948)
#define adr_dcoc_dcoc_wait_tim_set                                                       (0x40009948)
#define mask_dcoc_dcoc_wait_tim_set_mode_set_tw                      (0xc0)                          
#define mask_dcoc_dcoc_wait_tim_set_init_settle_tw                   (0x30)                          
#define mask_dcoc_dcoc_wait_tim_set_idac_settle_tw                   (0xc)                           
#define mask_dcoc_dcoc_wait_tim_set_gain_settle_tw                   (0x3)                           

#define reg_dcoc_dcoc_path_switch_reg                              (*(volatile uint32_t *)0x4000994c)
#define adr_dcoc_dcoc_path_switch_reg                                                    (0x4000994c)
#define mask_dcoc_dcoc_path_switch_reg_mode_adrs_sel                 (0xc00)                         
#define mask_dcoc_dcoc_path_switch_reg_k_std_up_sel                  (0x200)                         
#define mask_dcoc_dcoc_path_switch_reg_rd_dcoc_sel                   (0x180)                         
#define mask_dcoc_dcoc_path_switch_reg_dac_polarity_pga_ipath        (0x40)                          
#define mask_dcoc_dcoc_path_switch_reg_dac_polarity_pga_qpath        (0x20)                          
#define mask_dcoc_dcoc_path_switch_reg_dac_polarity_tia_ipath        (0x10)                          
#define mask_dcoc_dcoc_path_switch_reg_dac_polarity_tia_qpath        (0x8)                           
#define mask_dcoc_dcoc_path_switch_reg_sw_vcm_bt                     (0x4)                           
#define mask_dcoc_dcoc_path_switch_reg_complex_en                    (0x2)                           
#define mask_dcoc_dcoc_path_switch_reg_iqdac_exchange                (0x1)                           

#define reg_dcoc_dcoc_path_dc_target                               (*(volatile uint32_t *)0x40009950)
#define adr_dcoc_dcoc_path_dc_target                                                     (0x40009950)
#define mask_dcoc_dcoc_path_dc_target_dc_target                      (0x1ff)                         

#define reg_dcoc_bgn                                               (*(volatile uint32_t *)0x40009954)
#define adr_dcoc_bgn                                                                     (0x40009954)

