EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_dcoc_dcoc_ctrl_reg                                     (*(volatile uint32_t *)0x40009958)
#define adr_dcoc_dcoc_ctrl_reg                                                           (0x40009958)
#define mask_dcoc_dcoc_ctrl_reg_tia_bgn_channel                      (0x3f80)                        
#define mask_dcoc_dcoc_ctrl_reg_manu_gain_set                        (0x60)                          
#define mask_dcoc_dcoc_ctrl_reg_manu_mode_set                        (0x1e)                          
#define mask_dcoc_dcoc_ctrl_reg_manual_mode_en                       (0x1)                           

#define reg_dcoc_dcoc_work_en                                      (*(volatile uint32_t *)0x4000995c)
#define adr_dcoc_dcoc_work_en                                                            (0x4000995c)
#define mask_dcoc_dcoc_work_en_spur_bp_en                            (0x8)                           
#define mask_dcoc_dcoc_work_en_k_en                                  (0x4)                           
#define mask_dcoc_dcoc_work_en_pga_en                                (0x2)                           
#define mask_dcoc_dcoc_work_en_tia_en                                (0x1)                           

#define reg_dcoc_mode_adr                                          (*(volatile uint32_t *)0x40009960)
#define adr_dcoc_mode_adr                                                                (0x40009960)

#define reg_dcoc_dcoc_rng_set_reg                                  (*(volatile uint32_t *)0x40009964)
#define adr_dcoc_dcoc_rng_set_reg                                                        (0x40009964)
#define mask_dcoc_dcoc_rng_set_reg_chn_step                          (0x1f0)                         
#define mask_dcoc_dcoc_rng_set_reg_dac_offset                        (0xf)                           

#define reg_dcoc_pga_wdat1                                         (*(volatile uint32_t *)0x40009968)
#define adr_dcoc_pga_wdat1                                                               (0x40009968)

#define reg_dcoc_pga_wadr2                                         (*(volatile uint32_t *)0x4000996c)
#define adr_dcoc_pga_wadr2                                                               (0x4000996c)

#define reg_dcoc_pga_wdat2                                         (*(volatile uint32_t *)0x40009970)
#define adr_dcoc_pga_wdat2                                                               (0x40009970)

#define reg_dcoc_tia_wdat1                                         (*(volatile uint32_t *)0x40009984)
#define adr_dcoc_tia_wdat1                                                               (0x40009984)

#define reg_dcoc_k_wdat1                                           (*(volatile uint32_t *)0x4000999c)
#define adr_dcoc_k_wdat1                                                                 (0x4000999c)

#define reg_dcoc_k_wadr2                                           (*(volatile uint32_t *)0x400099a0)
#define adr_dcoc_k_wadr2                                                                 (0x400099a0)

#define reg_dcoc_k_wdat2                                           (*(volatile uint32_t *)0x400099a4)
#define adr_dcoc_k_wdat2                                                                 (0x400099a4)

#define reg_dcoc_back_wadr2                                        (*(volatile uint32_t *)0x400099b4)
#define adr_dcoc_back_wadr2                                                              (0x400099b4)

#define reg_dcoc_back_wdat2                                        (*(volatile uint32_t *)0x400099b8)
#define adr_dcoc_back_wdat2                                                              (0x400099b8)

#define reg_rxp_dc_offset                                          (*(volatile uint32_t *)0x400099c4)
#define adr_rxp_dc_offset                                                                (0x400099c4)
#define mask_rxp_dc_offset_dci_offset                                (0xff00)                        
#define mask_rxp_dc_offset_dcq_offset                                (0xff)                          

#define reg_dc_cal_trig                                            (*(volatile uint32_t *)0x400099c8)
#define adr_dc_cal_trig                                                                  (0x400099c8)
#define mask_dc_cal_trig_cal_bgn                                     (0x2)                           
#define mask_dc_cal_trig_cal_clr                                     (0x1)                           

#define reg_ctrl_sreg0_data                                        (*(volatile uint32_t *)0x400099cc)
#define adr_ctrl_sreg0_data                                                              (0x400099cc)

#define reg_ctrl_sreg1_data                                        (*(volatile uint32_t *)0x400099d0)
#define adr_ctrl_sreg1_data                                                              (0x400099d0)

#define reg_test_multi_cell_sel                                    (*(volatile uint32_t *)0x400099f8)
#define adr_test_multi_cell_sel                                                          (0x400099f8)

#define reg_rcb_clk_div                                            (*(volatile uint32_t *)0x400099fc)
#define adr_rcb_clk_div                                                                  (0x400099fc)


//---------------------------------------------------
// dp in  domain address definition
//---------------------------------------------------

#define reg_dp_rdon_mux                                            (*(volatile uint32_t *)0x4000a000)
#define adr_dp_rdon_mux                                                                  (0x4000a000)

#define reg_morx_peak_found                                        (*(volatile uint32_t *)0x4000a00c)
#define adr_morx_peak_found                                                              (0x4000a00c)

#define reg_morx_agc_rssi_rd                                       (*(volatile uint32_t *)0x4000a010)
#define adr_morx_agc_rssi_rd                                                             (0x4000a010)
#define mask_morx_agc_rssi_rd_agc_step                               (0xc000)                        
#define mask_morx_agc_rssi_rd_rssi_sum                               (0x3fff)                        

#define reg_morx_agc_wb_rssi_rd                                    (*(volatile uint32_t *)0x4000a014)
#define adr_morx_agc_wb_rssi_rd                                                          (0x4000a014)
#define mask_morx_agc_wb_rssi_rd_wb_agc                              (0x6000)                        
#define mask_morx_agc_wb_rssi_rd_wb_rssi                             (0x1fff)                        

#define reg_morx_agc_dbg                                           (*(volatile uint32_t *)0x4000a018)
#define adr_morx_agc_dbg                                                                 (0x4000a018)

#define reg_morx_fbp_fo                                            (*(volatile uint32_t *)0x4000a020)
#define adr_morx_fbp_fo                                                                  (0x4000a020)

#define reg_morx_db_rssi_rd                                        (*(volatile uint32_t *)0x4000a024)
#define adr_morx_db_rssi_rd                                                              (0x4000a024)

#define reg_morx_agc_state                                         (*(volatile uint32_t *)0x4000a028)
#define adr_morx_agc_state                                                               (0x4000a028)
#define mask_morx_agc_state_agc_hold_rd                              (0x40)                          
#define mask_morx_agc_state_aci_state                                (0x3f)                          

#define reg_morx_rd                                                (*(volatile uint32_t *)0x4000a02c)
#define adr_morx_rd                                                                      (0x4000a02c)

