EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_morx_ld                                                (*(volatile uint32_t *)0x4000a030)
#define adr_morx_ld                                                                      (0x4000a030)

#define reg_rfmux_bb_mode_read_reg                                 (*(volatile uint32_t *)0x4000a03c)
#define adr_rfmux_bb_mode_read_reg                                                       (0x4000a03c)
#define mask_rfmux_bb_mode_read_reg_bb_mode_sel_read                 (0x3)                           

#define reg_fd_btrx_status_reg                                     (*(volatile uint32_t *)0x4000a044)
#define adr_fd_btrx_status_reg                                                           (0x4000a044)
#define mask_fd_btrx_status_reg_btrx_tune_lpf_sync                   (0x7f)                          

#define reg_rf_RF_status                                           (*(volatile uint32_t *)0x4000a058)
#define adr_rf_RF_status                                                                 (0x4000a058)
#define mask_rf_RF_status_DCXOLF_READY                               (0x400)                         
#define mask_rf_RF_status_RC32K_READY                                (0x200)                         
#define mask_rf_RF_status_RC16M_READY                                (0x100)                         
#define mask_rf_RF_status_DCXO_CLK_READY                             (0x80)                          
#define mask_rf_RF_status_DCOC_COMP_I                                (0x40)                          
#define mask_rf_RF_status_DCOC_COMP_Q                                (0x20)                          
#define mask_rf_RF_status_PLL_LOCK                                   (0x10)                          
#define mask_rf_RF_status_PLL_SLOW                                   (0x8)                           
#define mask_rf_RF_status_SYN_VCO_AMP                                (0x4)                           
#define mask_rf_RF_status_SYN_VCO_LOCK                               (0x2)                           
#define mask_rf_RF_status_SYN_VCO_SLOW                               (0x1)                           

#define reg_cali_status                                            (*(volatile uint32_t *)0x4000a05c)
#define adr_cali_status                                                                  (0x4000a05c)

#define reg_rfmux_btrx_to_rf_read_wd4_reg                          (*(volatile uint32_t *)0x4000a070)
#define adr_rfmux_btrx_to_rf_read_wd4_reg                                                (0x4000a070)
#define mask_rfmux_btrx_to_rf_read_wd4_reg_TIA_DCOCQ_read            (0xff00)                        
#define mask_rfmux_btrx_to_rf_read_wd4_reg_TIA_DCOCI_read            (0xff)                          

#define reg_rfmux_btrx_to_if_read_wd4_reg                          (*(volatile uint32_t *)0x4000a074)
#define adr_rfmux_btrx_to_if_read_wd4_reg                                                (0x4000a074)
#define mask_rfmux_btrx_to_if_read_wd4_reg_PGA_DCOCQ_read            (0xff00)                        
#define mask_rfmux_btrx_to_if_read_wd4_reg_PGA_DCOCI_read            (0xff)                          

#define reg_rfmux_btrx_to_rf_read_wd3_reg                          (*(volatile uint32_t *)0x4000a078)
#define adr_rfmux_btrx_to_rf_read_wd3_reg                                                (0x4000a078)
#define mask_rfmux_btrx_to_rf_read_wd3_reg_PGA_GAIN_read             (0x3c00)                        
#define mask_rfmux_btrx_to_rf_read_wd3_reg_RXRF_LNA_C_read           (0x300)                         
#define mask_rfmux_btrx_to_rf_read_wd3_reg_MIXER_IF_G_read           (0xe0)                          
#define mask_rfmux_btrx_to_rf_read_wd3_reg_RXRF_LNA_GAIN_read        (0x1c)                          
#define mask_rfmux_btrx_to_rf_read_wd3_reg_DCOC_SW_VCM_read          (0x2)                           
#define mask_rfmux_btrx_to_rf_read_wd3_reg_PGA_COMPLEX_EN_read       (0x1)                           

#define reg_rfmux_btrx_idx_read_reg                                (*(volatile uint32_t *)0x4000a07c)
#define adr_rfmux_btrx_idx_read_reg                                                      (0x4000a07c)
#define mask_rfmux_btrx_idx_read_reg_RXRF_GM1_C_read                 (0x600)                         
#define mask_rfmux_btrx_idx_read_reg_RXRF_GM2_C_read                 (0x180)                         
#define mask_rfmux_btrx_idx_read_reg_btrx_tia_dcoc_idx_read          (0x70)                          
#define mask_rfmux_btrx_idx_read_reg_btrx_tia_gidx_read              (0xc)                           
#define mask_rfmux_btrx_idx_read_reg_btrx_pga_gdc_idx_read           (0x3)                           

#define reg_modem_intf_reg                                         (*(volatile uint32_t *)0x4000a080)
#define adr_modem_intf_reg                                                               (0x4000a080)
#define mask_modem_intf_reg_btxen                                    (0x2)                           
#define mask_modem_intf_reg_brxen                                    (0x1)                           

#define reg_test_dtm_txpkg_cnt                                     (*(volatile uint32_t *)0x4000a09c)
#define adr_test_dtm_txpkg_cnt                                                           (0x4000a09c)

#define reg_test_test_rssi                                         (*(volatile uint32_t *)0x4000a0a0)
#define adr_test_test_rssi                                                               (0x4000a0a0)

#define reg_test_rxblock_err                                       (*(volatile uint32_t *)0x4000a0a4)
#define adr_test_rxblock_err                                                             (0x4000a0a4)

#define reg_test_rxblock_num                                       (*(volatile uint32_t *)0x4000a0a8)
#define adr_test_rxblock_num                                                             (0x4000a0a8)

#define reg_test_all_ber                                           (*(volatile uint32_t *)0x4000a0ac)
#define adr_test_all_ber                                                                 (0x4000a0ac)

#define reg_test_test_sber                                         (*(volatile uint32_t *)0x4000a0b0)
#define adr_test_test_sber                                                               (0x4000a0b0)
#define mask_test_test_sber_data_gen_fsm                             (0xf000)                        
#define mask_test_test_sber_test_fsm                                 (0xe00)                         
#define mask_test_test_sber_test_fsm_end                             (0x100)                         
#define mask_test_test_sber_single_ber                               (0xff)                          

#define reg_dcoc_iqdat_reg                                         (*(volatile uint32_t *)0x4000a0b4)
#define adr_dcoc_iqdat_reg                                                               (0x4000a0b4)
#define mask_dcoc_iqdat_reg_rfcali_qdat                              (0xff00)                        
#define mask_dcoc_iqdat_reg_rfcali_idat                              (0xff)                          

#define reg_dcoc_rfcali_dcoc_state_reg                             (*(volatile uint32_t *)0x4000a0b8)
#define adr_dcoc_rfcali_dcoc_state_reg                                                   (0x4000a0b8)
#define mask_dcoc_rfcali_dcoc_state_reg_chn_vld_num                  (0x1c00)                        
#define mask_dcoc_rfcali_dcoc_state_reg_dyn_status                   (0x200)                         
#define mask_dcoc_rfcali_dcoc_state_reg_tia_base_vld                 (0x100)                         
#define mask_dcoc_rfcali_dcoc_state_reg_main_fsm                     (0xf0)                          
#define mask_dcoc_rfcali_dcoc_state_reg_search_done                  (0x8)                           
#define mask_dcoc_rfcali_dcoc_state_reg_dyn_done                     (0x4)                           
#define mask_dcoc_rfcali_dcoc_state_reg_k_cal_done                   (0x2)                           
#define mask_dcoc_rfcali_dcoc_state_reg_static_done                  (0x1)                           

#define reg_dcoc_dcoc_chn_state_reg                                (*(volatile uint32_t *)0x4000a0bc)
#define adr_dcoc_dcoc_chn_state_reg                                                      (0x4000a0bc)
#define mask_dcoc_dcoc_chn_state_reg_chn_sel                         (0x7f)                          

#define reg_dcoc_k_stdi                                            (*(volatile uint32_t *)0x4000a0c0)
#define adr_dcoc_k_stdi                                                                  (0x4000a0c0)

#define reg_dcoc_k_stdq                                            (*(volatile uint32_t *)0x4000a0c4)
#define adr_dcoc_k_stdq                                                                  (0x4000a0c4)

#define reg_dcoc_dcoc_dac_reg                                      (*(volatile uint32_t *)0x4000a0c8)
#define adr_dcoc_dcoc_dac_reg                                                            (0x4000a0c8)
#define mask_dcoc_dcoc_dac_reg_dcoc_q_rd                             (0xff00)                        
#define mask_dcoc_dcoc_dac_reg_dcoc_i_rd                             (0xff)                          

#define reg_dig_status                                             (*(volatile uint32_t *)0x4000a0cc)
#define adr_dig_status                                                                   (0x4000a0cc)

#define reg_trxs_vco_lock_ov_flagh                                 (*(volatile uint32_t *)0x4000a0d0)
#define adr_trxs_vco_lock_ov_flagh                                                       (0x4000a0d0)

#define reg_trxs_vco_lock_ov_flagl                                 (*(volatile uint32_t *)0x4000a0d4)
#define adr_trxs_vco_lock_ov_flagl                                                       (0x4000a0d4)

#define reg_vcocali_rdh                                            (*(volatile uint32_t *)0x4000a0d8)
#define adr_vcocali_rdh                                                                  (0x4000a0d8)
#define mask_vcocali_rdh_stah                                        (0xffff)                        

