EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_vcocali_rdl                                            (*(volatile uint32_t *)0x4000a0dc)
#define adr_vcocali_rdl                                                                  (0x4000a0dc)
#define mask_vcocali_rdl_stal                                        (0x7f)                          

#define reg_ioproc_dcoc_dac_reg                                    (*(volatile uint32_t *)0x4000a0e0)
#define adr_ioproc_dcoc_dac_reg                                                          (0x4000a0e0)
#define mask_ioproc_dcoc_dac_reg_rx_en_from_pad                      (0x20)                          
#define mask_ioproc_dcoc_dac_reg_tx_en_from_pad                      (0x10)                          
#define mask_ioproc_dcoc_dac_reg_rate_from_pad                       (0xc)                           
#define mask_ioproc_dcoc_dac_reg_agc_from_pad                        (0x3)                           

#define reg_dc_dc_state                                            (*(volatile uint32_t *)0x4000a10c)
#define adr_dc_dc_state                                                                  (0x4000a10c)
#define mask_dc_dc_state_cal_done                                    (0x2)                           
#define mask_dc_dc_state_cal_fine                                    (0x1)                           

#define reg_dc_dc_sumi                                             (*(volatile uint32_t *)0x4000a110)
#define adr_dc_dc_sumi                                                                   (0x4000a110)
#define mask_dc_dc_sumi_sumi                                         (0xffff)                        

#define reg_dc_dc_sumq                                             (*(volatile uint32_t *)0x4000a114)
#define adr_dc_dc_sumq                                                                   (0x4000a114)
#define mask_dc_dc_sumq_sumq                                         (0xffff)                        


//---------------------------------------------------
// rftbl in  domain address definition
//---------------------------------------------------

#define reg_rftbl_BTRX_IF_GAIN0                                    (*(volatile uint32_t *)0x4000ac00)
#define adr_rftbl_BTRX_IF_GAIN0                                                          (0x4000ac00)
#define mask_rftbl_BTRX_IF_GAIN0_RX_PGA_GAIN                         (0x1e)                          
#define mask_rftbl_BTRX_IF_GAIN0_RX_FD_OFFSET_ID                     (0x1)                           

#define reg_rftbl_BTRX_IF_GAIN1                                    (*(volatile uint32_t *)0x4000ac04)
#define adr_rftbl_BTRX_IF_GAIN1                                                          (0x4000ac04)
#define mask_rftbl_BTRX_IF_GAIN1_RX_PGA_GAIN                         (0x1e)                          
#define mask_rftbl_BTRX_IF_GAIN1_RX_FD_OFFSET_ID                     (0x1)                           

#define reg_rftbl_BTRX_IF_GAIN2                                    (*(volatile uint32_t *)0x4000ac08)
#define adr_rftbl_BTRX_IF_GAIN2                                                          (0x4000ac08)
#define mask_rftbl_BTRX_IF_GAIN2_RX_PGA_GAIN                         (0x1e)                          
#define mask_rftbl_BTRX_IF_GAIN2_RX_FD_OFFSET_ID                     (0x1)                           

#define reg_rftbl_BTRX_RF_GAIN0                                    (*(volatile uint32_t *)0x4000ac40)
#define adr_rftbl_BTRX_RF_GAIN0                                                          (0x4000ac40)
#define mask_rftbl_BTRX_RF_GAIN0_GM2_C                               (0xc00)                         
#define mask_rftbl_BTRX_RF_GAIN0_GM1_C                               (0x300)                         
#define mask_rftbl_BTRX_RF_GAIN0_LNA_C                               (0xc0)                          
#define mask_rftbl_BTRX_RF_GAIN0_MIXER_IF_G                          (0x38)                          
#define mask_rftbl_BTRX_RF_GAIN0_LNA_GFAIN                           (0x7)                           

#define reg_rftbl_BTRX_RF_GAIN1                                    (*(volatile uint32_t *)0x4000ac44)
#define adr_rftbl_BTRX_RF_GAIN1                                                          (0x4000ac44)
#define mask_rftbl_BTRX_RF_GAIN1_GM2_C                               (0xc00)                         
#define mask_rftbl_BTRX_RF_GAIN1_GM1_C                               (0x300)                         
#define mask_rftbl_BTRX_RF_GAIN1_LNA_C                               (0xc0)                          
#define mask_rftbl_BTRX_RF_GAIN1_MIXER_IF_G                          (0x38)                          
#define mask_rftbl_BTRX_RF_GAIN1_LNA_GFAIN                           (0x7)                           

#define reg_rftbl_BTRX_RF_GAIN2                                    (*(volatile uint32_t *)0x4000ac48)
#define adr_rftbl_BTRX_RF_GAIN2                                                          (0x4000ac48)
#define mask_rftbl_BTRX_RF_GAIN2_GM2_C                               (0xc00)                         
#define mask_rftbl_BTRX_RF_GAIN2_GM1_C                               (0x300)                         
#define mask_rftbl_BTRX_RF_GAIN2_LNA_C                               (0xc0)                          
#define mask_rftbl_BTRX_RF_GAIN2_MIXER_IF_G                          (0x38)                          
#define mask_rftbl_BTRX_RF_GAIN2_LNA_GFAIN                           (0x7)                           

#define reg_rftbl_PGA_DCOC0                                        (*(volatile uint32_t *)0x4000ac80)
#define adr_rftbl_PGA_DCOC0                                                              (0x4000ac80)
#define mask_rftbl_PGA_DCOC0_PGA_DCOC_Q                              (0xff00)                        
#define mask_rftbl_PGA_DCOC0_PGA_DCOC_I                              (0xff)                          

#define reg_rftbl_PGA_DCOC1                                        (*(volatile uint32_t *)0x4000ac84)
#define adr_rftbl_PGA_DCOC1                                                              (0x4000ac84)
#define mask_rftbl_PGA_DCOC1_PGA_DCOC_Q                              (0xff00)                        
#define mask_rftbl_PGA_DCOC1_PGA_DCOC_I                              (0xff)                          

#define reg_rftbl_PGA_DCOC2                                        (*(volatile uint32_t *)0x4000ac88)
#define adr_rftbl_PGA_DCOC2                                                              (0x4000ac88)
#define mask_rftbl_PGA_DCOC2_PGA_DCOC_Q                              (0xff00)                        
#define mask_rftbl_PGA_DCOC2_PGA_DCOC_I                              (0xff)                          

#define reg_rftbl_TIA_DCOC0                                        (*(volatile uint32_t *)0x4000acc0)
#define adr_rftbl_TIA_DCOC0                                                              (0x4000acc0)
#define mask_rftbl_TIA_DCOC0_TIA_DCOC_Q                              (0xff00)                        
#define mask_rftbl_TIA_DCOC0_TIA_DCOC_I                              (0xff)                          

