EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_rftbl_TIA_DCOC1                                        (*(volatile uint32_t *)0x4000acc4)
#define adr_rftbl_TIA_DCOC1                                                              (0x4000acc4)
#define mask_rftbl_TIA_DCOC1_TIA_DCOC_Q                              (0xff00)                        
#define mask_rftbl_TIA_DCOC1_TIA_DCOC_I                              (0xff)                          

#define reg_rftbl_TIA_DCOC20                                       (*(volatile uint32_t *)0x4000acc8)
#define adr_rftbl_TIA_DCOC20                                                             (0x4000acc8)
#define mask_rftbl_TIA_DCOC20_TIA_DCOC_Q                             (0xff00)                        
#define mask_rftbl_TIA_DCOC20_TIA_DCOC_I                             (0xff)                          

#define reg_rftbl_TIA_DCOC21                                       (*(volatile uint32_t *)0x4000accc)
#define adr_rftbl_TIA_DCOC21                                                             (0x4000accc)
#define mask_rftbl_TIA_DCOC21_TIA_DCOC_Q                             (0xff00)                        
#define mask_rftbl_TIA_DCOC21_TIA_DCOC_I                             (0xff)                          

#define reg_rftbl_TIA_DCOC22                                       (*(volatile uint32_t *)0x4000acd0)
#define adr_rftbl_TIA_DCOC22                                                             (0x4000acd0)
#define mask_rftbl_TIA_DCOC22_TIA_DCOC_Q                             (0xff00)                        
#define mask_rftbl_TIA_DCOC22_TIA_DCOC_I                             (0xff)                          

#define reg_rftbl_TIA_DCOC23                                       (*(volatile uint32_t *)0x4000acd4)
#define adr_rftbl_TIA_DCOC23                                                             (0x4000acd4)
#define mask_rftbl_TIA_DCOC23_TIA_DCOC_Q                             (0xff00)                        
#define mask_rftbl_TIA_DCOC23_TIA_DCOC_I                             (0xff)                          

#define reg_rftbl_TIA_DCOC24                                       (*(volatile uint32_t *)0x4000acd8)
#define adr_rftbl_TIA_DCOC24                                                             (0x4000acd8)
#define mask_rftbl_TIA_DCOC24_TIA_DCOC_Q                             (0xff00)                        
#define mask_rftbl_TIA_DCOC24_TIA_DCOC_I                             (0xff)                          

#define reg_rftbl_TIA_DCOC25                                       (*(volatile uint32_t *)0x4000acdc)
#define adr_rftbl_TIA_DCOC25                                                             (0x4000acdc)
#define mask_rftbl_TIA_DCOC25_TIA_DCOC_Q                             (0xff00)                        
#define mask_rftbl_TIA_DCOC25_TIA_DCOC_I                             (0xff)                          

#define reg_rftbl_TIA_DCOC2_CH0                                    (*(volatile uint32_t *)0x4000ad00)
#define adr_rftbl_TIA_DCOC2_CH0                                                          (0x4000ad00)
#define mask_rftbl_TIA_DCOC2_CH0_CH0_VLD                             (0x80)                          
#define mask_rftbl_TIA_DCOC2_CH0_CH0_NUM                             (0x7f)                          

#define reg_rftbl_TIA_DCOC2_CH1                                    (*(volatile uint32_t *)0x4000ad04)
#define adr_rftbl_TIA_DCOC2_CH1                                                          (0x4000ad04)
#define mask_rftbl_TIA_DCOC2_CH1_CH0_VLD                             (0x80)                          
#define mask_rftbl_TIA_DCOC2_CH1_CH0_NUM                             (0x7f)                          

#define reg_rftbl_TIA_DCOC2_CH2                                    (*(volatile uint32_t *)0x4000ad08)
#define adr_rftbl_TIA_DCOC2_CH2                                                          (0x4000ad08)
#define mask_rftbl_TIA_DCOC2_CH2_CH0_VLD                             (0x80)                          
#define mask_rftbl_TIA_DCOC2_CH2_CH0_NUM                             (0x7f)                          

#define reg_rftbl_TIA_DCOC2_CH3                                    (*(volatile uint32_t *)0x4000ad0c)
#define adr_rftbl_TIA_DCOC2_CH3                                                          (0x4000ad0c)
#define mask_rftbl_TIA_DCOC2_CH3_CH0_VLD                             (0x80)                          
#define mask_rftbl_TIA_DCOC2_CH3_CH0_NUM                             (0x7f)                          

#define reg_rftbl_TIA_DCOC2_CH4                                    (*(volatile uint32_t *)0x4000ad10)
#define adr_rftbl_TIA_DCOC2_CH4                                                          (0x4000ad10)
#define mask_rftbl_TIA_DCOC2_CH4_CH0_VLD                             (0x80)                          
#define mask_rftbl_TIA_DCOC2_CH4_CH0_NUM                             (0x7f)                          

#define reg_rftbl_TIA_DCOC2_CH5                                    (*(volatile uint32_t *)0x4000ad14)
#define adr_rftbl_TIA_DCOC2_CH5                                                          (0x4000ad14)
#define mask_rftbl_TIA_DCOC2_CH5_CH0_VLD                             (0x80)                          
#define mask_rftbl_TIA_DCOC2_CH5_CH0_NUM                             (0x7f)                          

#define reg_rftbl_ADC_BIT_SCALE                                    (*(volatile uint32_t *)0x4000ad40)
#define adr_rftbl_ADC_BIT_SCALE                                                          (0x4000ad40)
#define mask_rftbl_ADC_BIT_SCALE_Q_K_INT                             (0xff00)                        
#define mask_rftbl_ADC_BIT_SCALE_I_K_INT                             (0xff)                          

#define reg_rftbl_TX_GAIN0                                         (*(volatile uint32_t *)0x4000ad80)
#define adr_rftbl_TX_GAIN0                                                               (0x4000ad80)

#define reg_rftbl_TX_GAIN1                                         (*(volatile uint32_t *)0x4000ad84)
#define adr_rftbl_TX_GAIN1                                                               (0x4000ad84)

#define reg_rftbl_TX_GAIN2                                         (*(volatile uint32_t *)0x4000ad88)
#define adr_rftbl_TX_GAIN2                                                               (0x4000ad88)

