EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_rftbl_TX_GAIN3                                         (*(volatile uint32_t *)0x4000ad8c)
#define adr_rftbl_TX_GAIN3                                                               (0x4000ad8c)

#define reg_rftbl_TX_GAIN4                                         (*(volatile uint32_t *)0x4000ad90)
#define adr_rftbl_TX_GAIN4                                                               (0x4000ad90)

#define reg_rftbl_TX_GAIN5                                         (*(volatile uint32_t *)0x4000ad94)
#define adr_rftbl_TX_GAIN5                                                               (0x4000ad94)


//---------------------------------------------------
// cpto0_secb in  domain address definition
//---------------------------------------------------

#define reg_cpto0_secb_llc_mode                                    (*(volatile uint32_t *)0x4000b000)
#define adr_cpto0_secb_llc_mode                                                          (0x4000b000)

#define reg_cpto0_secb_llc_key_sram_raddr                          (*(volatile uint32_t *)0x4000b004)
#define adr_cpto0_secb_llc_key_sram_raddr                                                (0x4000b004)

#define reg_cpto0_secb_llc_dat_sram_waddr                          (*(volatile uint32_t *)0x4000b008)
#define adr_cpto0_secb_llc_dat_sram_waddr                                                (0x4000b008)

#define reg_cpto0_secb_llc_dat_sram_raddr                          (*(volatile uint32_t *)0x4000b00c)
#define adr_cpto0_secb_llc_dat_sram_raddr                                                (0x4000b00c)

#define reg_cpto0_secb_llc_ctr_sram_waddr                          (*(volatile uint32_t *)0x4000b010)
#define adr_cpto0_secb_llc_ctr_sram_waddr                                                (0x4000b010)

#define reg_cpto0_secb_llc_adv_sram_waddr                          (*(volatile uint32_t *)0x4000b014)
#define adr_cpto0_secb_llc_adv_sram_waddr                                                (0x4000b014)

#define reg_cpto0_secb_llc_iv0                                     (*(volatile uint32_t *)0x4000b018)
#define adr_cpto0_secb_llc_iv0                                                           (0x4000b018)

#define reg_cpto0_secb_llc_iv1                                     (*(volatile uint32_t *)0x4000b01c)
#define adr_cpto0_secb_llc_iv1                                                           (0x4000b01c)

#define reg_cpto0_secb_llc_maxlen                                  (*(volatile uint32_t *)0x4000b020)
#define adr_cpto0_secb_llc_maxlen                                                        (0x4000b020)
#define mask_cpto0_secb_llc_maxlen_llc_byp_rx_len                    (0xff0000)                      
#define mask_cpto0_secb_llc_maxlen_llc_ctr_len                       (0xff00)                        
#define mask_cpto0_secb_llc_maxlen_llc_dat_len                       (0xff)                          

#define reg_cpto0_secb_llc_enc_pkt_cnt_hi                          (*(volatile uint32_t *)0x4000b024)
#define adr_cpto0_secb_llc_enc_pkt_cnt_hi                                                (0x4000b024)

#define reg_cpto0_secb_llc_enc_pkt_cnt_lo                          (*(volatile uint32_t *)0x4000b028)
#define adr_cpto0_secb_llc_enc_pkt_cnt_lo                                                (0x4000b028)

#define reg_cpto0_secb_llc_dec_pkt_cnt_hi                          (*(volatile uint32_t *)0x4000b02c)
#define adr_cpto0_secb_llc_dec_pkt_cnt_hi                                                (0x4000b02c)

#define reg_cpto0_secb_llc_dec_pkt_cnt_lo                          (*(volatile uint32_t *)0x4000b030)
#define adr_cpto0_secb_llc_dec_pkt_cnt_lo                                                (0x4000b030)

#define reg_cpto0_secb_llc_byp_rxhead_num                          (*(volatile uint32_t *)0x4000b034)
#define adr_cpto0_secb_llc_byp_rxhead_num                                                (0x4000b034)

#define reg_cpto0_secb_llc_mic_cal                                 (*(volatile uint32_t *)0x4000b038)
#define adr_cpto0_secb_llc_mic_cal                                                       (0x4000b038)

#define reg_cpto0_secb_llc_mic_cal_1                               (*(volatile uint32_t *)0x4000b03c)
#define adr_cpto0_secb_llc_mic_cal_1                                                     (0x4000b03c)

#define reg_cpto0_secb_sram_wen                                    (*(volatile uint32_t *)0x4000b040)
#define adr_cpto0_secb_sram_wen                                                          (0x4000b040)
#define mask_cpto0_secb_sram_wen_ctrl_pkt_wen                        (0x4)                           
#define mask_cpto0_secb_sram_wen_data_pkt_wen                        (0x2)                           
#define mask_cpto0_secb_sram_wen_adv_pkt_wen                         (0x1)                           

#define reg_cpto0_secb_sw_mode                                     (*(volatile uint32_t *)0x4000b080)
#define adr_cpto0_secb_sw_mode                                                           (0x4000b080)
#define mask_cpto0_secb_sw_mode_sw_data_word_pol                     (0x200)                         
#define mask_cpto0_secb_sw_mode_sw_data_byte_pol                     (0x100)                         
#define mask_cpto0_secb_sw_mode_sw_key_size                          (0xc0)                          
#define mask_cpto0_secb_sw_mode_sw_aes_mode                          (0x30)                          
#define mask_cpto0_secb_sw_mode_sw_ende_mode                         (0x8)                           
#define mask_cpto0_secb_sw_mode_sw_sel_mode                          (0x7)                           

#define reg_cpto0_secb_sw_len                                      (*(volatile uint32_t *)0x4000b084)
#define adr_cpto0_secb_sw_len                                                            (0x4000b084)

#define reg_cpto0_secb_sw_key_sram_raddr                           (*(volatile uint32_t *)0x4000b088)
#define adr_cpto0_secb_sw_key_sram_raddr                                                 (0x4000b088)

