EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_cpto0_secb_sw_dat_sram_waddr                           (*(volatile uint32_t *)0x4000b08c)
#define adr_cpto0_secb_sw_dat_sram_waddr                                                 (0x4000b08c)

#define reg_cpto0_secb_sw_dat_sram_raddr                           (*(volatile uint32_t *)0x4000b090)
#define adr_cpto0_secb_sw_dat_sram_raddr                                                 (0x4000b090)

#define reg_cpto0_secb_sw_keyexp_sram_waddr                        (*(volatile uint32_t *)0x4000b094)
#define adr_cpto0_secb_sw_keyexp_sram_waddr                                              (0x4000b094)

#define reg_cpto0_secb_sw_ccm_cfg                                  (*(volatile uint32_t *)0x4000b098)
#define adr_cpto0_secb_sw_ccm_cfg                                                        (0x4000b098)
#define mask_cpto0_secb_sw_ccm_cfg_sw_directionbit                   (0x10)                          
#define mask_cpto0_secb_sw_ccm_cfg_sw_ccm_llid                       (0xc)                           
#define mask_cpto0_secb_sw_ccm_cfg_sw_ccm_pkt_type                   (0x3)                           

#define reg_cpto0_secb_sw_iv0                                      (*(volatile uint32_t *)0x4000b09c)
#define adr_cpto0_secb_sw_iv0                                                            (0x4000b09c)

#define reg_cpto0_secb_sw_iv1                                      (*(volatile uint32_t *)0x4000b0a0)
#define adr_cpto0_secb_sw_iv1                                                            (0x4000b0a0)

#define reg_cpto0_secb_sw_iv2                                      (*(volatile uint32_t *)0x4000b0a4)
#define adr_cpto0_secb_sw_iv2                                                            (0x4000b0a4)

#define reg_cpto0_secb_sw_iv3                                      (*(volatile uint32_t *)0x4000b0a8)
#define adr_cpto0_secb_sw_iv3                                                            (0x4000b0a8)

#define reg_cpto0_secb_sw_enc_pkt_cnt_hi                           (*(volatile uint32_t *)0x4000b0ac)
#define adr_cpto0_secb_sw_enc_pkt_cnt_hi                                                 (0x4000b0ac)

#define reg_cpto0_secb_sw_enc_pkt_cnt_lo                           (*(volatile uint32_t *)0x4000b0b0)
#define adr_cpto0_secb_sw_enc_pkt_cnt_lo                                                 (0x4000b0b0)

#define reg_cpto0_secb_sw_dec_pkt_cnt_hi                           (*(volatile uint32_t *)0x4000b0b4)
#define adr_cpto0_secb_sw_dec_pkt_cnt_hi                                                 (0x4000b0b4)

#define reg_cpto0_secb_sw_dec_pkt_cnt_lo                           (*(volatile uint32_t *)0x4000b0b8)
#define adr_cpto0_secb_sw_dec_pkt_cnt_lo                                                 (0x4000b0b8)

#define reg_cpto0_secb_sw_bgn_trig                                 (*(volatile uint32_t *)0x4000b0bc)
#define adr_cpto0_secb_sw_bgn_trig                                                       (0x4000b0bc)

#define reg_cpto0_secb_cpto_status                                 (*(volatile uint32_t *)0x4000b0c0)
#define adr_cpto0_secb_cpto_status                                                       (0x4000b0c0)
#define mask_cpto0_secb_cpto_status_tx_flag                          (0x4000)                        
#define mask_cpto0_secb_cpto_status_rx_flag                          (0x2000)                        
#define mask_cpto0_secb_cpto_status_aes_core_state                   (0x1f00)                        
#define mask_cpto0_secb_cpto_status_cpto_sub_state                   (0xf0)                          
#define mask_cpto0_secb_cpto_status_cpto_main_state                  (0xf)                           

#define reg_cpto0_secb_cpto_int_en                                 (*(volatile uint32_t *)0x4000b100)
#define adr_cpto0_secb_cpto_int_en                                                       (0x4000b100)
#define mask_cpto0_secb_cpto_int_en_sw_collide_en                    (0x100)                         
#define mask_cpto0_secb_cpto_int_en_sw_done_en                       (0x80)                          
#define mask_cpto0_secb_cpto_int_en_sw_aes_done_en                   (0x40)                          
#define mask_cpto0_secb_cpto_int_en_llc_byp_rxend_en                 (0x20)                          
#define mask_cpto0_secb_cpto_int_en_llc_byp_rxhead_en                (0x10)                          
#define mask_cpto0_secb_cpto_int_en_llc_len_lim_en                   (0x8)                           
#define mask_cpto0_secb_cpto_int_en_llc_emp_pac_en                   (0x4)                           
#define mask_cpto0_secb_cpto_int_en_llc_mic_fail_en                  (0x2)                           
#define mask_cpto0_secb_cpto_int_en_llc_work_done_en                 (0x1)                           

#define reg_cpto0_secb_cpto_int_clr                                (*(volatile uint32_t *)0x4000b104)
#define adr_cpto0_secb_cpto_int_clr                                                      (0x4000b104)
#define mask_cpto0_secb_cpto_int_clr_sw_collide_clr                  (0x100)                         
#define mask_cpto0_secb_cpto_int_clr_sw_done_clr                     (0x80)                          
#define mask_cpto0_secb_cpto_int_clr_sw_aes_done_clr                 (0x40)                          
#define mask_cpto0_secb_cpto_int_clr_llc_byp_rxend_clr               (0x20)                          
#define mask_cpto0_secb_cpto_int_clr_llc_byp_rxhead_clr              (0x10)                          
#define mask_cpto0_secb_cpto_int_clr_llc_len_lim_clr                 (0x8)                           
#define mask_cpto0_secb_cpto_int_clr_llc_emp_pac_clr                 (0x4)                           
#define mask_cpto0_secb_cpto_int_clr_llc_mic_fail_clr                (0x2)                           
#define mask_cpto0_secb_cpto_int_clr_llc_work_done_clr               (0x1)                           

#define reg_cpto0_secb_cpto_int_st                                 (*(volatile uint32_t *)0x4000b108)
#define adr_cpto0_secb_cpto_int_st                                                       (0x4000b108)
#define mask_cpto0_secb_cpto_int_st_sw_collide_st                    (0x100)                         
#define mask_cpto0_secb_cpto_int_st_sw_done_st                       (0x80)                          
#define mask_cpto0_secb_cpto_int_st_sw_aes_done_st                   (0x40)                          
#define mask_cpto0_secb_cpto_int_st_llc_byp_rxend_st                 (0x20)                          
#define mask_cpto0_secb_cpto_int_st_llc_byp_rxhead_st                (0x10)                          
#define mask_cpto0_secb_cpto_int_st_llc_len_lim_st                   (0x8)                           
#define mask_cpto0_secb_cpto_int_st_llc_emp_pac_st                   (0x4)                           
#define mask_cpto0_secb_cpto_int_st_llc_mic_fail_st                  (0x2)                           
#define mask_cpto0_secb_cpto_int_st_llc_work_done_st                 (0x1)                           

