EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_cpto0_secb_ext_cg_en                                   (*(volatile uint32_t *)0x4000b10c)
#define adr_cpto0_secb_ext_cg_en                                                         (0x4000b10c)


//---------------------------------------------------
// cpto1_secb in  domain address definition
//---------------------------------------------------

#define reg_cpto1_secb_llc_mode                                    (*(volatile uint32_t *)0x4000c000)
#define adr_cpto1_secb_llc_mode                                                          (0x4000c000)

#define reg_cpto1_secb_llc_key_sram_raddr                          (*(volatile uint32_t *)0x4000c004)
#define adr_cpto1_secb_llc_key_sram_raddr                                                (0x4000c004)

#define reg_cpto1_secb_llc_dat_sram_waddr                          (*(volatile uint32_t *)0x4000c008)
#define adr_cpto1_secb_llc_dat_sram_waddr                                                (0x4000c008)

#define reg_cpto1_secb_llc_dat_sram_raddr                          (*(volatile uint32_t *)0x4000c00c)
#define adr_cpto1_secb_llc_dat_sram_raddr                                                (0x4000c00c)

#define reg_cpto1_secb_llc_ctr_sram_waddr                          (*(volatile uint32_t *)0x4000c010)
#define adr_cpto1_secb_llc_ctr_sram_waddr                                                (0x4000c010)

#define reg_cpto1_secb_llc_adv_sram_waddr                          (*(volatile uint32_t *)0x4000c014)
#define adr_cpto1_secb_llc_adv_sram_waddr                                                (0x4000c014)

#define reg_cpto1_secb_llc_iv0                                     (*(volatile uint32_t *)0x4000c018)
#define adr_cpto1_secb_llc_iv0                                                           (0x4000c018)

#define reg_cpto1_secb_llc_iv1                                     (*(volatile uint32_t *)0x4000c01c)
#define adr_cpto1_secb_llc_iv1                                                           (0x4000c01c)

#define reg_cpto1_secb_llc_maxlen                                  (*(volatile uint32_t *)0x4000c020)
#define adr_cpto1_secb_llc_maxlen                                                        (0x4000c020)
#define mask_cpto1_secb_llc_maxlen_llc_byp_rx_len                    (0xff0000)                      
#define mask_cpto1_secb_llc_maxlen_llc_ctr_len                       (0xff00)                        
#define mask_cpto1_secb_llc_maxlen_llc_dat_len                       (0xff)                          

#define reg_cpto1_secb_llc_enc_pkt_cnt_hi                          (*(volatile uint32_t *)0x4000c024)
#define adr_cpto1_secb_llc_enc_pkt_cnt_hi                                                (0x4000c024)

#define reg_cpto1_secb_llc_enc_pkt_cnt_lo                          (*(volatile uint32_t *)0x4000c028)
#define adr_cpto1_secb_llc_enc_pkt_cnt_lo                                                (0x4000c028)

#define reg_cpto1_secb_llc_dec_pkt_cnt_hi                          (*(volatile uint32_t *)0x4000c02c)
#define adr_cpto1_secb_llc_dec_pkt_cnt_hi                                                (0x4000c02c)

#define reg_cpto1_secb_llc_dec_pkt_cnt_lo                          (*(volatile uint32_t *)0x4000c030)
#define adr_cpto1_secb_llc_dec_pkt_cnt_lo                                                (0x4000c030)

#define reg_cpto1_secb_llc_byp_rxhead_num                          (*(volatile uint32_t *)0x4000c034)
#define adr_cpto1_secb_llc_byp_rxhead_num                                                (0x4000c034)

#define reg_cpto1_secb_llc_mic_cal                                 (*(volatile uint32_t *)0x4000c038)
#define adr_cpto1_secb_llc_mic_cal                                                       (0x4000c038)

#define reg_cpto1_secb_llc_mic_cal_1                               (*(volatile uint32_t *)0x4000c03c)
#define adr_cpto1_secb_llc_mic_cal_1                                                     (0x4000c03c)

#define reg_cpto1_secb_sram_wen                                    (*(volatile uint32_t *)0x4000c040)
#define adr_cpto1_secb_sram_wen                                                          (0x4000c040)
#define mask_cpto1_secb_sram_wen_ctrl_pkt_wen                        (0x4)                           
#define mask_cpto1_secb_sram_wen_data_pkt_wen                        (0x2)                           
#define mask_cpto1_secb_sram_wen_adv_pkt_wen                         (0x1)                           

#define reg_cpto1_secb_sw_mode                                     (*(volatile uint32_t *)0x4000c080)
#define adr_cpto1_secb_sw_mode                                                           (0x4000c080)
#define mask_cpto1_secb_sw_mode_sw_data_word_pol                     (0x200)                         
#define mask_cpto1_secb_sw_mode_sw_data_byte_pol                     (0x100)                         
#define mask_cpto1_secb_sw_mode_sw_key_size                          (0xc0)                          
#define mask_cpto1_secb_sw_mode_sw_aes_mode                          (0x30)                          
#define mask_cpto1_secb_sw_mode_sw_ende_mode                         (0x8)                           
#define mask_cpto1_secb_sw_mode_sw_sel_mode                          (0x7)                           

#define reg_cpto1_secb_sw_len                                      (*(volatile uint32_t *)0x4000c084)
#define adr_cpto1_secb_sw_len                                                            (0x4000c084)

#define reg_cpto1_secb_sw_key_sram_raddr                           (*(volatile uint32_t *)0x4000c088)
#define adr_cpto1_secb_sw_key_sram_raddr                                                 (0x4000c088)

#define reg_cpto1_secb_sw_dat_sram_waddr                           (*(volatile uint32_t *)0x4000c08c)
#define adr_cpto1_secb_sw_dat_sram_waddr                                                 (0x4000c08c)

#define reg_cpto1_secb_sw_dat_sram_raddr                           (*(volatile uint32_t *)0x4000c090)
#define adr_cpto1_secb_sw_dat_sram_raddr                                                 (0x4000c090)

