EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_qspi0_seca_sreg_qspi_spdr_rd                           (*(volatile uint32_t *)0x50000000)
#define adr_qspi0_seca_sreg_qspi_spdr_rd                                                 (0x50000000)

#define reg_qspi0_seca_sreg_qspi_spdr_wr                           (*(volatile uint32_t *)0x50000004)
#define adr_qspi0_seca_sreg_qspi_spdr_wr                                                 (0x50000004)

#define reg_qspi0_seca_int_status                                  (*(volatile uint32_t *)0x50000008)
#define adr_qspi0_seca_int_status                                                        (0x50000008)

#define reg_qspi0_seca_int_mask                                    (*(volatile uint32_t *)0x5000000c)
#define adr_qspi0_seca_int_mask                                                          (0x5000000c)

#define reg_qspi0_seca_int_clear                                   (*(volatile uint32_t *)0x50000010)
#define adr_qspi0_seca_int_clear                                                         (0x50000010)

#define reg_qspi0_seca_txfifo_threshold                            (*(volatile uint32_t *)0x50000014)
#define adr_qspi0_seca_txfifo_threshold                                                  (0x50000014)

#define reg_qspi0_seca_rxfifo_threshold                            (*(volatile uint32_t *)0x50000018)
#define adr_qspi0_seca_rxfifo_threshold                                                  (0x50000018)

#define reg_qspi0_seca_core_clock_en                               (*(volatile uint32_t *)0x5000001c)
#define adr_qspi0_seca_core_clock_en                                                     (0x5000001c)

#define reg_qspi0_seca_ext_cg_en                                   (*(volatile uint32_t *)0x50000020)
#define adr_qspi0_seca_ext_cg_en                                                         (0x50000020)

#define reg_qspi0_seca_scramble_ctrl                               (*(volatile uint32_t *)0x50000024)
#define adr_qspi0_seca_scramble_ctrl                                                     (0x50000024)
#define mask_qspi0_seca_scramble_ctrl_directif_scramble_en           (0x2)                           
#define mask_qspi0_seca_scramble_ctrl_indirectif_scramble_en         (0x1)                           

#define reg_qspi0_seca_scramble_key                                (*(volatile uint32_t *)0x50000028)
#define adr_qspi0_seca_scramble_key                                                      (0x50000028)

#define reg_qspi0_seca_spcr                                        (*(volatile uint32_t *)0x5000002c)
#define adr_qspi0_seca_spcr                                                              (0x5000002c)
#define mask_qspi0_seca_spcr_sample_edge                             (0x20)                          
#define mask_qspi0_seca_spcr_data_comb_mode                          (0x18)                          
#define mask_qspi0_seca_spcr_sda_mode                                (0x4)                           
#define mask_qspi0_seca_spcr_cpha                                    (0x2)                           
#define mask_qspi0_seca_spcr_cpol                                    (0x1)                           

#define reg_qspi0_seca_dly_cfg                                     (*(volatile uint32_t *)0x50000030)
#define adr_qspi0_seca_dly_cfg                                                           (0x50000030)
#define mask_qspi0_seca_dly_cfg_input_clk_dly                        (0x38)                          
#define mask_qspi0_seca_dly_cfg_output_clk_dly                       (0x7)                           

#define reg_qspi0_seca_opi_ctrl                                    (*(volatile uint32_t *)0x50000034)
#define adr_qspi0_seca_opi_ctrl                                                          (0x50000034)
#define mask_qspi0_seca_opi_ctrl_opi_en                              (0x100)                         
#define mask_qspi0_seca_opi_ctrl_dtr_read_cpha                       (0x80)                          
#define mask_qspi0_seca_opi_ctrl_write_dtr_en                        (0x40)                          
#define mask_qspi0_seca_opi_ctrl_read_dtr_en                         (0x20)                          
#define mask_qspi0_seca_opi_ctrl_datamask_en                         (0x10)                          
#define mask_qspi0_seca_opi_ctrl_byte_mask_config                    (0xf)                           

#define reg_qspi0_seca_send_ctrl                                   (*(volatile uint32_t *)0x50000040)
#define adr_qspi0_seca_send_ctrl                                                         (0x50000040)
#define mask_qspi0_seca_send_ctrl_adr_byte_mode                      (0x800)                         
#define mask_qspi0_seca_send_ctrl_cmd_with_arg                       (0x700)                         
#define mask_qspi0_seca_send_ctrl_adr_with_arg                       (0xc0)                          
#define mask_qspi0_seca_send_ctrl_cmd_bit_num                        (0x30)                          
#define mask_qspi0_seca_send_ctrl_addr_bit_num                       (0xc)                           
#define mask_qspi0_seca_send_ctrl_data_bit_num                       (0x3)                           

#define reg_qspi0_seca_reg_qspi_rxtx_dat_len                       (*(volatile uint32_t *)0x50000044)
#define adr_qspi0_seca_reg_qspi_rxtx_dat_len                                             (0x50000044)

#define reg_qspi0_seca_reg_qspi_cmd_reg                            (*(volatile uint32_t *)0x50000048)
#define adr_qspi0_seca_reg_qspi_cmd_reg                                                  (0x50000048)

#define reg_qspi0_seca_reg_qspi_addr_reg                           (*(volatile uint32_t *)0x5000004c)
#define adr_qspi0_seca_reg_qspi_addr_reg                                                 (0x5000004c)

#define reg_qspi0_seca_mcu_adrcnd_bit_len                          (*(volatile uint32_t *)0x50000050)
#define adr_qspi0_seca_mcu_adrcnd_bit_len                                                (0x50000050)
#define mask_qspi0_seca_mcu_adrcnd_bit_len_mcu_rd_dummy              (0xf000)                        
#define mask_qspi0_seca_mcu_adrcnd_bit_len_mcu_cmd_max_len           (0xfc0)                         
#define mask_qspi0_seca_mcu_adrcnd_bit_len_mcu_adr_max_len           (0x3f)                          

