EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_qspi0_seca_flash_busy                                  (*(volatile uint32_t *)0x50000054)
#define adr_qspi0_seca_flash_busy                                                        (0x50000054)

#define reg_qspi0_seca_auto_busy_enable                            (*(volatile uint32_t *)0x50000058)
#define adr_qspi0_seca_auto_busy_enable                                                  (0x50000058)

#define reg_qspi0_seca_auto_busy_configa                           (*(volatile uint32_t *)0x5000005c)
#define adr_qspi0_seca_auto_busy_configa                                                 (0x5000005c)
#define mask_qspi0_seca_auto_busy_configa_ini_cnt_value              (0xfffff000)                    
#define mask_qspi0_seca_auto_busy_configa_inval_cnt_value            (0xfff)                         

#define reg_qspi0_seca_auto_busy_configb                           (*(volatile uint32_t *)0x50000060)
#define adr_qspi0_seca_auto_busy_configb                                                 (0x50000060)
#define mask_qspi0_seca_auto_busy_configb_rdsr_cmd_num               (0x300)                         
#define mask_qspi0_seca_auto_busy_configb_rdsr_cmd                   (0xff)                          

#define reg_qspi0_seca_suspend_timing_ctrl                         (*(volatile uint32_t *)0x50000064)
#define adr_qspi0_seca_suspend_timing_ctrl                                               (0x50000064)
#define mask_qspi0_seca_suspend_timing_ctrl_sus_delay_max            (0xff000000)                    
#define mask_qspi0_seca_suspend_timing_ctrl_tps_tes_cfg              (0xff0000)                      
#define mask_qspi0_seca_suspend_timing_ctrl_ters_tprs_cfg            (0xff00)                        
#define mask_qspi0_seca_suspend_timing_ctrl_timeunit_us              (0xff)                          

#define reg_qspi0_seca_suspend_trig                                (*(volatile uint32_t *)0x50000068)
#define adr_qspi0_seca_suspend_trig                                                      (0x50000068)

#define reg_qspi0_seca_send_en                                     (*(volatile uint32_t *)0x5000006c)
#define adr_qspi0_seca_send_en                                                           (0x5000006c)

#define reg_qspi0_seca_flash_busy_auto                             (*(volatile uint32_t *)0x50000070)
#define adr_qspi0_seca_flash_busy_auto                                                   (0x50000070)

#define reg_qspi0_seca_cache_cmd1                                  (*(volatile uint32_t *)0x50000080)
#define adr_qspi0_seca_cache_cmd1                                                        (0x50000080)
#define mask_qspi0_seca_cache_cmd1_hpm_cmd                           (0xff000000)                    
#define mask_qspi0_seca_cache_cmd1_resume_cmd                        (0xff0000)                      
#define mask_qspi0_seca_cache_cmd1_sus_cmd                           (0xff00)                        
#define mask_qspi0_seca_cache_cmd1_read_cmd                          (0xff)                          

#define reg_qspi0_seca_cache_cmd2                                  (*(volatile uint32_t *)0x50000084)
#define adr_qspi0_seca_cache_cmd2                                                        (0x50000084)
#define mask_qspi0_seca_cache_cmd2_write_cmd                         (0xff0000)                      
#define mask_qspi0_seca_cache_cmd2_continu_rd_mod                    (0xff00)                        
#define mask_qspi0_seca_cache_cmd2_exithpm_mod                       (0xff)                          

#define reg_qspi0_seca_cache_delay_set                             (*(volatile uint32_t *)0x50000088)
#define adr_qspi0_seca_cache_delay_set                                                   (0x50000088)
#define mask_qspi0_seca_cache_delay_set_hpm_delay_max                (0x3f)                          

#define reg_qspi0_seca_delay_set                                   (*(volatile uint32_t *)0x5000008c)
#define adr_qspi0_seca_delay_set                                                         (0x5000008c)
#define mask_qspi0_seca_delay_set_cache_rd_dummy                     (0xf0000000)                    
#define mask_qspi0_seca_delay_set_dir_wr_en                          (0x8000000)                     
#define mask_qspi0_seca_delay_set_cache_addr_byte_mode               (0x4000000)                     
#define mask_qspi0_seca_delay_set_cache_cmd_bit_num                  (0x3000000)                     
#define mask_qspi0_seca_delay_set_cache_addr_bit_num                 (0xc00000)                      
#define mask_qspi0_seca_delay_set_cache_data_bit_num                 (0x300000)                      
#define mask_qspi0_seca_delay_set_cache_no_dummy_cmd_len             (0xf0000)                       
#define mask_qspi0_seca_delay_set_cache_cmd_len                      (0xf000)                        
#define mask_qspi0_seca_delay_set_adr_bit_max                        (0xfc0)                         
#define mask_qspi0_seca_delay_set_hpm_len                            (0x3f)                          

#define reg_qspi0_seca_continue_rd_mod_index                       (*(volatile uint32_t *)0x50000090)
#define adr_qspi0_seca_continue_rd_mod_index                                             (0x50000090)

#define reg_qspi0_seca_continue_status                             (*(volatile uint32_t *)0x50000094)
#define adr_qspi0_seca_continue_status                                                   (0x50000094)

#define reg_qspi0_seca_rst_trig                                    (*(volatile uint32_t *)0x50000098)
#define adr_qspi0_seca_rst_trig                                                          (0x50000098)

#define reg_qspi0_seca_rst_status                                  (*(volatile uint32_t *)0x5000009c)
#define adr_qspi0_seca_rst_status                                                        (0x5000009c)

#define reg_qspi0_seca_cache_access_status                         (*(volatile uint32_t *)0x500000a0)
#define adr_qspi0_seca_cache_access_status                                               (0x500000a0)

#define reg_qspi0_seca_cmd_send_status                             (*(volatile uint32_t *)0x500000a4)
#define adr_qspi0_seca_cmd_send_status                                                   (0x500000a4)

