EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_qspi0_seca_manual_mode_cfg                             (*(volatile uint32_t *)0x500000c0)
#define adr_qspi0_seca_manual_mode_cfg                                                   (0x500000c0)
#define mask_qspi0_seca_manual_mode_cfg_maul_tx_data_seq_num         (0x600)                         
#define mask_qspi0_seca_manual_mode_cfg_maul_dcx_value               (0x100)                         
#define mask_qspi0_seca_manual_mode_cfg_maul_data_bit_num            (0xc0)                          
#define mask_qspi0_seca_manual_mode_cfg_cs_hold_ctrl                 (0x20)                          
#define mask_qspi0_seca_manual_mode_cfg_maul_rxtx_data_size          (0x1f)                          

#define reg_qspi0_seca_manual_mode_ctrl                            (*(volatile uint32_t *)0x500000c4)
#define adr_qspi0_seca_manual_mode_ctrl                                                  (0x500000c4)
#define mask_qspi0_seca_manual_mode_ctrl_maul_rd_dum                 (0x40)                          
#define mask_qspi0_seca_manual_mode_ctrl_maul_dcx_opt_mode           (0x20)                          
#define mask_qspi0_seca_manual_mode_ctrl_maul_dcx_mode               (0x18)                          
#define mask_qspi0_seca_manual_mode_ctrl_manual_trx_mode             (0x4)                           
#define mask_qspi0_seca_manual_mode_ctrl_cs_hold_mode                (0x2)                           
#define mask_qspi0_seca_manual_mode_ctrl_manual_mode                 (0x1)                           

#define reg_qspi0_seca_maul_rx_trig                                (*(volatile uint32_t *)0x500000c8)
#define adr_qspi0_seca_maul_rx_trig                                                      (0x500000c8)

#define reg_qspi0_seca_maul_mode_tx_st                             (*(volatile uint32_t *)0x500000cc)
#define adr_qspi0_seca_maul_mode_tx_st                                                   (0x500000cc)

#define reg_qspi0_seca_maul_mode_rx_st                             (*(volatile uint32_t *)0x500000d0)
#define adr_qspi0_seca_maul_mode_rx_st                                                   (0x500000d0)

#define reg_qspi0_seca_bypass_hpm                                  (*(volatile uint32_t *)0x500000d4)
#define adr_qspi0_seca_bypass_hpm                                                        (0x500000d4)

#define reg_qspi0_seca_atom_op_en                                  (*(volatile uint32_t *)0x500000d8)
#define adr_qspi0_seca_atom_op_en                                                        (0x500000d8)

#define reg_qspi0_seca_clr_hpm                                     (*(volatile uint32_t *)0x500000dc)
#define adr_qspi0_seca_clr_hpm                                                           (0x500000dc)


//---------------------------------------------------
// qspi1_seca in  domain address definition
//---------------------------------------------------

#define reg_qspi1_seca_sreg_qspi_spdr_rd                           (*(volatile uint32_t *)0x50001000)
#define adr_qspi1_seca_sreg_qspi_spdr_rd                                                 (0x50001000)

#define reg_qspi1_seca_sreg_qspi_spdr_wr                           (*(volatile uint32_t *)0x50001004)
#define adr_qspi1_seca_sreg_qspi_spdr_wr                                                 (0x50001004)

#define reg_qspi1_seca_int_status                                  (*(volatile uint32_t *)0x50001008)
#define adr_qspi1_seca_int_status                                                        (0x50001008)

#define reg_qspi1_seca_int_mask                                    (*(volatile uint32_t *)0x5000100c)
#define adr_qspi1_seca_int_mask                                                          (0x5000100c)

#define reg_qspi1_seca_int_clear                                   (*(volatile uint32_t *)0x50001010)
#define adr_qspi1_seca_int_clear                                                         (0x50001010)

#define reg_qspi1_seca_txfifo_threshold                            (*(volatile uint32_t *)0x50001014)
#define adr_qspi1_seca_txfifo_threshold                                                  (0x50001014)

#define reg_qspi1_seca_rxfifo_threshold                            (*(volatile uint32_t *)0x50001018)
#define adr_qspi1_seca_rxfifo_threshold                                                  (0x50001018)

#define reg_qspi1_seca_core_clock_en                               (*(volatile uint32_t *)0x5000101c)
#define adr_qspi1_seca_core_clock_en                                                     (0x5000101c)

#define reg_qspi1_seca_ext_cg_en                                   (*(volatile uint32_t *)0x50001020)
#define adr_qspi1_seca_ext_cg_en                                                         (0x50001020)

#define reg_qspi1_seca_scramble_ctrl                               (*(volatile uint32_t *)0x50001024)
#define adr_qspi1_seca_scramble_ctrl                                                     (0x50001024)
#define mask_qspi1_seca_scramble_ctrl_directif_scramble_en           (0x2)                           
#define mask_qspi1_seca_scramble_ctrl_indirectif_scramble_en         (0x1)                           

#define reg_qspi1_seca_scramble_key                                (*(volatile uint32_t *)0x50001028)
#define adr_qspi1_seca_scramble_key                                                      (0x50001028)

#define reg_qspi1_seca_spcr                                        (*(volatile uint32_t *)0x5000102c)
#define adr_qspi1_seca_spcr                                                              (0x5000102c)
#define mask_qspi1_seca_spcr_sample_edge                             (0x20)                          
#define mask_qspi1_seca_spcr_data_comb_mode                          (0x18)                          
#define mask_qspi1_seca_spcr_sda_mode                                (0x4)                           
#define mask_qspi1_seca_spcr_cpha                                    (0x2)                           
#define mask_qspi1_seca_spcr_cpol                                    (0x1)                           

