EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_qspi1_seca_dly_cfg                                     (*(volatile uint32_t *)0x50001030)
#define adr_qspi1_seca_dly_cfg                                                           (0x50001030)
#define mask_qspi1_seca_dly_cfg_input_clk_dly                        (0x38)                          
#define mask_qspi1_seca_dly_cfg_output_clk_dly                       (0x7)                           

#define reg_qspi1_seca_opi_ctrl                                    (*(volatile uint32_t *)0x50001034)
#define adr_qspi1_seca_opi_ctrl                                                          (0x50001034)
#define mask_qspi1_seca_opi_ctrl_opi_en                              (0x100)                         
#define mask_qspi1_seca_opi_ctrl_dtr_read_cpha                       (0x80)                          
#define mask_qspi1_seca_opi_ctrl_write_dtr_en                        (0x40)                          
#define mask_qspi1_seca_opi_ctrl_read_dtr_en                         (0x20)                          
#define mask_qspi1_seca_opi_ctrl_datamask_en                         (0x10)                          
#define mask_qspi1_seca_opi_ctrl_byte_mask_config                    (0xf)                           

#define reg_qspi1_seca_send_ctrl                                   (*(volatile uint32_t *)0x50001040)
#define adr_qspi1_seca_send_ctrl                                                         (0x50001040)
#define mask_qspi1_seca_send_ctrl_adr_byte_mode                      (0x800)                         
#define mask_qspi1_seca_send_ctrl_cmd_with_arg                       (0x700)                         
#define mask_qspi1_seca_send_ctrl_adr_with_arg                       (0xc0)                          
#define mask_qspi1_seca_send_ctrl_cmd_bit_num                        (0x30)                          
#define mask_qspi1_seca_send_ctrl_addr_bit_num                       (0xc)                           
#define mask_qspi1_seca_send_ctrl_data_bit_num                       (0x3)                           

#define reg_qspi1_seca_reg_qspi_rxtx_dat_len                       (*(volatile uint32_t *)0x50001044)
#define adr_qspi1_seca_reg_qspi_rxtx_dat_len                                             (0x50001044)

#define reg_qspi1_seca_reg_qspi_cmd_reg                            (*(volatile uint32_t *)0x50001048)
#define adr_qspi1_seca_reg_qspi_cmd_reg                                                  (0x50001048)

#define reg_qspi1_seca_reg_qspi_addr_reg                           (*(volatile uint32_t *)0x5000104c)
#define adr_qspi1_seca_reg_qspi_addr_reg                                                 (0x5000104c)

#define reg_qspi1_seca_mcu_adrcnd_bit_len                          (*(volatile uint32_t *)0x50001050)
#define adr_qspi1_seca_mcu_adrcnd_bit_len                                                (0x50001050)
#define mask_qspi1_seca_mcu_adrcnd_bit_len_mcu_rd_dummy              (0xf000)                        
#define mask_qspi1_seca_mcu_adrcnd_bit_len_mcu_cmd_max_len           (0xfc0)                         
#define mask_qspi1_seca_mcu_adrcnd_bit_len_mcu_adr_max_len           (0x3f)                          

#define reg_qspi1_seca_flash_busy                                  (*(volatile uint32_t *)0x50001054)
#define adr_qspi1_seca_flash_busy                                                        (0x50001054)

#define reg_qspi1_seca_auto_busy_enable                            (*(volatile uint32_t *)0x50001058)
#define adr_qspi1_seca_auto_busy_enable                                                  (0x50001058)

#define reg_qspi1_seca_auto_busy_configa                           (*(volatile uint32_t *)0x5000105c)
#define adr_qspi1_seca_auto_busy_configa                                                 (0x5000105c)
#define mask_qspi1_seca_auto_busy_configa_ini_cnt_value              (0xfffff000)                    
#define mask_qspi1_seca_auto_busy_configa_inval_cnt_value            (0xfff)                         

#define reg_qspi1_seca_auto_busy_configb                           (*(volatile uint32_t *)0x50001060)
#define adr_qspi1_seca_auto_busy_configb                                                 (0x50001060)
#define mask_qspi1_seca_auto_busy_configb_rdsr_cmd_num               (0x300)                         
#define mask_qspi1_seca_auto_busy_configb_rdsr_cmd                   (0xff)                          

#define reg_qspi1_seca_suspend_timing_ctrl                         (*(volatile uint32_t *)0x50001064)
#define adr_qspi1_seca_suspend_timing_ctrl                                               (0x50001064)
#define mask_qspi1_seca_suspend_timing_ctrl_sus_delay_max            (0xff000000)                    
#define mask_qspi1_seca_suspend_timing_ctrl_tps_tes_cfg              (0xff0000)                      
#define mask_qspi1_seca_suspend_timing_ctrl_ters_tprs_cfg            (0xff00)                        
#define mask_qspi1_seca_suspend_timing_ctrl_timeunit_us              (0xff)                          

#define reg_qspi1_seca_suspend_trig                                (*(volatile uint32_t *)0x50001068)
#define adr_qspi1_seca_suspend_trig                                                      (0x50001068)

#define reg_qspi1_seca_send_en                                     (*(volatile uint32_t *)0x5000106c)
#define adr_qspi1_seca_send_en                                                           (0x5000106c)

#define reg_qspi1_seca_flash_busy_auto                             (*(volatile uint32_t *)0x50001070)
#define adr_qspi1_seca_flash_busy_auto                                                   (0x50001070)

#define reg_qspi1_seca_cache_cmd1                                  (*(volatile uint32_t *)0x50001080)
#define adr_qspi1_seca_cache_cmd1                                                        (0x50001080)
#define mask_qspi1_seca_cache_cmd1_hpm_cmd                           (0xff000000)                    
#define mask_qspi1_seca_cache_cmd1_resume_cmd                        (0xff0000)                      
#define mask_qspi1_seca_cache_cmd1_sus_cmd                           (0xff00)                        
#define mask_qspi1_seca_cache_cmd1_read_cmd                          (0xff)                          

#define reg_qspi1_seca_cache_cmd2                                  (*(volatile uint32_t *)0x50001084)
#define adr_qspi1_seca_cache_cmd2                                                        (0x50001084)
#define mask_qspi1_seca_cache_cmd2_write_cmd                         (0xff0000)                      
#define mask_qspi1_seca_cache_cmd2_continu_rd_mod                    (0xff00)                        
#define mask_qspi1_seca_cache_cmd2_exithpm_mod                       (0xff)                          

#define reg_qspi1_seca_cache_delay_set                             (*(volatile uint32_t *)0x50001088)
#define adr_qspi1_seca_cache_delay_set                                                   (0x50001088)
#define mask_qspi1_seca_cache_delay_set_hpm_delay_max                (0x3f)                          

