EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_qspi1_seca_delay_set                                   (*(volatile uint32_t *)0x5000108c)
#define adr_qspi1_seca_delay_set                                                         (0x5000108c)
#define mask_qspi1_seca_delay_set_cache_rd_dummy                     (0xf0000000)                    
#define mask_qspi1_seca_delay_set_dir_wr_en                          (0x8000000)                     
#define mask_qspi1_seca_delay_set_cache_addr_byte_mode               (0x4000000)                     
#define mask_qspi1_seca_delay_set_cache_cmd_bit_num                  (0x3000000)                     
#define mask_qspi1_seca_delay_set_cache_addr_bit_num                 (0xc00000)                      
#define mask_qspi1_seca_delay_set_cache_data_bit_num                 (0x300000)                      
#define mask_qspi1_seca_delay_set_cache_no_dummy_cmd_len             (0xf0000)                       
#define mask_qspi1_seca_delay_set_cache_cmd_len                      (0xf000)                        
#define mask_qspi1_seca_delay_set_adr_bit_max                        (0xfc0)                         
#define mask_qspi1_seca_delay_set_hpm_len                            (0x3f)                          

#define reg_qspi1_seca_continue_rd_mod_index                       (*(volatile uint32_t *)0x50001090)
#define adr_qspi1_seca_continue_rd_mod_index                                             (0x50001090)

#define reg_qspi1_seca_continue_status                             (*(volatile uint32_t *)0x50001094)
#define adr_qspi1_seca_continue_status                                                   (0x50001094)

#define reg_qspi1_seca_rst_trig                                    (*(volatile uint32_t *)0x50001098)
#define adr_qspi1_seca_rst_trig                                                          (0x50001098)

#define reg_qspi1_seca_rst_status                                  (*(volatile uint32_t *)0x5000109c)
#define adr_qspi1_seca_rst_status                                                        (0x5000109c)

#define reg_qspi1_seca_cache_access_status                         (*(volatile uint32_t *)0x500010a0)
#define adr_qspi1_seca_cache_access_status                                               (0x500010a0)

#define reg_qspi1_seca_cmd_send_status                             (*(volatile uint32_t *)0x500010a4)
#define adr_qspi1_seca_cmd_send_status                                                   (0x500010a4)

#define reg_qspi1_seca_manual_mode_cfg                             (*(volatile uint32_t *)0x500010c0)
#define adr_qspi1_seca_manual_mode_cfg                                                   (0x500010c0)
#define mask_qspi1_seca_manual_mode_cfg_maul_tx_data_seq_num         (0x600)                         
#define mask_qspi1_seca_manual_mode_cfg_maul_dcx_value               (0x100)                         
#define mask_qspi1_seca_manual_mode_cfg_maul_data_bit_num            (0xc0)                          
#define mask_qspi1_seca_manual_mode_cfg_cs_hold_ctrl                 (0x20)                          
#define mask_qspi1_seca_manual_mode_cfg_maul_rxtx_data_size          (0x1f)                          

#define reg_qspi1_seca_manual_mode_ctrl                            (*(volatile uint32_t *)0x500010c4)
#define adr_qspi1_seca_manual_mode_ctrl                                                  (0x500010c4)
#define mask_qspi1_seca_manual_mode_ctrl_maul_rd_dum                 (0x40)                          
#define mask_qspi1_seca_manual_mode_ctrl_maul_dcx_opt_mode           (0x20)                          
#define mask_qspi1_seca_manual_mode_ctrl_maul_dcx_mode               (0x18)                          
#define mask_qspi1_seca_manual_mode_ctrl_manual_trx_mode             (0x4)                           
#define mask_qspi1_seca_manual_mode_ctrl_cs_hold_mode                (0x2)                           
#define mask_qspi1_seca_manual_mode_ctrl_manual_mode                 (0x1)                           

#define reg_qspi1_seca_maul_rx_trig                                (*(volatile uint32_t *)0x500010c8)
#define adr_qspi1_seca_maul_rx_trig                                                      (0x500010c8)

#define reg_qspi1_seca_maul_mode_tx_st                             (*(volatile uint32_t *)0x500010cc)
#define adr_qspi1_seca_maul_mode_tx_st                                                   (0x500010cc)

#define reg_qspi1_seca_maul_mode_rx_st                             (*(volatile uint32_t *)0x500010d0)
#define adr_qspi1_seca_maul_mode_rx_st                                                   (0x500010d0)

#define reg_qspi1_seca_bypass_hpm                                  (*(volatile uint32_t *)0x500010d4)
#define adr_qspi1_seca_bypass_hpm                                                        (0x500010d4)

#define reg_qspi1_seca_atom_op_en                                  (*(volatile uint32_t *)0x500010d8)
#define adr_qspi1_seca_atom_op_en                                                        (0x500010d8)

#define reg_qspi1_seca_clr_hpm                                     (*(volatile uint32_t *)0x500010dc)
#define adr_qspi1_seca_clr_hpm                                                           (0x500010dc)


//---------------------------------------------------
// qspi2_seca in  domain address definition
//---------------------------------------------------

#define reg_qspi2_seca_sreg_qspi_spdr_rd                           (*(volatile uint32_t *)0x50002000)
#define adr_qspi2_seca_sreg_qspi_spdr_rd                                                 (0x50002000)

#define reg_qspi2_seca_sreg_qspi_spdr_wr                           (*(volatile uint32_t *)0x50002004)
#define adr_qspi2_seca_sreg_qspi_spdr_wr                                                 (0x50002004)

#define reg_qspi2_seca_int_status                                  (*(volatile uint32_t *)0x50002008)
#define adr_qspi2_seca_int_status                                                        (0x50002008)

#define reg_qspi2_seca_int_mask                                    (*(volatile uint32_t *)0x5000200c)
#define adr_qspi2_seca_int_mask                                                          (0x5000200c)

