EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_qspi2_seca_flash_busy_auto                             (*(volatile uint32_t *)0x50002070)
#define adr_qspi2_seca_flash_busy_auto                                                   (0x50002070)

#define reg_qspi2_seca_cache_cmd1                                  (*(volatile uint32_t *)0x50002080)
#define adr_qspi2_seca_cache_cmd1                                                        (0x50002080)
#define mask_qspi2_seca_cache_cmd1_hpm_cmd                           (0xff000000)                    
#define mask_qspi2_seca_cache_cmd1_resume_cmd                        (0xff0000)                      
#define mask_qspi2_seca_cache_cmd1_sus_cmd                           (0xff00)                        
#define mask_qspi2_seca_cache_cmd1_read_cmd                          (0xff)                          

#define reg_qspi2_seca_cache_cmd2                                  (*(volatile uint32_t *)0x50002084)
#define adr_qspi2_seca_cache_cmd2                                                        (0x50002084)
#define mask_qspi2_seca_cache_cmd2_write_cmd                         (0xff0000)                      
#define mask_qspi2_seca_cache_cmd2_continu_rd_mod                    (0xff00)                        
#define mask_qspi2_seca_cache_cmd2_exithpm_mod                       (0xff)                          

#define reg_qspi2_seca_cache_delay_set                             (*(volatile uint32_t *)0x50002088)
#define adr_qspi2_seca_cache_delay_set                                                   (0x50002088)
#define mask_qspi2_seca_cache_delay_set_hpm_delay_max                (0x3f)                          

#define reg_qspi2_seca_delay_set                                   (*(volatile uint32_t *)0x5000208c)
#define adr_qspi2_seca_delay_set                                                         (0x5000208c)
#define mask_qspi2_seca_delay_set_cache_rd_dummy                     (0xf0000000)                    
#define mask_qspi2_seca_delay_set_dir_wr_en                          (0x8000000)                     
#define mask_qspi2_seca_delay_set_cache_addr_byte_mode               (0x4000000)                     
#define mask_qspi2_seca_delay_set_cache_cmd_bit_num                  (0x3000000)                     
#define mask_qspi2_seca_delay_set_cache_addr_bit_num                 (0xc00000)                      
#define mask_qspi2_seca_delay_set_cache_data_bit_num                 (0x300000)                      
#define mask_qspi2_seca_delay_set_cache_no_dummy_cmd_len             (0xf0000)                       
#define mask_qspi2_seca_delay_set_cache_cmd_len                      (0xf000)                        
#define mask_qspi2_seca_delay_set_adr_bit_max                        (0xfc0)                         
#define mask_qspi2_seca_delay_set_hpm_len                            (0x3f)                          

#define reg_qspi2_seca_continue_rd_mod_index                       (*(volatile uint32_t *)0x50002090)
#define adr_qspi2_seca_continue_rd_mod_index                                             (0x50002090)

#define reg_qspi2_seca_continue_status                             (*(volatile uint32_t *)0x50002094)
#define adr_qspi2_seca_continue_status                                                   (0x50002094)

#define reg_qspi2_seca_rst_trig                                    (*(volatile uint32_t *)0x50002098)
#define adr_qspi2_seca_rst_trig                                                          (0x50002098)

#define reg_qspi2_seca_rst_status                                  (*(volatile uint32_t *)0x5000209c)
#define adr_qspi2_seca_rst_status                                                        (0x5000209c)

#define reg_qspi2_seca_cache_access_status                         (*(volatile uint32_t *)0x500020a0)
#define adr_qspi2_seca_cache_access_status                                               (0x500020a0)

#define reg_qspi2_seca_cmd_send_status                             (*(volatile uint32_t *)0x500020a4)
#define adr_qspi2_seca_cmd_send_status                                                   (0x500020a4)

#define reg_qspi2_seca_manual_mode_cfg                             (*(volatile uint32_t *)0x500020c0)
#define adr_qspi2_seca_manual_mode_cfg                                                   (0x500020c0)
#define mask_qspi2_seca_manual_mode_cfg_maul_tx_data_seq_num         (0x600)                         
#define mask_qspi2_seca_manual_mode_cfg_maul_dcx_value               (0x100)                         
#define mask_qspi2_seca_manual_mode_cfg_maul_data_bit_num            (0xc0)                          
#define mask_qspi2_seca_manual_mode_cfg_cs_hold_ctrl                 (0x20)                          
#define mask_qspi2_seca_manual_mode_cfg_maul_rxtx_data_size          (0x1f)                          

#define reg_qspi2_seca_manual_mode_ctrl                            (*(volatile uint32_t *)0x500020c4)
#define adr_qspi2_seca_manual_mode_ctrl                                                  (0x500020c4)
#define mask_qspi2_seca_manual_mode_ctrl_maul_rd_dum                 (0x40)                          
#define mask_qspi2_seca_manual_mode_ctrl_maul_dcx_opt_mode           (0x20)                          
#define mask_qspi2_seca_manual_mode_ctrl_maul_dcx_mode               (0x18)                          
#define mask_qspi2_seca_manual_mode_ctrl_manual_trx_mode             (0x4)                           
#define mask_qspi2_seca_manual_mode_ctrl_cs_hold_mode                (0x2)                           
#define mask_qspi2_seca_manual_mode_ctrl_manual_mode                 (0x1)                           

#define reg_qspi2_seca_maul_rx_trig                                (*(volatile uint32_t *)0x500020c8)
#define adr_qspi2_seca_maul_rx_trig                                                      (0x500020c8)

#define reg_qspi2_seca_maul_mode_tx_st                             (*(volatile uint32_t *)0x500020cc)
#define adr_qspi2_seca_maul_mode_tx_st                                                   (0x500020cc)

