EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_qspi2_seca_maul_mode_rx_st                             (*(volatile uint32_t *)0x500020d0)
#define adr_qspi2_seca_maul_mode_rx_st                                                   (0x500020d0)

#define reg_qspi2_seca_bypass_hpm                                  (*(volatile uint32_t *)0x500020d4)
#define adr_qspi2_seca_bypass_hpm                                                        (0x500020d4)

#define reg_qspi2_seca_atom_op_en                                  (*(volatile uint32_t *)0x500020d8)
#define adr_qspi2_seca_atom_op_en                                                        (0x500020d8)

#define reg_qspi2_seca_clr_hpm                                     (*(volatile uint32_t *)0x500020dc)
#define adr_qspi2_seca_clr_hpm                                                           (0x500020dc)


//---------------------------------------------------
// qspi3_seca in  domain address definition
//---------------------------------------------------

#define reg_qspi3_seca_sreg_qspi_spdr_rd                           (*(volatile uint32_t *)0x50003000)
#define adr_qspi3_seca_sreg_qspi_spdr_rd                                                 (0x50003000)

#define reg_qspi3_seca_sreg_qspi_spdr_wr                           (*(volatile uint32_t *)0x50003004)
#define adr_qspi3_seca_sreg_qspi_spdr_wr                                                 (0x50003004)

#define reg_qspi3_seca_int_status                                  (*(volatile uint32_t *)0x50003008)
#define adr_qspi3_seca_int_status                                                        (0x50003008)

#define reg_qspi3_seca_int_mask                                    (*(volatile uint32_t *)0x5000300c)
#define adr_qspi3_seca_int_mask                                                          (0x5000300c)

#define reg_qspi3_seca_int_clear                                   (*(volatile uint32_t *)0x50003010)
#define adr_qspi3_seca_int_clear                                                         (0x50003010)

#define reg_qspi3_seca_txfifo_threshold                            (*(volatile uint32_t *)0x50003014)
#define adr_qspi3_seca_txfifo_threshold                                                  (0x50003014)

#define reg_qspi3_seca_rxfifo_threshold                            (*(volatile uint32_t *)0x50003018)
#define adr_qspi3_seca_rxfifo_threshold                                                  (0x50003018)

#define reg_qspi3_seca_core_clock_en                               (*(volatile uint32_t *)0x5000301c)
#define adr_qspi3_seca_core_clock_en                                                     (0x5000301c)

#define reg_qspi3_seca_ext_cg_en                                   (*(volatile uint32_t *)0x50003020)
#define adr_qspi3_seca_ext_cg_en                                                         (0x50003020)

#define reg_qspi3_seca_scramble_ctrl                               (*(volatile uint32_t *)0x50003024)
#define adr_qspi3_seca_scramble_ctrl                                                     (0x50003024)
#define mask_qspi3_seca_scramble_ctrl_directif_scramble_en           (0x2)                           
#define mask_qspi3_seca_scramble_ctrl_indirectif_scramble_en         (0x1)                           

#define reg_qspi3_seca_scramble_key                                (*(volatile uint32_t *)0x50003028)
#define adr_qspi3_seca_scramble_key                                                      (0x50003028)

#define reg_qspi3_seca_spcr                                        (*(volatile uint32_t *)0x5000302c)
#define adr_qspi3_seca_spcr                                                              (0x5000302c)
#define mask_qspi3_seca_spcr_sample_edge                             (0x20)                          
#define mask_qspi3_seca_spcr_data_comb_mode                          (0x18)                          
#define mask_qspi3_seca_spcr_sda_mode                                (0x4)                           
#define mask_qspi3_seca_spcr_cpha                                    (0x2)                           
#define mask_qspi3_seca_spcr_cpol                                    (0x1)                           

#define reg_qspi3_seca_dly_cfg                                     (*(volatile uint32_t *)0x50003030)
#define adr_qspi3_seca_dly_cfg                                                           (0x50003030)
#define mask_qspi3_seca_dly_cfg_input_clk_dly                        (0x38)                          
#define mask_qspi3_seca_dly_cfg_output_clk_dly                       (0x7)                           

#define reg_qspi3_seca_opi_ctrl                                    (*(volatile uint32_t *)0x50003034)
#define adr_qspi3_seca_opi_ctrl                                                          (0x50003034)
#define mask_qspi3_seca_opi_ctrl_opi_en                              (0x100)                         
#define mask_qspi3_seca_opi_ctrl_dtr_read_cpha                       (0x80)                          
#define mask_qspi3_seca_opi_ctrl_write_dtr_en                        (0x40)                          
#define mask_qspi3_seca_opi_ctrl_read_dtr_en                         (0x20)                          
#define mask_qspi3_seca_opi_ctrl_datamask_en                         (0x10)                          
#define mask_qspi3_seca_opi_ctrl_byte_mask_config                    (0xf)                           

#define reg_qspi3_seca_send_ctrl                                   (*(volatile uint32_t *)0x50003040)
#define adr_qspi3_seca_send_ctrl                                                         (0x50003040)
#define mask_qspi3_seca_send_ctrl_adr_byte_mode                      (0x800)                         
#define mask_qspi3_seca_send_ctrl_cmd_with_arg                       (0x700)                         
#define mask_qspi3_seca_send_ctrl_adr_with_arg                       (0xc0)                          
#define mask_qspi3_seca_send_ctrl_cmd_bit_num                        (0x30)                          
#define mask_qspi3_seca_send_ctrl_addr_bit_num                       (0xc)                           
#define mask_qspi3_seca_send_ctrl_data_bit_num                       (0x3)                           

#define reg_qspi3_seca_reg_qspi_rxtx_dat_len                       (*(volatile uint32_t *)0x50003044)
#define adr_qspi3_seca_reg_qspi_rxtx_dat_len                                             (0x50003044)

#define reg_qspi3_seca_reg_qspi_cmd_reg                            (*(volatile uint32_t *)0x50003048)
#define adr_qspi3_seca_reg_qspi_cmd_reg                                                  (0x50003048)

