EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_qspi3_seca_reg_qspi_addr_reg                           (*(volatile uint32_t *)0x5000304c)
#define adr_qspi3_seca_reg_qspi_addr_reg                                                 (0x5000304c)

#define reg_qspi3_seca_mcu_adrcnd_bit_len                          (*(volatile uint32_t *)0x50003050)
#define adr_qspi3_seca_mcu_adrcnd_bit_len                                                (0x50003050)
#define mask_qspi3_seca_mcu_adrcnd_bit_len_mcu_rd_dummy              (0xf000)                        
#define mask_qspi3_seca_mcu_adrcnd_bit_len_mcu_cmd_max_len           (0xfc0)                         
#define mask_qspi3_seca_mcu_adrcnd_bit_len_mcu_adr_max_len           (0x3f)                          

#define reg_qspi3_seca_flash_busy                                  (*(volatile uint32_t *)0x50003054)
#define adr_qspi3_seca_flash_busy                                                        (0x50003054)

#define reg_qspi3_seca_auto_busy_enable                            (*(volatile uint32_t *)0x50003058)
#define adr_qspi3_seca_auto_busy_enable                                                  (0x50003058)

#define reg_qspi3_seca_auto_busy_configa                           (*(volatile uint32_t *)0x5000305c)
#define adr_qspi3_seca_auto_busy_configa                                                 (0x5000305c)
#define mask_qspi3_seca_auto_busy_configa_ini_cnt_value              (0xfffff000)                    
#define mask_qspi3_seca_auto_busy_configa_inval_cnt_value            (0xfff)                         

#define reg_qspi3_seca_auto_busy_configb                           (*(volatile uint32_t *)0x50003060)
#define adr_qspi3_seca_auto_busy_configb                                                 (0x50003060)
#define mask_qspi3_seca_auto_busy_configb_rdsr_cmd_num               (0x300)                         
#define mask_qspi3_seca_auto_busy_configb_rdsr_cmd                   (0xff)                          

#define reg_qspi3_seca_suspend_timing_ctrl                         (*(volatile uint32_t *)0x50003064)
#define adr_qspi3_seca_suspend_timing_ctrl                                               (0x50003064)
#define mask_qspi3_seca_suspend_timing_ctrl_sus_delay_max            (0xff000000)                    
#define mask_qspi3_seca_suspend_timing_ctrl_tps_tes_cfg              (0xff0000)                      
#define mask_qspi3_seca_suspend_timing_ctrl_ters_tprs_cfg            (0xff00)                        
#define mask_qspi3_seca_suspend_timing_ctrl_timeunit_us              (0xff)                          

#define reg_qspi3_seca_suspend_trig                                (*(volatile uint32_t *)0x50003068)
#define adr_qspi3_seca_suspend_trig                                                      (0x50003068)

#define reg_qspi3_seca_send_en                                     (*(volatile uint32_t *)0x5000306c)
#define adr_qspi3_seca_send_en                                                           (0x5000306c)

#define reg_qspi3_seca_flash_busy_auto                             (*(volatile uint32_t *)0x50003070)
#define adr_qspi3_seca_flash_busy_auto                                                   (0x50003070)

#define reg_qspi3_seca_cache_cmd1                                  (*(volatile uint32_t *)0x50003080)
#define adr_qspi3_seca_cache_cmd1                                                        (0x50003080)
#define mask_qspi3_seca_cache_cmd1_hpm_cmd                           (0xff000000)                    
#define mask_qspi3_seca_cache_cmd1_resume_cmd                        (0xff0000)                      
#define mask_qspi3_seca_cache_cmd1_sus_cmd                           (0xff00)                        
#define mask_qspi3_seca_cache_cmd1_read_cmd                          (0xff)                          

#define reg_qspi3_seca_cache_cmd2                                  (*(volatile uint32_t *)0x50003084)
#define adr_qspi3_seca_cache_cmd2                                                        (0x50003084)
#define mask_qspi3_seca_cache_cmd2_write_cmd                         (0xff0000)                      
#define mask_qspi3_seca_cache_cmd2_continu_rd_mod                    (0xff00)                        
#define mask_qspi3_seca_cache_cmd2_exithpm_mod                       (0xff)                          

#define reg_qspi3_seca_cache_delay_set                             (*(volatile uint32_t *)0x50003088)
#define adr_qspi3_seca_cache_delay_set                                                   (0x50003088)
#define mask_qspi3_seca_cache_delay_set_hpm_delay_max                (0x3f)                          

#define reg_qspi3_seca_delay_set                                   (*(volatile uint32_t *)0x5000308c)
#define adr_qspi3_seca_delay_set                                                         (0x5000308c)
#define mask_qspi3_seca_delay_set_cache_rd_dummy                     (0xf0000000)                    
#define mask_qspi3_seca_delay_set_dir_wr_en                          (0x8000000)                     
#define mask_qspi3_seca_delay_set_cache_addr_byte_mode               (0x4000000)                     
#define mask_qspi3_seca_delay_set_cache_cmd_bit_num                  (0x3000000)                     
#define mask_qspi3_seca_delay_set_cache_addr_bit_num                 (0xc00000)                      
#define mask_qspi3_seca_delay_set_cache_data_bit_num                 (0x300000)                      
#define mask_qspi3_seca_delay_set_cache_no_dummy_cmd_len             (0xf0000)                       
#define mask_qspi3_seca_delay_set_cache_cmd_len                      (0xf000)                        
#define mask_qspi3_seca_delay_set_adr_bit_max                        (0xfc0)                         
#define mask_qspi3_seca_delay_set_hpm_len                            (0x3f)                          

#define reg_qspi3_seca_continue_rd_mod_index                       (*(volatile uint32_t *)0x50003090)
#define adr_qspi3_seca_continue_rd_mod_index                                             (0x50003090)

#define reg_qspi3_seca_continue_status                             (*(volatile uint32_t *)0x50003094)
#define adr_qspi3_seca_continue_status                                                   (0x50003094)

#define reg_qspi3_seca_rst_trig                                    (*(volatile uint32_t *)0x50003098)
#define adr_qspi3_seca_rst_trig                                                          (0x50003098)

#define reg_qspi3_seca_rst_status                                  (*(volatile uint32_t *)0x5000309c)
#define adr_qspi3_seca_rst_status                                                        (0x5000309c)

#define reg_qspi3_seca_cache_access_status                         (*(volatile uint32_t *)0x500030a0)
#define adr_qspi3_seca_cache_access_status                                               (0x500030a0)

#define reg_qspi3_seca_cmd_send_status                             (*(volatile uint32_t *)0x500030a4)
#define adr_qspi3_seca_cmd_send_status                                                   (0x500030a4)

#define reg_qspi3_seca_manual_mode_cfg                             (*(volatile uint32_t *)0x500030c0)
#define adr_qspi3_seca_manual_mode_cfg                                                   (0x500030c0)
#define mask_qspi3_seca_manual_mode_cfg_maul_tx_data_seq_num         (0x600)                         
#define mask_qspi3_seca_manual_mode_cfg_maul_dcx_value               (0x100)                         
#define mask_qspi3_seca_manual_mode_cfg_maul_data_bit_num            (0xc0)                          
#define mask_qspi3_seca_manual_mode_cfg_cs_hold_ctrl                 (0x20)                          
#define mask_qspi3_seca_manual_mode_cfg_maul_rxtx_data_size          (0x1f)                          

#define reg_qspi3_seca_manual_mode_ctrl                            (*(volatile uint32_t *)0x500030c4)
#define adr_qspi3_seca_manual_mode_ctrl                                                  (0x500030c4)
#define mask_qspi3_seca_manual_mode_ctrl_maul_rd_dum                 (0x40)                          
#define mask_qspi3_seca_manual_mode_ctrl_maul_dcx_opt_mode           (0x20)                          
#define mask_qspi3_seca_manual_mode_ctrl_maul_dcx_mode               (0x18)                          
#define mask_qspi3_seca_manual_mode_ctrl_manual_trx_mode             (0x4)                           
#define mask_qspi3_seca_manual_mode_ctrl_cs_hold_mode                (0x2)                           
#define mask_qspi3_seca_manual_mode_ctrl_manual_mode                 (0x1)                           

#define reg_qspi3_seca_maul_rx_trig                                (*(volatile uint32_t *)0x500030c8)
#define adr_qspi3_seca_maul_rx_trig                                                      (0x500030c8)

#define reg_qspi3_seca_maul_mode_tx_st                             (*(volatile uint32_t *)0x500030cc)
#define adr_qspi3_seca_maul_mode_tx_st                                                   (0x500030cc)

#define reg_qspi3_seca_maul_mode_rx_st                             (*(volatile uint32_t *)0x500030d0)
#define adr_qspi3_seca_maul_mode_rx_st                                                   (0x500030d0)

#define reg_qspi3_seca_bypass_hpm                                  (*(volatile uint32_t *)0x500030d4)
#define adr_qspi3_seca_bypass_hpm                                                        (0x500030d4)

#define reg_qspi3_seca_atom_op_en                                  (*(volatile uint32_t *)0x500030d8)
#define adr_qspi3_seca_atom_op_en                                                        (0x500030d8)

#define reg_qspi3_seca_clr_hpm                                     (*(volatile uint32_t *)0x500030dc)
#define adr_qspi3_seca_clr_hpm                                                           (0x500030dc)


//---------------------------------------------------
// dma in  domain address definition
//---------------------------------------------------

#define reg_dma_0_int_status                                       (*(volatile uint32_t *)0x50008000)
#define adr_dma_0_int_status                                                             (0x50008000)

