EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_dma_0_int_mask                                         (*(volatile uint32_t *)0x50008004)
#define adr_dma_0_int_mask                                                               (0x50008004)

#define reg_dma_0_int_clear                                        (*(volatile uint32_t *)0x50008008)
#define adr_dma_0_int_clear                                                              (0x50008008)

#define reg_dma_0_config                                           (*(volatile uint32_t *)0x5000800c)
#define adr_dma_0_config                                                                 (0x5000800c)
#define mask_dma_0_config_0_en                                       (0x10000000)                    
#define mask_dma_0_config_0_pause                                    (0x8000000)                     
#define mask_dma_0_config_0_stop                                     (0x4000000)                     
#define mask_dma_0_config_0_src_inc                                  (0x2000000)                     
#define mask_dma_0_config_0_src_size                                 (0x1800000)                     
#define mask_dma_0_config_0_dst_inc                                  (0x400000)                      
#define mask_dma_0_config_0_dst_size                                 (0x300000)                      
#define mask_dma_0_config_0_mode                                     (0xc0000)                       
#define mask_dma_0_config_0_pri                                      (0x20000)                       
#define mask_dma_0_config_0_circ                                     (0x10000)                       
#define mask_dma_0_config_0_cfg_cnt                                  (0xffff)                        

#define reg_dma_0_total_length                                     (*(volatile uint32_t *)0x50008010)
#define adr_dma_0_total_length                                                           (0x50008010)

#define reg_dma_0_src_addr                                         (*(volatile uint32_t *)0x50008014)
#define adr_dma_0_src_addr                                                               (0x50008014)

#define reg_dma_0_dst_addr                                         (*(volatile uint32_t *)0x50008018)
#define adr_dma_0_dst_addr                                                               (0x50008018)

#define reg_dma_0_tcnt                                             (*(volatile uint32_t *)0x5000801c)
#define adr_dma_0_tcnt                                                                   (0x5000801c)

#define reg_dma_0_total_tcnt                                       (*(volatile uint32_t *)0x50008020)
#define adr_dma_0_total_tcnt                                                             (0x50008020)

#define reg_dma_0_to_cfg                                           (*(volatile uint32_t *)0x50008024)
#define adr_dma_0_to_cfg                                                                 (0x50008024)
#define mask_dma_0_to_cfg_0_tu                                       (0x300)                         
#define mask_dma_0_to_cfg_0_to_thld                                  (0xff)                          

#define reg_dma_0_peri_sel                                         (*(volatile uint32_t *)0x50008028)
#define adr_dma_0_peri_sel                                                               (0x50008028)

#define reg_dma_0_inter_tx_cfg                                     (*(volatile uint32_t *)0x5000802c)
#define adr_dma_0_inter_tx_cfg                                                           (0x5000802c)
#define mask_dma_0_inter_tx_cfg_0_inter_tx_mode                      (0x10000)                       
#define mask_dma_0_inter_tx_cfg_0_inter_tx_offset                    (0xffff)                        

#define reg_dma_0_data_ready                                       (*(volatile uint32_t *)0x50008030)
#define adr_dma_0_data_ready                                                             (0x50008030)

#define reg_dma_0_int_sel                                          (*(volatile uint32_t *)0x50008034)
#define adr_dma_0_int_sel                                                                (0x50008034)

#define reg_dma_0_p2p_peri_sel                                     (*(volatile uint32_t *)0x50008038)
#define adr_dma_0_p2p_peri_sel                                                           (0x50008038)
#define mask_dma_0_p2p_peri_sel_src_peri_sel_res                     (0xc000)                        
#define mask_dma_0_p2p_peri_sel_src_peri_sel                         (0x3f00)                        
#define mask_dma_0_p2p_peri_sel_dst_peri_sel_res                     (0xc0)                          
#define mask_dma_0_p2p_peri_sel_dst_peri_sel                         (0x3f)                          

#define reg_dma_0_sram_ctrl                                        (*(volatile uint32_t *)0x5000803c)
#define adr_dma_0_sram_ctrl                                                              (0x5000803c)
#define mask_dma_0_sram_ctrl_sram_test1                              (0x4000)                        
#define mask_dma_0_sram_ctrl_sram_rme                                (0x2000)                        
#define mask_dma_0_sram_ctrl_sram_rm                                 (0x1e00)                        
#define mask_dma_0_sram_ctrl_sram_ra                                 (0x180)                         
#define mask_dma_0_sram_ctrl_sram_wa                                 (0x70)                          
#define mask_dma_0_sram_ctrl_sram_ls                                 (0x1)                           

#define reg_dma_1_int_status                                       (*(volatile uint32_t *)0x50008040)
#define adr_dma_1_int_status                                                             (0x50008040)

#define reg_dma_1_int_mask                                         (*(volatile uint32_t *)0x50008044)
#define adr_dma_1_int_mask                                                               (0x50008044)

#define reg_dma_1_int_clear                                        (*(volatile uint32_t *)0x50008048)
#define adr_dma_1_int_clear                                                              (0x50008048)

#define reg_dma_1_config                                           (*(volatile uint32_t *)0x5000804c)
#define adr_dma_1_config                                                                 (0x5000804c)
#define mask_dma_1_config_1_en                                       (0x10000000)                    
#define mask_dma_1_config_1_pause                                    (0x8000000)                     
#define mask_dma_1_config_1_stop                                     (0x4000000)                     
#define mask_dma_1_config_1_src_inc                                  (0x2000000)                     
#define mask_dma_1_config_1_src_size                                 (0x1800000)                     
#define mask_dma_1_config_1_dst_inc                                  (0x400000)                      
#define mask_dma_1_config_1_dst_size                                 (0x300000)                      
#define mask_dma_1_config_1_mode                                     (0xc0000)                       
#define mask_dma_1_config_1_pri                                      (0x20000)                       
#define mask_dma_1_config_1_circ                                     (0x10000)                       
#define mask_dma_1_config_1_cfg_cnt                                  (0xffff)                        

