EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_dma_1_total_length                                     (*(volatile uint32_t *)0x50008050)
#define adr_dma_1_total_length                                                           (0x50008050)

#define reg_dma_1_src_addr                                         (*(volatile uint32_t *)0x50008054)
#define adr_dma_1_src_addr                                                               (0x50008054)

#define reg_dma_1_dst_addr                                         (*(volatile uint32_t *)0x50008058)
#define adr_dma_1_dst_addr                                                               (0x50008058)

#define reg_dma_1_tcnt                                             (*(volatile uint32_t *)0x5000805c)
#define adr_dma_1_tcnt                                                                   (0x5000805c)

#define reg_dma_1_total_tcnt                                       (*(volatile uint32_t *)0x50008060)
#define adr_dma_1_total_tcnt                                                             (0x50008060)

#define reg_dma_1_to_cfg                                           (*(volatile uint32_t *)0x50008064)
#define adr_dma_1_to_cfg                                                                 (0x50008064)
#define mask_dma_1_to_cfg_1_tu                                       (0x300)                         
#define mask_dma_1_to_cfg_1_to_thld                                  (0xff)                          

#define reg_dma_1_peri_sel                                         (*(volatile uint32_t *)0x50008068)
#define adr_dma_1_peri_sel                                                               (0x50008068)

#define reg_dma_1_inter_tx_cfg                                     (*(volatile uint32_t *)0x5000806c)
#define adr_dma_1_inter_tx_cfg                                                           (0x5000806c)
#define mask_dma_1_inter_tx_cfg_1_inter_tx_mode                      (0x10000)                       
#define mask_dma_1_inter_tx_cfg_1_inter_tx_offset                    (0xffff)                        

#define reg_dma_1_data_ready                                       (*(volatile uint32_t *)0x50008070)
#define adr_dma_1_data_ready                                                             (0x50008070)

#define reg_dma_1_int_sel                                          (*(volatile uint32_t *)0x50008074)
#define adr_dma_1_int_sel                                                                (0x50008074)

#define reg_dma_2_int_status                                       (*(volatile uint32_t *)0x50008080)
#define adr_dma_2_int_status                                                             (0x50008080)

#define reg_dma_2_int_mask                                         (*(volatile uint32_t *)0x50008084)
#define adr_dma_2_int_mask                                                               (0x50008084)

#define reg_dma_2_int_clear                                        (*(volatile uint32_t *)0x50008088)
#define adr_dma_2_int_clear                                                              (0x50008088)

#define reg_dma_2_config                                           (*(volatile uint32_t *)0x5000808c)
#define adr_dma_2_config                                                                 (0x5000808c)
#define mask_dma_2_config_2_en                                       (0x10000000)                    
#define mask_dma_2_config_2_pause                                    (0x8000000)                     
#define mask_dma_2_config_2_stop                                     (0x4000000)                     
#define mask_dma_2_config_2_src_inc                                  (0x2000000)                     
#define mask_dma_2_config_2_src_size                                 (0x1800000)                     
#define mask_dma_2_config_2_dst_inc                                  (0x400000)                      
#define mask_dma_2_config_2_dst_size                                 (0x300000)                      
#define mask_dma_2_config_2_mode                                     (0xc0000)                       
#define mask_dma_2_config_2_pri                                      (0x20000)                       
#define mask_dma_2_config_2_circ                                     (0x10000)                       
#define mask_dma_2_config_2_cfg_cnt                                  (0xffff)                        

#define reg_dma_2_total_length                                     (*(volatile uint32_t *)0x50008090)
#define adr_dma_2_total_length                                                           (0x50008090)

#define reg_dma_2_src_addr                                         (*(volatile uint32_t *)0x50008094)
#define adr_dma_2_src_addr                                                               (0x50008094)

#define reg_dma_2_dst_addr                                         (*(volatile uint32_t *)0x50008098)
#define adr_dma_2_dst_addr                                                               (0x50008098)

#define reg_dma_2_tcnt                                             (*(volatile uint32_t *)0x5000809c)
#define adr_dma_2_tcnt                                                                   (0x5000809c)

#define reg_dma_2_total_tcnt                                       (*(volatile uint32_t *)0x500080a0)
#define adr_dma_2_total_tcnt                                                             (0x500080a0)

#define reg_dma_2_to_cfg                                           (*(volatile uint32_t *)0x500080a4)
#define adr_dma_2_to_cfg                                                                 (0x500080a4)
#define mask_dma_2_to_cfg_2_tu                                       (0x300)                         
#define mask_dma_2_to_cfg_2_to_thld                                  (0xff)                          

#define reg_dma_2_peri_sel                                         (*(volatile uint32_t *)0x500080a8)
#define adr_dma_2_peri_sel                                                               (0x500080a8)

#define reg_dma_2_inter_tx_cfg                                     (*(volatile uint32_t *)0x500080ac)
#define adr_dma_2_inter_tx_cfg                                                           (0x500080ac)
#define mask_dma_2_inter_tx_cfg_2_inter_tx_mode                      (0x10000)                       
#define mask_dma_2_inter_tx_cfg_2_inter_tx_offset                    (0xffff)                        

#define reg_dma_2_data_ready                                       (*(volatile uint32_t *)0x500080b0)
#define adr_dma_2_data_ready                                                             (0x500080b0)

#define reg_dma_2_int_sel                                          (*(volatile uint32_t *)0x500080b4)
#define adr_dma_2_int_sel                                                                (0x500080b4)

