EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_dma_3_int_status                                       (*(volatile uint32_t *)0x500080c0)
#define adr_dma_3_int_status                                                             (0x500080c0)

#define reg_dma_3_int_mask                                         (*(volatile uint32_t *)0x500080c4)
#define adr_dma_3_int_mask                                                               (0x500080c4)

#define reg_dma_3_int_clear                                        (*(volatile uint32_t *)0x500080c8)
#define adr_dma_3_int_clear                                                              (0x500080c8)

#define reg_dma_3_config                                           (*(volatile uint32_t *)0x500080cc)
#define adr_dma_3_config                                                                 (0x500080cc)
#define mask_dma_3_config_3_en                                       (0x10000000)                    
#define mask_dma_3_config_3_pause                                    (0x8000000)                     
#define mask_dma_3_config_3_stop                                     (0x4000000)                     
#define mask_dma_3_config_3_src_inc                                  (0x2000000)                     
#define mask_dma_3_config_3_src_size                                 (0x1800000)                     
#define mask_dma_3_config_3_dst_inc                                  (0x400000)                      
#define mask_dma_3_config_3_dst_size                                 (0x300000)                      
#define mask_dma_3_config_3_mode                                     (0xc0000)                       
#define mask_dma_3_config_3_pri                                      (0x20000)                       
#define mask_dma_3_config_3_circ                                     (0x10000)                       
#define mask_dma_3_config_3_cfg_cnt                                  (0xffff)                        

#define reg_dma_3_total_length                                     (*(volatile uint32_t *)0x500080d0)
#define adr_dma_3_total_length                                                           (0x500080d0)

#define reg_dma_3_src_addr                                         (*(volatile uint32_t *)0x500080d4)
#define adr_dma_3_src_addr                                                               (0x500080d4)

#define reg_dma_3_dst_addr                                         (*(volatile uint32_t *)0x500080d8)
#define adr_dma_3_dst_addr                                                               (0x500080d8)

#define reg_dma_3_tcnt                                             (*(volatile uint32_t *)0x500080dc)
#define adr_dma_3_tcnt                                                                   (0x500080dc)

#define reg_dma_3_total_tcnt                                       (*(volatile uint32_t *)0x500080e0)
#define adr_dma_3_total_tcnt                                                             (0x500080e0)

#define reg_dma_3_to_cfg                                           (*(volatile uint32_t *)0x500080e4)
#define adr_dma_3_to_cfg                                                                 (0x500080e4)
#define mask_dma_3_to_cfg_3_tu                                       (0x300)                         
#define mask_dma_3_to_cfg_3_to_thld                                  (0xff)                          

#define reg_dma_3_peri_sel                                         (*(volatile uint32_t *)0x500080e8)
#define adr_dma_3_peri_sel                                                               (0x500080e8)

#define reg_dma_3_inter_tx_cfg                                     (*(volatile uint32_t *)0x500080ec)
#define adr_dma_3_inter_tx_cfg                                                           (0x500080ec)
#define mask_dma_3_inter_tx_cfg_3_inter_tx_mode                      (0x10000)                       
#define mask_dma_3_inter_tx_cfg_3_inter_tx_offset                    (0xffff)                        

#define reg_dma_3_data_ready                                       (*(volatile uint32_t *)0x500080f0)
#define adr_dma_3_data_ready                                                             (0x500080f0)

#define reg_dma_3_int_sel                                          (*(volatile uint32_t *)0x500080f4)
#define adr_dma_3_int_sel                                                                (0x500080f4)

#define reg_dma_4_int_status                                       (*(volatile uint32_t *)0x50008100)
#define adr_dma_4_int_status                                                             (0x50008100)

#define reg_dma_4_int_mask                                         (*(volatile uint32_t *)0x50008104)
#define adr_dma_4_int_mask                                                               (0x50008104)

#define reg_dma_4_int_clear                                        (*(volatile uint32_t *)0x50008108)
#define adr_dma_4_int_clear                                                              (0x50008108)

#define reg_dma_4_config                                           (*(volatile uint32_t *)0x5000810c)
#define adr_dma_4_config                                                                 (0x5000810c)
#define mask_dma_4_config_4_en                                       (0x10000000)                    
#define mask_dma_4_config_4_pause                                    (0x8000000)                     
#define mask_dma_4_config_4_stop                                     (0x4000000)                     
#define mask_dma_4_config_4_src_inc                                  (0x2000000)                     
#define mask_dma_4_config_4_src_size                                 (0x1800000)                     
#define mask_dma_4_config_4_dst_inc                                  (0x400000)                      
#define mask_dma_4_config_4_dst_size                                 (0x300000)                      
#define mask_dma_4_config_4_mode                                     (0xc0000)                       
#define mask_dma_4_config_4_pri                                      (0x20000)                       
#define mask_dma_4_config_4_circ                                     (0x10000)                       
#define mask_dma_4_config_4_cfg_cnt                                  (0xffff)                        

