EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_dma_4_total_length                                     (*(volatile uint32_t *)0x50008110)
#define adr_dma_4_total_length                                                           (0x50008110)

#define reg_dma_4_src_addr                                         (*(volatile uint32_t *)0x50008114)
#define adr_dma_4_src_addr                                                               (0x50008114)

#define reg_dma_4_dst_addr                                         (*(volatile uint32_t *)0x50008118)
#define adr_dma_4_dst_addr                                                               (0x50008118)

#define reg_dma_4_tcnt                                             (*(volatile uint32_t *)0x5000811c)
#define adr_dma_4_tcnt                                                                   (0x5000811c)

#define reg_dma_4_total_tcnt                                       (*(volatile uint32_t *)0x50008120)
#define adr_dma_4_total_tcnt                                                             (0x50008120)

#define reg_dma_4_to_cfg                                           (*(volatile uint32_t *)0x50008124)
#define adr_dma_4_to_cfg                                                                 (0x50008124)
#define mask_dma_4_to_cfg_4_tu                                       (0x300)                         
#define mask_dma_4_to_cfg_4_to_thld                                  (0xff)                          

#define reg_dma_4_peri_sel                                         (*(volatile uint32_t *)0x50008128)
#define adr_dma_4_peri_sel                                                               (0x50008128)

#define reg_dma_4_inter_tx_cfg                                     (*(volatile uint32_t *)0x5000812c)
#define adr_dma_4_inter_tx_cfg                                                           (0x5000812c)
#define mask_dma_4_inter_tx_cfg_4_inter_tx_mode                      (0x10000)                       
#define mask_dma_4_inter_tx_cfg_4_inter_tx_offset                    (0xffff)                        

#define reg_dma_4_data_ready                                       (*(volatile uint32_t *)0x50008130)
#define adr_dma_4_data_ready                                                             (0x50008130)

#define reg_dma_4_int_sel                                          (*(volatile uint32_t *)0x50008134)
#define adr_dma_4_int_sel                                                                (0x50008134)

#define reg_dma_5_int_status                                       (*(volatile uint32_t *)0x50008140)
#define adr_dma_5_int_status                                                             (0x50008140)

#define reg_dma_5_int_mask                                         (*(volatile uint32_t *)0x50008144)
#define adr_dma_5_int_mask                                                               (0x50008144)

#define reg_dma_5_int_clear                                        (*(volatile uint32_t *)0x50008148)
#define adr_dma_5_int_clear                                                              (0x50008148)

#define reg_dma_5_config                                           (*(volatile uint32_t *)0x5000814c)
#define adr_dma_5_config                                                                 (0x5000814c)
#define mask_dma_5_config_5_en                                       (0x10000000)                    
#define mask_dma_5_config_5_pause                                    (0x8000000)                     
#define mask_dma_5_config_5_stop                                     (0x4000000)                     
#define mask_dma_5_config_5_src_inc                                  (0x2000000)                     
#define mask_dma_5_config_5_src_size                                 (0x1800000)                     
#define mask_dma_5_config_5_dst_inc                                  (0x400000)                      
#define mask_dma_5_config_5_dst_size                                 (0x300000)                      
#define mask_dma_5_config_5_mode                                     (0xc0000)                       
#define mask_dma_5_config_5_pri                                      (0x20000)                       
#define mask_dma_5_config_5_circ                                     (0x10000)                       
#define mask_dma_5_config_5_cfg_cnt                                  (0xffff)                        

#define reg_dma_5_total_length                                     (*(volatile uint32_t *)0x50008150)
#define adr_dma_5_total_length                                                           (0x50008150)

#define reg_dma_5_src_addr                                         (*(volatile uint32_t *)0x50008154)
#define adr_dma_5_src_addr                                                               (0x50008154)

#define reg_dma_5_dst_addr                                         (*(volatile uint32_t *)0x50008158)
#define adr_dma_5_dst_addr                                                               (0x50008158)

#define reg_dma_5_tcnt                                             (*(volatile uint32_t *)0x5000815c)
#define adr_dma_5_tcnt                                                                   (0x5000815c)

#define reg_dma_5_total_tcnt                                       (*(volatile uint32_t *)0x50008160)
#define adr_dma_5_total_tcnt                                                             (0x50008160)

#define reg_dma_5_to_cfg                                           (*(volatile uint32_t *)0x50008164)
#define adr_dma_5_to_cfg                                                                 (0x50008164)
#define mask_dma_5_to_cfg_5_tu                                       (0x300)                         
#define mask_dma_5_to_cfg_5_to_thld                                  (0xff)                          

#define reg_dma_5_peri_sel                                         (*(volatile uint32_t *)0x50008168)
#define adr_dma_5_peri_sel                                                               (0x50008168)

#define reg_dma_5_inter_tx_cfg                                     (*(volatile uint32_t *)0x5000816c)
#define adr_dma_5_inter_tx_cfg                                                           (0x5000816c)
#define mask_dma_5_inter_tx_cfg_5_inter_tx_mode                      (0x10000)                       
#define mask_dma_5_inter_tx_cfg_5_inter_tx_offset                    (0xffff)                        

#define reg_dma_5_data_ready                                       (*(volatile uint32_t *)0x50008170)
#define adr_dma_5_data_ready                                                             (0x50008170)

