EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_dma_5_int_sel                                          (*(volatile uint32_t *)0x50008174)
#define adr_dma_5_int_sel                                                                (0x50008174)

#define reg_dma_6_int_status                                       (*(volatile uint32_t *)0x50008180)
#define adr_dma_6_int_status                                                             (0x50008180)

#define reg_dma_6_int_mask                                         (*(volatile uint32_t *)0x50008184)
#define adr_dma_6_int_mask                                                               (0x50008184)

#define reg_dma_6_int_clear                                        (*(volatile uint32_t *)0x50008188)
#define adr_dma_6_int_clear                                                              (0x50008188)

#define reg_dma_6_config                                           (*(volatile uint32_t *)0x5000818c)
#define adr_dma_6_config                                                                 (0x5000818c)
#define mask_dma_6_config_6_en                                       (0x10000000)                    
#define mask_dma_6_config_6_pause                                    (0x8000000)                     
#define mask_dma_6_config_6_stop                                     (0x4000000)                     
#define mask_dma_6_config_6_src_inc                                  (0x2000000)                     
#define mask_dma_6_config_6_src_size                                 (0x1800000)                     
#define mask_dma_6_config_6_dst_inc                                  (0x400000)                      
#define mask_dma_6_config_6_dst_size                                 (0x300000)                      
#define mask_dma_6_config_6_mode                                     (0xc0000)                       
#define mask_dma_6_config_6_pri                                      (0x20000)                       
#define mask_dma_6_config_6_circ                                     (0x10000)                       
#define mask_dma_6_config_6_cfg_cnt                                  (0xffff)                        

#define reg_dma_6_total_length                                     (*(volatile uint32_t *)0x50008190)
#define adr_dma_6_total_length                                                           (0x50008190)

#define reg_dma_6_src_addr                                         (*(volatile uint32_t *)0x50008194)
#define adr_dma_6_src_addr                                                               (0x50008194)

#define reg_dma_6_dst_addr                                         (*(volatile uint32_t *)0x50008198)
#define adr_dma_6_dst_addr                                                               (0x50008198)

#define reg_dma_6_tcnt                                             (*(volatile uint32_t *)0x5000819c)
#define adr_dma_6_tcnt                                                                   (0x5000819c)

#define reg_dma_6_total_tcnt                                       (*(volatile uint32_t *)0x500081a0)
#define adr_dma_6_total_tcnt                                                             (0x500081a0)

#define reg_dma_6_to_cfg                                           (*(volatile uint32_t *)0x500081a4)
#define adr_dma_6_to_cfg                                                                 (0x500081a4)
#define mask_dma_6_to_cfg_6_tu                                       (0x300)                         
#define mask_dma_6_to_cfg_6_to_thld                                  (0xff)                          

#define reg_dma_6_peri_sel                                         (*(volatile uint32_t *)0x500081a8)
#define adr_dma_6_peri_sel                                                               (0x500081a8)

#define reg_dma_6_inter_tx_cfg                                     (*(volatile uint32_t *)0x500081ac)
#define adr_dma_6_inter_tx_cfg                                                           (0x500081ac)
#define mask_dma_6_inter_tx_cfg_6_inter_tx_mode                      (0x10000)                       
#define mask_dma_6_inter_tx_cfg_6_inter_tx_offset                    (0xffff)                        

#define reg_dma_6_data_ready                                       (*(volatile uint32_t *)0x500081b0)
#define adr_dma_6_data_ready                                                             (0x500081b0)

#define reg_dma_6_int_sel                                          (*(volatile uint32_t *)0x500081b4)
#define adr_dma_6_int_sel                                                                (0x500081b4)

#define reg_dma_7_int_status                                       (*(volatile uint32_t *)0x500081c0)
#define adr_dma_7_int_status                                                             (0x500081c0)

#define reg_dma_7_int_mask                                         (*(volatile uint32_t *)0x500081c4)
#define adr_dma_7_int_mask                                                               (0x500081c4)

#define reg_dma_7_int_clear                                        (*(volatile uint32_t *)0x500081c8)
#define adr_dma_7_int_clear                                                              (0x500081c8)

#define reg_dma_7_config                                           (*(volatile uint32_t *)0x500081cc)
#define adr_dma_7_config                                                                 (0x500081cc)
#define mask_dma_7_config_7_en                                       (0x10000000)                    
#define mask_dma_7_config_7_pause                                    (0x8000000)                     
#define mask_dma_7_config_7_stop                                     (0x4000000)                     
#define mask_dma_7_config_7_src_inc                                  (0x2000000)                     
#define mask_dma_7_config_7_src_size                                 (0x1800000)                     
#define mask_dma_7_config_7_dst_inc                                  (0x400000)                      
#define mask_dma_7_config_7_dst_size                                 (0x300000)                      
#define mask_dma_7_config_7_mode                                     (0xc0000)                       
#define mask_dma_7_config_7_pri                                      (0x20000)                       
#define mask_dma_7_config_7_circ                                     (0x10000)                       
#define mask_dma_7_config_7_cfg_cnt                                  (0xffff)                        

