EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_dma_7_total_length                                     (*(volatile uint32_t *)0x500081d0)
#define adr_dma_7_total_length                                                           (0x500081d0)

#define reg_dma_7_src_addr                                         (*(volatile uint32_t *)0x500081d4)
#define adr_dma_7_src_addr                                                               (0x500081d4)

#define reg_dma_7_dst_addr                                         (*(volatile uint32_t *)0x500081d8)
#define adr_dma_7_dst_addr                                                               (0x500081d8)

#define reg_dma_7_tcnt                                             (*(volatile uint32_t *)0x500081dc)
#define adr_dma_7_tcnt                                                                   (0x500081dc)

#define reg_dma_7_total_tcnt                                       (*(volatile uint32_t *)0x500081e0)
#define adr_dma_7_total_tcnt                                                             (0x500081e0)

#define reg_dma_7_to_cfg                                           (*(volatile uint32_t *)0x500081e4)
#define adr_dma_7_to_cfg                                                                 (0x500081e4)
#define mask_dma_7_to_cfg_7_tu                                       (0x300)                         
#define mask_dma_7_to_cfg_7_to_thld                                  (0xff)                          

#define reg_dma_7_peri_sel                                         (*(volatile uint32_t *)0x500081e8)
#define adr_dma_7_peri_sel                                                               (0x500081e8)

#define reg_dma_7_inter_tx_cfg                                     (*(volatile uint32_t *)0x500081ec)
#define adr_dma_7_inter_tx_cfg                                                           (0x500081ec)
#define mask_dma_7_inter_tx_cfg_7_inter_tx_mode                      (0x10000)                       
#define mask_dma_7_inter_tx_cfg_7_inter_tx_offset                    (0xffff)                        

#define reg_dma_7_data_ready                                       (*(volatile uint32_t *)0x500081f0)
#define adr_dma_7_data_ready                                                             (0x500081f0)

#define reg_dma_7_int_sel                                          (*(volatile uint32_t *)0x500081f4)
#define adr_dma_7_int_sel                                                                (0x500081f4)

#define reg_dma_ext_cg_en                                          (*(volatile uint32_t *)0x500081f8)
#define adr_dma_ext_cg_en                                                                (0x500081f8)


//---------------------------------------------------
// cach_ret_pd in  domain address definition
//---------------------------------------------------

#define reg_cach_ret_pd_cach_ctrl                                  (*(volatile uint32_t *)0x50009000)
#define adr_cach_ret_pd_cach_ctrl                                                        (0x50009000)
#define mask_cach_ret_pd_cach_ctrl_wrap_n_incr                       (0x40)                          
#define mask_cach_ret_pd_cach_ctrl_cmd                               (0x3e)                          
#define mask_cach_ret_pd_cach_ctrl_en                                (0x1)                           

#define reg_cach_cmd_en                                            (*(volatile uint32_t *)0x50009004)
#define adr_cach_cmd_en                                                                  (0x50009004)

#define reg_cach_cmd_busy                                          (*(volatile uint32_t *)0x50009008)
#define adr_cach_cmd_busy                                                                (0x50009008)

#define reg_cach_access_cnt_cm3                                    (*(volatile uint32_t *)0x5000900c)
#define adr_cach_access_cnt_cm3                                                          (0x5000900c)

#define reg_cach_access_cnt_slv                                    (*(volatile uint32_t *)0x50009010)
#define adr_cach_access_cnt_slv                                                          (0x50009010)

#define reg_cach_miss_cnt_basic                                    (*(volatile uint32_t *)0x50009014)
#define adr_cach_miss_cnt_basic                                                          (0x50009014)

#define reg_cach_miss_cnt_adv                                      (*(volatile uint32_t *)0x50009018)
#define adr_cach_miss_cnt_adv                                                            (0x50009018)

#define reg_cach_penalty_cycle_cnt_cm3                             (*(volatile uint32_t *)0x5000901c)
#define adr_cach_penalty_cycle_cnt_cm3                                                   (0x5000901c)

#define reg_cach_penalty_cycle_cnt_slv                             (*(volatile uint32_t *)0x50009020)
#define adr_cach_penalty_cycle_cnt_slv                                                   (0x50009020)

#define reg_cach_last_miss_addr                                    (*(volatile uint32_t *)0x50009024)
#define adr_cach_last_miss_addr                                                          (0x50009024)

#define reg_cach_bist_err_cnt                                      (*(volatile uint32_t *)0x50009028)
#define adr_cach_bist_err_cnt                                                            (0x50009028)

#define reg_cach_reset_statistic_info                              (*(volatile uint32_t *)0x5000902c)
#define adr_cach_reset_statistic_info                                                    (0x5000902c)
#define mask_cach_reset_statistic_info_reset_last_miss_addr          (0x40)                          
#define mask_cach_reset_statistic_info_reset_penalty_cycle_cnt_slv   (0x20)                          
#define mask_cach_reset_statistic_info_reset_penalty_cycle_cnt_cm3   (0x10)                          
#define mask_cach_reset_statistic_info_reset_miss_cnt_adv            (0x8)                           
#define mask_cach_reset_statistic_info_reset_miss_cnt_basic          (0x4)                           
#define mask_cach_reset_statistic_info_reset_access_cnt_slv          (0x2)                           
#define mask_cach_reset_statistic_info_reset_access_cnt_cm3          (0x1)                           

#define reg_cach_ext_cg_en                                         (*(volatile uint32_t *)0x50009030)
#define adr_cach_ext_cg_en                                                               (0x50009030)
#define mask_cach_ext_cg_en_func_ext_cg_en                           (0x4)                           
#define mask_cach_ext_cg_en_reg_ext_cg_en                            (0x2)                           
#define mask_cach_ext_cg_en_sram_ext_cg_en                           (0x1)                           


//---------------------------------------------------
// uart0 in  domain address definition
//---------------------------------------------------

