EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_uart0_tfifo_wr_data                                    (*(volatile uint32_t *)0x60000000)
#define adr_uart0_tfifo_wr_data                                                          (0x60000000)

#define reg_uart0_rfifo_rd_data                                    (*(volatile uint32_t *)0x60000004)
#define adr_uart0_rfifo_rd_data                                                          (0x60000004)


//---------------------------------------------------
// uart0 in  domain address definition
//---------------------------------------------------

#define reg_uart0_uart_int_status                                  (*(volatile uint32_t *)0x60000008)
#define adr_uart0_uart_int_status                                                        (0x60000008)

#define reg_uart0_uart_int_mask                                    (*(volatile uint32_t *)0x6000000c)
#define adr_uart0_uart_int_mask                                                          (0x6000000c)

#define reg_uart0_uart_int_clear                                   (*(volatile uint32_t *)0x60000010)
#define adr_uart0_uart_int_clear                                                         (0x60000010)

#define reg_uart0_config                                           (*(volatile uint32_t *)0x60000014)
#define adr_uart0_config                                                                 (0x60000014)
#define mask_uart0_config_err_discard                                (0x2000000)                     
#define mask_uart0_config_rts_thld                                   (0x1f00000)                     
#define mask_uart0_config_flow_ctrl_en                               (0x80000)                       
#define mask_uart0_config_lb_snd                                     (0x40000)                       
#define mask_uart0_config_msb                                        (0x20000)                       
#define mask_uart0_config_parity_mode                                (0x1c000)                       
#define mask_uart0_config_byte_size                                  (0x3000)                        
#define mask_uart0_config_stop_bit                                   (0xc00)                         
#define mask_uart0_config_rfifo_thld                                 (0x3e0)                         
#define mask_uart0_config_tfifo_thld                                 (0x1f)                          

#define reg_uart0_config1                                          (*(volatile uint32_t *)0x60000018)
#define adr_uart0_config1                                                                (0x60000018)
#define mask_uart0_config1_to_thld                                   (0xff)                          

#define reg_uart0_divisor                                          (*(volatile uint32_t *)0x6000001c)
#define adr_uart0_divisor                                                                (0x6000001c)
#define mask_uart0_divisor_trig_intv                                 (0x3ff0000)                     
#define mask_uart0_divisor_cap_intv                                  (0xffff)                        

#define reg_uart0_rfifo_cnt                                        (*(volatile uint32_t *)0x60000020)
#define adr_uart0_rfifo_cnt                                                              (0x60000020)

#define reg_uart0_tfifo_cnt                                        (*(volatile uint32_t *)0x60000024)
#define adr_uart0_tfifo_cnt                                                              (0x60000024)

#define reg_uart0_rfifo_clr                                        (*(volatile uint32_t *)0x60000028)
#define adr_uart0_rfifo_clr                                                              (0x60000028)

#define reg_uart0_tfifo_clr                                        (*(volatile uint32_t *)0x6000002c)
#define adr_uart0_tfifo_clr                                                              (0x6000002c)

#define reg_uart0_ext_cg_en                                        (*(volatile uint32_t *)0x60000030)
#define adr_uart0_ext_cg_en                                                              (0x60000030)


//---------------------------------------------------
// uart1 in  domain address definition
//---------------------------------------------------

#define reg_uart1_tfifo_wr_data                                    (*(volatile uint32_t *)0x60000400)
#define adr_uart1_tfifo_wr_data                                                          (0x60000400)

#define reg_uart1_rfifo_rd_data                                    (*(volatile uint32_t *)0x60000404)
#define adr_uart1_rfifo_rd_data                                                          (0x60000404)


//---------------------------------------------------
// uart1 in  domain address definition
//---------------------------------------------------

#define reg_uart1_uart_int_status                                  (*(volatile uint32_t *)0x60000408)
#define adr_uart1_uart_int_status                                                        (0x60000408)

#define reg_uart1_uart_int_mask                                    (*(volatile uint32_t *)0x6000040c)
#define adr_uart1_uart_int_mask                                                          (0x6000040c)

#define reg_uart1_uart_int_clear                                   (*(volatile uint32_t *)0x60000410)
#define adr_uart1_uart_int_clear                                                         (0x60000410)

#define reg_uart1_config                                           (*(volatile uint32_t *)0x60000414)
#define adr_uart1_config                                                                 (0x60000414)
#define mask_uart1_config_err_discard                                (0x2000000)                     
#define mask_uart1_config_rts_thld                                   (0x1f00000)                     
#define mask_uart1_config_flow_ctrl_en                               (0x80000)                       
#define mask_uart1_config_lb_snd                                     (0x40000)                       
#define mask_uart1_config_msb                                        (0x20000)                       
#define mask_uart1_config_parity_mode                                (0x1c000)                       
#define mask_uart1_config_byte_size                                  (0x3000)                        
#define mask_uart1_config_stop_bit                                   (0xc00)                         
#define mask_uart1_config_rfifo_thld                                 (0x3e0)                         
#define mask_uart1_config_tfifo_thld                                 (0x1f)                          

#define reg_uart1_config1                                          (*(volatile uint32_t *)0x60000418)
#define adr_uart1_config1                                                                (0x60000418)
#define mask_uart1_config1_to_thld                                   (0xff)                          

#define reg_uart1_divisor                                          (*(volatile uint32_t *)0x6000041c)
#define adr_uart1_divisor                                                                (0x6000041c)
#define mask_uart1_divisor_trig_intv                                 (0x3ff0000)                     
#define mask_uart1_divisor_cap_intv                                  (0xffff)                        

#define reg_uart1_rfifo_cnt                                        (*(volatile uint32_t *)0x60000420)
#define adr_uart1_rfifo_cnt                                                              (0x60000420)

#define reg_uart1_tfifo_cnt                                        (*(volatile uint32_t *)0x60000424)
#define adr_uart1_tfifo_cnt                                                              (0x60000424)

#define reg_uart1_rfifo_clr                                        (*(volatile uint32_t *)0x60000428)
#define adr_uart1_rfifo_clr                                                              (0x60000428)

