EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_uart1_tfifo_clr                                        (*(volatile uint32_t *)0x6000042c)
#define adr_uart1_tfifo_clr                                                              (0x6000042c)

#define reg_uart1_ext_cg_en                                        (*(volatile uint32_t *)0x60000430)
#define adr_uart1_ext_cg_en                                                              (0x60000430)


//---------------------------------------------------
// uart2 in  domain address definition
//---------------------------------------------------

#define reg_uart2_tfifo_wr_data                                    (*(volatile uint32_t *)0x60000800)
#define adr_uart2_tfifo_wr_data                                                          (0x60000800)

#define reg_uart2_rfifo_rd_data                                    (*(volatile uint32_t *)0x60000804)
#define adr_uart2_rfifo_rd_data                                                          (0x60000804)


//---------------------------------------------------
// uart2 in  domain address definition
//---------------------------------------------------

#define reg_uart2_uart_int_status                                  (*(volatile uint32_t *)0x60000808)
#define adr_uart2_uart_int_status                                                        (0x60000808)

#define reg_uart2_uart_int_mask                                    (*(volatile uint32_t *)0x6000080c)
#define adr_uart2_uart_int_mask                                                          (0x6000080c)

#define reg_uart2_uart_int_clear                                   (*(volatile uint32_t *)0x60000810)
#define adr_uart2_uart_int_clear                                                         (0x60000810)

#define reg_uart2_config                                           (*(volatile uint32_t *)0x60000814)
#define adr_uart2_config                                                                 (0x60000814)
#define mask_uart2_config_scc_en                                     (0x4000000)                     
#define mask_uart2_config_err_discard                                (0x2000000)                     
#define mask_uart2_config_rts_thld                                   (0x1f00000)                     
#define mask_uart2_config_flow_ctrl_en                               (0x80000)                       
#define mask_uart2_config_lb_snd                                     (0x40000)                       
#define mask_uart2_config_msb                                        (0x20000)                       
#define mask_uart2_config_parity_mode                                (0x1c000)                       
#define mask_uart2_config_byte_size                                  (0x3000)                        
#define mask_uart2_config_stop_bit                                   (0xc00)                         
#define mask_uart2_config_rfifo_thld                                 (0x3e0)                         
#define mask_uart2_config_tfifo_thld                                 (0x1f)                          

#define reg_uart2_config1                                          (*(volatile uint32_t *)0x60000818)
#define adr_uart2_config1                                                                (0x60000818)
#define mask_uart2_config1_to_thld                                   (0xff)                          

#define reg_uart2_divisor                                          (*(volatile uint32_t *)0x6000081c)
#define adr_uart2_divisor                                                                (0x6000081c)
#define mask_uart2_divisor_trig_intv                                 (0x3ff0000)                     
#define mask_uart2_divisor_cap_intv                                  (0xffff)                        

#define reg_uart2_rfifo_cnt                                        (*(volatile uint32_t *)0x60000820)
#define adr_uart2_rfifo_cnt                                                              (0x60000820)

#define reg_uart2_tfifo_cnt                                        (*(volatile uint32_t *)0x60000824)
#define adr_uart2_tfifo_cnt                                                              (0x60000824)

#define reg_uart2_rfifo_clr                                        (*(volatile uint32_t *)0x60000828)
#define adr_uart2_rfifo_clr                                                              (0x60000828)

#define reg_uart2_tfifo_clr                                        (*(volatile uint32_t *)0x6000082c)
#define adr_uart2_tfifo_clr                                                              (0x6000082c)

#define reg_uart2_ext_cg_en                                        (*(volatile uint32_t *)0x60000830)
#define adr_uart2_ext_cg_en                                                              (0x60000830)

#define reg_uart2_phy_config                                       (*(volatile uint32_t *)0x60000834)
#define adr_uart2_phy_config                                                             (0x60000834)
#define mask_uart2_phy_config_start_frame                            (0xff0)                         
#define mask_uart2_phy_config_txd_byte_wait_time                     (0xf)                           

#define reg_uart2_scc_basic_config                                 (*(volatile uint32_t *)0x60000838)
#define adr_uart2_scc_basic_config                                                       (0x60000838)
#define mask_uart2_scc_basic_config_rst_vld_time                     (0xfff00000)                    
#define mask_uart2_scc_basic_config_tx_byte_intvl                    (0xfffc0)                       
#define mask_uart2_scc_basic_config_clk_rate                         (0x38)                          
#define mask_uart2_scc_basic_config_mode                             (0x7)                           

#define reg_uart2_mode_trig                                        (*(volatile uint32_t *)0x6000083c)
#define adr_uart2_mode_trig                                                              (0x6000083c)


//---------------------------------------------------
// spi0 in  domain address definition
//---------------------------------------------------

