EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_spi0_tfifo_wr_data                                     (*(volatile uint32_t *)0x60001000)
#define adr_spi0_tfifo_wr_data                                                           (0x60001000)

#define reg_spi0_rfifo_rd_data                                     (*(volatile uint32_t *)0x60001004)
#define adr_spi0_rfifo_rd_data                                                           (0x60001004)


//---------------------------------------------------
// spi0 in  domain address definition
//---------------------------------------------------

#define reg_spi0_spi_int_status                                    (*(volatile uint32_t *)0x60001008)
#define adr_spi0_spi_int_status                                                          (0x60001008)

#define reg_spi0_spi_int_mask                                      (*(volatile uint32_t *)0x6000100c)
#define adr_spi0_spi_int_mask                                                            (0x6000100c)

#define reg_spi0_spi_int_clear                                     (*(volatile uint32_t *)0x60001010)
#define adr_spi0_spi_int_clear                                                           (0x60001010)

#define reg_spi0_config1                                           (*(volatile uint32_t *)0x60001014)
#define adr_spi0_config1                                                                 (0x60001014)
#define mask_spi0_config1_cs_host_mode                               (0x40000)                       
#define mask_spi0_config1_cs_host_ctrl                               (0x20000)                       
#define mask_spi0_config1_byte_wait_en                               (0x10000)                       
#define mask_spi0_config1_size                                       (0xc000)                        
#define mask_spi0_config1_trx_mode                                   (0x3000)                        
#define mask_spi0_config1_to_thld                                    (0xff0)                         
#define mask_spi0_config1_master                                     (0x8)                           
#define mask_spi0_config1_cpol                                       (0x4)                           
#define mask_spi0_config1_cpha                                       (0x2)                           
#define mask_spi0_config1_en                                         (0x1)                           

#define reg_spi0_config2                                           (*(volatile uint32_t *)0x60001018)
#define adr_spi0_config2                                                                 (0x60001018)
#define mask_spi0_config2_len                                        (0xff)                          

#define reg_spi0_divisor                                           (*(volatile uint32_t *)0x6000101c)
#define adr_spi0_divisor                                                                 (0x6000101c)
#define mask_spi0_divisor_psdvsr                                     (0xff)                          

#define reg_spi0_rfifo_thld                                        (*(volatile uint32_t *)0x60001020)
#define adr_spi0_rfifo_thld                                                              (0x60001020)

#define reg_spi0_tfifo_thld                                        (*(volatile uint32_t *)0x60001024)
#define adr_spi0_tfifo_thld                                                              (0x60001024)

#define reg_spi0_rfifo_cnt                                         (*(volatile uint32_t *)0x60001028)
#define adr_spi0_rfifo_cnt                                                               (0x60001028)

#define reg_spi0_tfifo_cnt                                         (*(volatile uint32_t *)0x6000102c)
#define adr_spi0_tfifo_cnt                                                               (0x6000102c)

#define reg_spi0_tfifo_idle_config                                 (*(volatile uint32_t *)0x60001030)
#define adr_spi0_tfifo_idle_config                                                       (0x60001030)
#define mask_spi0_tfifo_idle_config_tfifo_idle_mode                  (0x100)                         
#define mask_spi0_tfifo_idle_config_tfifo_idle_data                  (0xff)                          

#define reg_spi0_master_read_length                                (*(volatile uint32_t *)0x60001034)
#define adr_spi0_master_read_length                                                      (0x60001034)
#define mask_spi0_master_read_length_mread_length_en                 (0x100)                         
#define mask_spi0_master_read_length_mread_length_cmd                (0xff)                          

#define reg_spi0_rfifo_clr                                         (*(volatile uint32_t *)0x60001038)
#define adr_spi0_rfifo_clr                                                               (0x60001038)

#define reg_spi0_tfifo_clr                                         (*(volatile uint32_t *)0x6000103c)
#define adr_spi0_tfifo_clr                                                               (0x6000103c)

#define reg_spi0_ext_cg_en                                         (*(volatile uint32_t *)0x60001040)
#define adr_spi0_ext_cg_en                                                               (0x60001040)


//---------------------------------------------------
// spi1 in  domain address definition
//---------------------------------------------------

#define reg_spi1_tfifo_wr_data                                     (*(volatile uint32_t *)0x60002000)
#define adr_spi1_tfifo_wr_data                                                           (0x60002000)

#define reg_spi1_rfifo_rd_data                                     (*(volatile uint32_t *)0x60002004)
#define adr_spi1_rfifo_rd_data                                                           (0x60002004)


//---------------------------------------------------
// spi1 in  domain address definition
//---------------------------------------------------

#define reg_spi1_spi_int_status                                    (*(volatile uint32_t *)0x60002008)
#define adr_spi1_spi_int_status                                                          (0x60002008)

#define reg_spi1_spi_int_mask                                      (*(volatile uint32_t *)0x6000200c)
#define adr_spi1_spi_int_mask                                                            (0x6000200c)

#define reg_spi1_spi_int_clear                                     (*(volatile uint32_t *)0x60002010)
#define adr_spi1_spi_int_clear                                                           (0x60002010)

#define reg_spi1_config1                                           (*(volatile uint32_t *)0x60002014)
#define adr_spi1_config1                                                                 (0x60002014)
#define mask_spi1_config1_cs_host_mode                               (0x40000)                       
#define mask_spi1_config1_cs_host_ctrl                               (0x20000)                       
#define mask_spi1_config1_byte_wait_en                               (0x10000)                       
#define mask_spi1_config1_size                                       (0xc000)                        
#define mask_spi1_config1_trx_mode                                   (0x3000)                        
#define mask_spi1_config1_to_thld                                    (0xff0)                         
#define mask_spi1_config1_master                                     (0x8)                           
#define mask_spi1_config1_cpol                                       (0x4)                           
#define mask_spi1_config1_cpha                                       (0x2)                           
#define mask_spi1_config1_en                                         (0x1)                           

