EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_spi1_config2                                           (*(volatile uint32_t *)0x60002018)
#define adr_spi1_config2                                                                 (0x60002018)
#define mask_spi1_config2_len                                        (0xff)                          

#define reg_spi1_divisor                                           (*(volatile uint32_t *)0x6000201c)
#define adr_spi1_divisor                                                                 (0x6000201c)
#define mask_spi1_divisor_psdvsr                                     (0xff)                          

#define reg_spi1_rfifo_thld                                        (*(volatile uint32_t *)0x60002020)
#define adr_spi1_rfifo_thld                                                              (0x60002020)

#define reg_spi1_tfifo_thld                                        (*(volatile uint32_t *)0x60002024)
#define adr_spi1_tfifo_thld                                                              (0x60002024)

#define reg_spi1_rfifo_cnt                                         (*(volatile uint32_t *)0x60002028)
#define adr_spi1_rfifo_cnt                                                               (0x60002028)

#define reg_spi1_tfifo_cnt                                         (*(volatile uint32_t *)0x6000202c)
#define adr_spi1_tfifo_cnt                                                               (0x6000202c)

#define reg_spi1_tfifo_idle_config                                 (*(volatile uint32_t *)0x60002030)
#define adr_spi1_tfifo_idle_config                                                       (0x60002030)
#define mask_spi1_tfifo_idle_config_tfifo_idle_mode                  (0x100)                         
#define mask_spi1_tfifo_idle_config_tfifo_idle_data                  (0xff)                          

#define reg_spi1_master_read_length                                (*(volatile uint32_t *)0x60002034)
#define adr_spi1_master_read_length                                                      (0x60002034)
#define mask_spi1_master_read_length_mread_length_en                 (0x100)                         
#define mask_spi1_master_read_length_mread_length_cmd                (0xff)                          

#define reg_spi1_rfifo_clr                                         (*(volatile uint32_t *)0x60002038)
#define adr_spi1_rfifo_clr                                                               (0x60002038)

#define reg_spi1_tfifo_clr                                         (*(volatile uint32_t *)0x6000203c)
#define adr_spi1_tfifo_clr                                                               (0x6000203c)

#define reg_spi1_ext_cg_en                                         (*(volatile uint32_t *)0x60002040)
#define adr_spi1_ext_cg_en                                                               (0x60002040)


//---------------------------------------------------
// i2c0 in  domain address definition
//---------------------------------------------------

#define reg_i2c0_tfifo_wr_data                                     (*(volatile uint32_t *)0x60003000)
#define adr_i2c0_tfifo_wr_data                                                           (0x60003000)

#define reg_i2c0_rfifo_rd_data                                     (*(volatile uint32_t *)0x60003004)
#define adr_i2c0_rfifo_rd_data                                                           (0x60003004)


//---------------------------------------------------
// i2c0 in  domain address definition
//---------------------------------------------------

#define reg_i2c0_int_status                                        (*(volatile uint32_t *)0x60003008)
#define adr_i2c0_int_status                                                              (0x60003008)

#define reg_i2c0_int_mask                                          (*(volatile uint32_t *)0x6000300c)
#define adr_i2c0_int_mask                                                                (0x6000300c)

#define reg_i2c0_int_clr                                           (*(volatile uint32_t *)0x60003010)
#define adr_i2c0_int_clr                                                                 (0x60003010)

#define reg_i2c0_rfifo_thld                                        (*(volatile uint32_t *)0x60003014)
#define adr_i2c0_rfifo_thld                                                              (0x60003014)

#define reg_i2c0_tfifo_thld                                        (*(volatile uint32_t *)0x60003018)
#define adr_i2c0_tfifo_thld                                                              (0x60003018)

#define reg_i2c0_to_thld                                           (*(volatile uint32_t *)0x6000301c)
#define adr_i2c0_to_thld                                                                 (0x6000301c)

#define reg_i2c0_tfifo_idle_data                                   (*(volatile uint32_t *)0x60003020)
#define adr_i2c0_tfifo_idle_data                                                         (0x60003020)

#define reg_i2c0_i2cm_cfg                                          (*(volatile uint32_t *)0x60003024)
#define adr_i2c0_i2cm_cfg                                                                (0x60003024)
#define mask_i2c0_i2cm_cfg_i2cm_ctr                                  (0x1f0000)                      
#define mask_i2c0_i2cm_cfg_i2cm_prer                                 (0xffff)                        

#define reg_i2c0_i2cms_add                                         (*(volatile uint32_t *)0x60003028)
#define adr_i2c0_i2cms_add                                                               (0x60003028)

#define reg_i2c0_i2cs_cfg                                          (*(volatile uint32_t *)0x6000302c)
#define adr_i2c0_i2cs_cfg                                                                (0x6000302c)
#define mask_i2c0_i2cs_cfg_master                                    (0x8)                           
#define mask_i2c0_i2cs_cfg_slv_stretch_en                            (0x4)                           
#define mask_i2c0_i2cs_cfg_i2cs_10bitaddr                            (0x2)                           
#define mask_i2c0_i2cs_cfg_slv_en                                    (0x1)                           

#define reg_i2c0_slave_status                                      (*(volatile uint32_t *)0x60003030)
#define adr_i2c0_slave_status                                                            (0x60003030)
#define mask_i2c0_slave_status_i2cs_rd_op                            (0x400)                         
#define mask_i2c0_slave_status_i2cs_wr_op                            (0x200)                         
#define mask_i2c0_slave_status_i2cs_busy                             (0x100)                         
#define mask_i2c0_slave_status_i2cs_state                            (0xff)                          

#define reg_i2c0_rfifo_cnt                                         (*(volatile uint32_t *)0x60003034)
#define adr_i2c0_rfifo_cnt                                                               (0x60003034)

#define reg_i2c0_tfifo_cnt                                         (*(volatile uint32_t *)0x60003038)
#define adr_i2c0_tfifo_cnt                                                               (0x60003038)

#define reg_i2c0_status                                            (*(volatile uint32_t *)0x6000303c)
#define adr_i2c0_status                                                                  (0x6000303c)
#define mask_i2c0_status_i2cm_sr                                     (0xffff)                        

#define reg_i2c0_rfifo_clr                                         (*(volatile uint32_t *)0x60003040)
#define adr_i2c0_rfifo_clr                                                               (0x60003040)

