EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_i2c0_tfifo_clr                                         (*(volatile uint32_t *)0x60003044)
#define adr_i2c0_tfifo_clr                                                               (0x60003044)

#define reg_i2c0_i2cm_trig_cmd                                     (*(volatile uint32_t *)0x60003048)
#define adr_i2c0_i2cm_trig_cmd                                                           (0x60003048)
#define mask_i2c0_i2cm_trig_cmd_clr                                  (0x20)                          
#define mask_i2c0_i2cm_trig_cmd_restart                              (0x10)                          
#define mask_i2c0_i2cm_trig_cmd_nack                                 (0x8)                           
#define mask_i2c0_i2cm_trig_cmd_ack                                  (0x4)                           
#define mask_i2c0_i2cm_trig_cmd_stop                                 (0x2)                           
#define mask_i2c0_i2cm_trig_cmd_start                                (0x1)                           

#define reg_i2c0_i2cs_trig_cmd                                     (*(volatile uint32_t *)0x6000304c)
#define adr_i2c0_i2cs_trig_cmd                                                           (0x6000304c)
#define mask_i2c0_i2cs_trig_cmd_slv_clr                              (0x8)                           
#define mask_i2c0_i2cs_trig_cmd_slv_idle                             (0x4)                           
#define mask_i2c0_i2cs_trig_cmd_slv_ack                              (0x2)                           
#define mask_i2c0_i2cs_trig_cmd_slv_nack                             (0x1)                           

#define reg_i2c0_rfifo_full_val                                    (*(volatile uint32_t *)0x60003050)
#define adr_i2c0_rfifo_full_val                                                          (0x60003050)

#define reg_i2c0_ext_cg_en                                         (*(volatile uint32_t *)0x60003054)
#define adr_i2c0_ext_cg_en                                                               (0x60003054)


//---------------------------------------------------
// i2c1 in  domain address definition
//---------------------------------------------------

#define reg_i2c1_tfifo_wr_data                                     (*(volatile uint32_t *)0x60003400)
#define adr_i2c1_tfifo_wr_data                                                           (0x60003400)

#define reg_i2c1_rfifo_rd_data                                     (*(volatile uint32_t *)0x60003404)
#define adr_i2c1_rfifo_rd_data                                                           (0x60003404)


//---------------------------------------------------
// i2c1 in  domain address definition
//---------------------------------------------------

#define reg_i2c1_int_status                                        (*(volatile uint32_t *)0x60003408)
#define adr_i2c1_int_status                                                              (0x60003408)

#define reg_i2c1_int_mask                                          (*(volatile uint32_t *)0x6000340c)
#define adr_i2c1_int_mask                                                                (0x6000340c)

#define reg_i2c1_int_clr                                           (*(volatile uint32_t *)0x60003410)
#define adr_i2c1_int_clr                                                                 (0x60003410)

#define reg_i2c1_rfifo_thld                                        (*(volatile uint32_t *)0x60003414)
#define adr_i2c1_rfifo_thld                                                              (0x60003414)

#define reg_i2c1_tfifo_thld                                        (*(volatile uint32_t *)0x60003418)
#define adr_i2c1_tfifo_thld                                                              (0x60003418)

#define reg_i2c1_to_thld                                           (*(volatile uint32_t *)0x6000341c)
#define adr_i2c1_to_thld                                                                 (0x6000341c)

#define reg_i2c1_tfifo_idle_data                                   (*(volatile uint32_t *)0x60003420)
#define adr_i2c1_tfifo_idle_data                                                         (0x60003420)

#define reg_i2c1_i2cm_cfg                                          (*(volatile uint32_t *)0x60003424)
#define adr_i2c1_i2cm_cfg                                                                (0x60003424)
#define mask_i2c1_i2cm_cfg_i2cm_ctr                                  (0x1f0000)                      
#define mask_i2c1_i2cm_cfg_i2cm_prer                                 (0xffff)                        

#define reg_i2c1_i2cms_add                                         (*(volatile uint32_t *)0x60003428)
#define adr_i2c1_i2cms_add                                                               (0x60003428)

#define reg_i2c1_i2cs_cfg                                          (*(volatile uint32_t *)0x6000342c)
#define adr_i2c1_i2cs_cfg                                                                (0x6000342c)
#define mask_i2c1_i2cs_cfg_master                                    (0x8)                           
#define mask_i2c1_i2cs_cfg_slv_stretch_en                            (0x4)                           
#define mask_i2c1_i2cs_cfg_i2cs_10bitaddr                            (0x2)                           
#define mask_i2c1_i2cs_cfg_slv_en                                    (0x1)                           

#define reg_i2c1_slave_status                                      (*(volatile uint32_t *)0x60003430)
#define adr_i2c1_slave_status                                                            (0x60003430)
#define mask_i2c1_slave_status_i2cs_rd_op                            (0x400)                         
#define mask_i2c1_slave_status_i2cs_wr_op                            (0x200)                         
#define mask_i2c1_slave_status_i2cs_busy                             (0x100)                         
#define mask_i2c1_slave_status_i2cs_state                            (0xff)                          

