EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_i2c1_rfifo_cnt                                         (*(volatile uint32_t *)0x60003434)
#define adr_i2c1_rfifo_cnt                                                               (0x60003434)

#define reg_i2c1_tfifo_cnt                                         (*(volatile uint32_t *)0x60003438)
#define adr_i2c1_tfifo_cnt                                                               (0x60003438)

#define reg_i2c1_status                                            (*(volatile uint32_t *)0x6000343c)
#define adr_i2c1_status                                                                  (0x6000343c)
#define mask_i2c1_status_i2cm_sr                                     (0xffff)                        

#define reg_i2c1_rfifo_clr                                         (*(volatile uint32_t *)0x60003440)
#define adr_i2c1_rfifo_clr                                                               (0x60003440)

#define reg_i2c1_tfifo_clr                                         (*(volatile uint32_t *)0x60003444)
#define adr_i2c1_tfifo_clr                                                               (0x60003444)

#define reg_i2c1_i2cm_trig_cmd                                     (*(volatile uint32_t *)0x60003448)
#define adr_i2c1_i2cm_trig_cmd                                                           (0x60003448)
#define mask_i2c1_i2cm_trig_cmd_clr                                  (0x20)                          
#define mask_i2c1_i2cm_trig_cmd_restart                              (0x10)                          
#define mask_i2c1_i2cm_trig_cmd_nack                                 (0x8)                           
#define mask_i2c1_i2cm_trig_cmd_ack                                  (0x4)                           
#define mask_i2c1_i2cm_trig_cmd_stop                                 (0x2)                           
#define mask_i2c1_i2cm_trig_cmd_start                                (0x1)                           

#define reg_i2c1_i2cs_trig_cmd                                     (*(volatile uint32_t *)0x6000344c)
#define adr_i2c1_i2cs_trig_cmd                                                           (0x6000344c)
#define mask_i2c1_i2cs_trig_cmd_slv_clr                              (0x8)                           
#define mask_i2c1_i2cs_trig_cmd_slv_idle                             (0x4)                           
#define mask_i2c1_i2cs_trig_cmd_slv_ack                              (0x2)                           
#define mask_i2c1_i2cs_trig_cmd_slv_nack                             (0x1)                           

#define reg_i2c1_rfifo_full_val                                    (*(volatile uint32_t *)0x60003450)
#define adr_i2c1_rfifo_full_val                                                          (0x60003450)

#define reg_i2c1_ext_cg_en                                         (*(volatile uint32_t *)0x60003454)
#define adr_i2c1_ext_cg_en                                                               (0x60003454)


//---------------------------------------------------
// i2c2 in  domain address definition
//---------------------------------------------------

#define reg_i2c2_tfifo_wr_data                                     (*(volatile uint32_t *)0x60003800)
#define adr_i2c2_tfifo_wr_data                                                           (0x60003800)

#define reg_i2c2_rfifo_rd_data                                     (*(volatile uint32_t *)0x60003804)
#define adr_i2c2_rfifo_rd_data                                                           (0x60003804)


//---------------------------------------------------
// i2c2 in  domain address definition
//---------------------------------------------------

#define reg_i2c2_int_status                                        (*(volatile uint32_t *)0x60003808)
#define adr_i2c2_int_status                                                              (0x60003808)

#define reg_i2c2_int_mask                                          (*(volatile uint32_t *)0x6000380c)
#define adr_i2c2_int_mask                                                                (0x6000380c)

#define reg_i2c2_int_clr                                           (*(volatile uint32_t *)0x60003810)
#define adr_i2c2_int_clr                                                                 (0x60003810)

#define reg_i2c2_rfifo_thld                                        (*(volatile uint32_t *)0x60003814)
#define adr_i2c2_rfifo_thld                                                              (0x60003814)

#define reg_i2c2_tfifo_thld                                        (*(volatile uint32_t *)0x60003818)
#define adr_i2c2_tfifo_thld                                                              (0x60003818)

#define reg_i2c2_to_thld                                           (*(volatile uint32_t *)0x6000381c)
#define adr_i2c2_to_thld                                                                 (0x6000381c)

#define reg_i2c2_tfifo_idle_data                                   (*(volatile uint32_t *)0x60003820)
#define adr_i2c2_tfifo_idle_data                                                         (0x60003820)

#define reg_i2c2_i2cm_cfg                                          (*(volatile uint32_t *)0x60003824)
#define adr_i2c2_i2cm_cfg                                                                (0x60003824)
#define mask_i2c2_i2cm_cfg_i2cm_ctr                                  (0x1f0000)                      
#define mask_i2c2_i2cm_cfg_i2cm_prer                                 (0xffff)                        

#define reg_i2c2_i2cms_add                                         (*(volatile uint32_t *)0x60003828)
#define adr_i2c2_i2cms_add                                                               (0x60003828)

#define reg_i2c2_i2cs_cfg                                          (*(volatile uint32_t *)0x6000382c)
#define adr_i2c2_i2cs_cfg                                                                (0x6000382c)
#define mask_i2c2_i2cs_cfg_master                                    (0x8)                           
#define mask_i2c2_i2cs_cfg_slv_stretch_en                            (0x4)                           
#define mask_i2c2_i2cs_cfg_i2cs_10bitaddr                            (0x2)                           
#define mask_i2c2_i2cs_cfg_slv_en                                    (0x1)                           

