EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_i2c2_slave_status                                      (*(volatile uint32_t *)0x60003830)
#define adr_i2c2_slave_status                                                            (0x60003830)
#define mask_i2c2_slave_status_i2cs_rd_op                            (0x400)                         
#define mask_i2c2_slave_status_i2cs_wr_op                            (0x200)                         
#define mask_i2c2_slave_status_i2cs_busy                             (0x100)                         
#define mask_i2c2_slave_status_i2cs_state                            (0xff)                          

#define reg_i2c2_rfifo_cnt                                         (*(volatile uint32_t *)0x60003834)
#define adr_i2c2_rfifo_cnt                                                               (0x60003834)

#define reg_i2c2_tfifo_cnt                                         (*(volatile uint32_t *)0x60003838)
#define adr_i2c2_tfifo_cnt                                                               (0x60003838)

#define reg_i2c2_status                                            (*(volatile uint32_t *)0x6000383c)
#define adr_i2c2_status                                                                  (0x6000383c)
#define mask_i2c2_status_i2cm_sr                                     (0xffff)                        

#define reg_i2c2_rfifo_clr                                         (*(volatile uint32_t *)0x60003840)
#define adr_i2c2_rfifo_clr                                                               (0x60003840)

#define reg_i2c2_tfifo_clr                                         (*(volatile uint32_t *)0x60003844)
#define adr_i2c2_tfifo_clr                                                               (0x60003844)

#define reg_i2c2_i2cm_trig_cmd                                     (*(volatile uint32_t *)0x60003848)
#define adr_i2c2_i2cm_trig_cmd                                                           (0x60003848)
#define mask_i2c2_i2cm_trig_cmd_clr                                  (0x20)                          
#define mask_i2c2_i2cm_trig_cmd_restart                              (0x10)                          
#define mask_i2c2_i2cm_trig_cmd_nack                                 (0x8)                           
#define mask_i2c2_i2cm_trig_cmd_ack                                  (0x4)                           
#define mask_i2c2_i2cm_trig_cmd_stop                                 (0x2)                           
#define mask_i2c2_i2cm_trig_cmd_start                                (0x1)                           

#define reg_i2c2_i2cs_trig_cmd                                     (*(volatile uint32_t *)0x6000384c)
#define adr_i2c2_i2cs_trig_cmd                                                           (0x6000384c)
#define mask_i2c2_i2cs_trig_cmd_slv_clr                              (0x8)                           
#define mask_i2c2_i2cs_trig_cmd_slv_idle                             (0x4)                           
#define mask_i2c2_i2cs_trig_cmd_slv_ack                              (0x2)                           
#define mask_i2c2_i2cs_trig_cmd_slv_nack                             (0x1)                           

#define reg_i2c2_rfifo_full_val                                    (*(volatile uint32_t *)0x60003850)
#define adr_i2c2_rfifo_full_val                                                          (0x60003850)

#define reg_i2c2_ext_cg_en                                         (*(volatile uint32_t *)0x60003854)
#define adr_i2c2_ext_cg_en                                                               (0x60003854)


//---------------------------------------------------
// i2c3 in  domain address definition
//---------------------------------------------------

#define reg_i2c3_tfifo_wr_data                                     (*(volatile uint32_t *)0x60003c00)
#define adr_i2c3_tfifo_wr_data                                                           (0x60003c00)

#define reg_i2c3_rfifo_rd_data                                     (*(volatile uint32_t *)0x60003c04)
#define adr_i2c3_rfifo_rd_data                                                           (0x60003c04)


//---------------------------------------------------
// i2c3 in  domain address definition
//---------------------------------------------------

#define reg_i2c3_int_status                                        (*(volatile uint32_t *)0x60003c08)
#define adr_i2c3_int_status                                                              (0x60003c08)

#define reg_i2c3_int_mask                                          (*(volatile uint32_t *)0x60003c0c)
#define adr_i2c3_int_mask                                                                (0x60003c0c)

#define reg_i2c3_int_clr                                           (*(volatile uint32_t *)0x60003c10)
#define adr_i2c3_int_clr                                                                 (0x60003c10)

#define reg_i2c3_rfifo_thld                                        (*(volatile uint32_t *)0x60003c14)
#define adr_i2c3_rfifo_thld                                                              (0x60003c14)

#define reg_i2c3_tfifo_thld                                        (*(volatile uint32_t *)0x60003c18)
#define adr_i2c3_tfifo_thld                                                              (0x60003c18)

#define reg_i2c3_to_thld                                           (*(volatile uint32_t *)0x60003c1c)
#define adr_i2c3_to_thld                                                                 (0x60003c1c)

#define reg_i2c3_tfifo_idle_data                                   (*(volatile uint32_t *)0x60003c20)
#define adr_i2c3_tfifo_idle_data                                                         (0x60003c20)

#define reg_i2c3_i2cm_cfg                                          (*(volatile uint32_t *)0x60003c24)
#define adr_i2c3_i2cm_cfg                                                                (0x60003c24)
#define mask_i2c3_i2cm_cfg_i2cm_ctr                                  (0x1f0000)                      
#define mask_i2c3_i2cm_cfg_i2cm_prer                                 (0xffff)                        

#define reg_i2c3_i2cms_add                                         (*(volatile uint32_t *)0x60003c28)
#define adr_i2c3_i2cms_add                                                               (0x60003c28)

#define reg_i2c3_i2cs_cfg                                          (*(volatile uint32_t *)0x60003c2c)
#define adr_i2c3_i2cs_cfg                                                                (0x60003c2c)
#define mask_i2c3_i2cs_cfg_master                                    (0x8)                           
#define mask_i2c3_i2cs_cfg_slv_stretch_en                            (0x4)                           
#define mask_i2c3_i2cs_cfg_i2cs_10bitaddr                            (0x2)                           
#define mask_i2c3_i2cs_cfg_slv_en                                    (0x1)                           

#define reg_i2c3_slave_status                                      (*(volatile uint32_t *)0x60003c30)
#define adr_i2c3_slave_status                                                            (0x60003c30)
#define mask_i2c3_slave_status_i2cs_rd_op                            (0x400)                         
#define mask_i2c3_slave_status_i2cs_wr_op                            (0x200)                         
#define mask_i2c3_slave_status_i2cs_busy                             (0x100)                         
#define mask_i2c3_slave_status_i2cs_state                            (0xff)                          

#define reg_i2c3_rfifo_cnt                                         (*(volatile uint32_t *)0x60003c34)
#define adr_i2c3_rfifo_cnt                                                               (0x60003c34)

#define reg_i2c3_tfifo_cnt                                         (*(volatile uint32_t *)0x60003c38)
#define adr_i2c3_tfifo_cnt                                                               (0x60003c38)

#define reg_i2c3_status                                            (*(volatile uint32_t *)0x60003c3c)
#define adr_i2c3_status                                                                  (0x60003c3c)
#define mask_i2c3_status_i2cm_sr                                     (0xffff)                        

