EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_i2c3_rfifo_clr                                         (*(volatile uint32_t *)0x60003c40)
#define adr_i2c3_rfifo_clr                                                               (0x60003c40)

#define reg_i2c3_tfifo_clr                                         (*(volatile uint32_t *)0x60003c44)
#define adr_i2c3_tfifo_clr                                                               (0x60003c44)

#define reg_i2c3_i2cm_trig_cmd                                     (*(volatile uint32_t *)0x60003c48)
#define adr_i2c3_i2cm_trig_cmd                                                           (0x60003c48)
#define mask_i2c3_i2cm_trig_cmd_clr                                  (0x20)                          
#define mask_i2c3_i2cm_trig_cmd_restart                              (0x10)                          
#define mask_i2c3_i2cm_trig_cmd_nack                                 (0x8)                           
#define mask_i2c3_i2cm_trig_cmd_ack                                  (0x4)                           
#define mask_i2c3_i2cm_trig_cmd_stop                                 (0x2)                           
#define mask_i2c3_i2cm_trig_cmd_start                                (0x1)                           

#define reg_i2c3_i2cs_trig_cmd                                     (*(volatile uint32_t *)0x60003c4c)
#define adr_i2c3_i2cs_trig_cmd                                                           (0x60003c4c)
#define mask_i2c3_i2cs_trig_cmd_slv_clr                              (0x8)                           
#define mask_i2c3_i2cs_trig_cmd_slv_idle                             (0x4)                           
#define mask_i2c3_i2cs_trig_cmd_slv_ack                              (0x2)                           
#define mask_i2c3_i2cs_trig_cmd_slv_nack                             (0x1)                           

#define reg_i2c3_rfifo_full_val                                    (*(volatile uint32_t *)0x60003c50)
#define adr_i2c3_rfifo_full_val                                                          (0x60003c50)

#define reg_i2c3_ext_cg_en                                         (*(volatile uint32_t *)0x60003c54)
#define adr_i2c3_ext_cg_en                                                               (0x60003c54)


//---------------------------------------------------
// gpio_ret_pd in  domain address definition
//---------------------------------------------------

#define reg_gpio_ret_pd_p00_config                                 (*(volatile uint32_t *)0x60004000)
#define adr_gpio_ret_pd_p00_config                                                       (0x60004000)
#define mask_gpio_ret_pd_p00_config_p00_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p00_config_p00_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p00_config_p00_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p00_config_p00_pu                           (0x800)                         
#define mask_gpio_ret_pd_p00_config_p00_pd                           (0x400)                         
#define mask_gpio_ret_pd_p00_config_p00_ie                           (0x200)                         
#define mask_gpio_ret_pd_p00_config_p00_oe                           (0x100)                         
#define mask_gpio_ret_pd_p00_config_p00_pid                          (0xff)                          

#define reg_gpio_ret_pd_p01_config                                 (*(volatile uint32_t *)0x60004004)
#define adr_gpio_ret_pd_p01_config                                                       (0x60004004)
#define mask_gpio_ret_pd_p01_config_p01_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p01_config_p01_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p01_config_p01_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p01_config_p01_pu                           (0x800)                         
#define mask_gpio_ret_pd_p01_config_p01_pd                           (0x400)                         
#define mask_gpio_ret_pd_p01_config_p01_ie                           (0x200)                         
#define mask_gpio_ret_pd_p01_config_p01_oe                           (0x100)                         
#define mask_gpio_ret_pd_p01_config_p01_pid                          (0xff)                          

#define reg_gpio_ret_pd_p02_config                                 (*(volatile uint32_t *)0x60004008)
#define adr_gpio_ret_pd_p02_config                                                       (0x60004008)
#define mask_gpio_ret_pd_p02_config_p02_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p02_config_p02_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p02_config_p02_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p02_config_p02_pu                           (0x800)                         
#define mask_gpio_ret_pd_p02_config_p02_pd                           (0x400)                         
#define mask_gpio_ret_pd_p02_config_p02_ie                           (0x200)                         
#define mask_gpio_ret_pd_p02_config_p02_oe                           (0x100)                         
#define mask_gpio_ret_pd_p02_config_p02_pid                          (0xff)                          

#define reg_gpio_ret_pd_p03_config                                 (*(volatile uint32_t *)0x6000400c)
#define adr_gpio_ret_pd_p03_config                                                       (0x6000400c)
#define mask_gpio_ret_pd_p03_config_p03_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p03_config_p03_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p03_config_p03_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p03_config_p03_pu                           (0x800)                         
#define mask_gpio_ret_pd_p03_config_p03_pd                           (0x400)                         
#define mask_gpio_ret_pd_p03_config_p03_ie                           (0x200)                         
#define mask_gpio_ret_pd_p03_config_p03_oe                           (0x100)                         
#define mask_gpio_ret_pd_p03_config_p03_pid                          (0xff)                          

#define reg_gpio_ret_pd_p04_config                                 (*(volatile uint32_t *)0x60004010)
#define adr_gpio_ret_pd_p04_config                                                       (0x60004010)
#define mask_gpio_ret_pd_p04_config_p04_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p04_config_p04_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p04_config_p04_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p04_config_p04_pu                           (0x800)                         
#define mask_gpio_ret_pd_p04_config_p04_pd                           (0x400)                         
#define mask_gpio_ret_pd_p04_config_p04_ie                           (0x200)                         
#define mask_gpio_ret_pd_p04_config_p04_oe                           (0x100)                         
#define mask_gpio_ret_pd_p04_config_p04_pid                          (0xff)                          

