EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio_ret_pd_p05_config                                 (*(volatile uint32_t *)0x60004014)
#define adr_gpio_ret_pd_p05_config                                                       (0x60004014)
#define mask_gpio_ret_pd_p05_config_p05_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p05_config_p05_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p05_config_p05_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p05_config_p05_pu                           (0x800)                         
#define mask_gpio_ret_pd_p05_config_p05_pd                           (0x400)                         
#define mask_gpio_ret_pd_p05_config_p05_ie                           (0x200)                         
#define mask_gpio_ret_pd_p05_config_p05_oe                           (0x100)                         
#define mask_gpio_ret_pd_p05_config_p05_pid                          (0xff)                          

#define reg_gpio_ret_pd_p06_config                                 (*(volatile uint32_t *)0x60004018)
#define adr_gpio_ret_pd_p06_config                                                       (0x60004018)
#define mask_gpio_ret_pd_p06_config_p06_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p06_config_p06_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p06_config_p06_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p06_config_p06_pu                           (0x800)                         
#define mask_gpio_ret_pd_p06_config_p06_pd                           (0x400)                         
#define mask_gpio_ret_pd_p06_config_p06_ie                           (0x200)                         
#define mask_gpio_ret_pd_p06_config_p06_oe                           (0x100)                         
#define mask_gpio_ret_pd_p06_config_p06_pid                          (0xff)                          

#define reg_gpio_ret_pd_p07_config                                 (*(volatile uint32_t *)0x6000401c)
#define adr_gpio_ret_pd_p07_config                                                       (0x6000401c)
#define mask_gpio_ret_pd_p07_config_p07_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p07_config_p07_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p07_config_p07_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p07_config_p07_pu                           (0x800)                         
#define mask_gpio_ret_pd_p07_config_p07_pd                           (0x400)                         
#define mask_gpio_ret_pd_p07_config_p07_ie                           (0x200)                         
#define mask_gpio_ret_pd_p07_config_p07_oe                           (0x100)                         
#define mask_gpio_ret_pd_p07_config_p07_pid                          (0xff)                          

#define reg_gpio_ret_pd_p08_config                                 (*(volatile uint32_t *)0x60004020)
#define adr_gpio_ret_pd_p08_config                                                       (0x60004020)
#define mask_gpio_ret_pd_p08_config_p08_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p08_config_p08_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p08_config_p08_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p08_config_p08_pu                           (0x800)                         
#define mask_gpio_ret_pd_p08_config_p08_pd                           (0x400)                         
#define mask_gpio_ret_pd_p08_config_p08_ie                           (0x200)                         
#define mask_gpio_ret_pd_p08_config_p08_oe                           (0x100)                         
#define mask_gpio_ret_pd_p08_config_p08_pid                          (0xff)                          

#define reg_gpio_ret_pd_p09_config                                 (*(volatile uint32_t *)0x60004024)
#define adr_gpio_ret_pd_p09_config                                                       (0x60004024)
#define mask_gpio_ret_pd_p09_config_p09_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p09_config_p09_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p09_config_p09_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p09_config_p09_pu                           (0x800)                         
#define mask_gpio_ret_pd_p09_config_p09_pd                           (0x400)                         
#define mask_gpio_ret_pd_p09_config_p09_ie                           (0x200)                         
#define mask_gpio_ret_pd_p09_config_p09_oe                           (0x100)                         
#define mask_gpio_ret_pd_p09_config_p09_pid                          (0xff)                          

#define reg_gpio_ret_pd_p10_config                                 (*(volatile uint32_t *)0x60004028)
#define adr_gpio_ret_pd_p10_config                                                       (0x60004028)
#define mask_gpio_ret_pd_p10_config_p10_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p10_config_p10_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p10_config_p10_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p10_config_p10_pu                           (0x800)                         
#define mask_gpio_ret_pd_p10_config_p10_pd                           (0x400)                         
#define mask_gpio_ret_pd_p10_config_p10_ie                           (0x200)                         
#define mask_gpio_ret_pd_p10_config_p10_oe                           (0x100)                         
#define mask_gpio_ret_pd_p10_config_p10_pid                          (0xff)                          

#define reg_gpio_ret_pd_p11_config                                 (*(volatile uint32_t *)0x6000402c)
#define adr_gpio_ret_pd_p11_config                                                       (0x6000402c)
#define mask_gpio_ret_pd_p11_config_p11_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p11_config_p11_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p11_config_p11_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p11_config_p11_pu                           (0x800)                         
#define mask_gpio_ret_pd_p11_config_p11_pd                           (0x400)                         
#define mask_gpio_ret_pd_p11_config_p11_ie                           (0x200)                         
#define mask_gpio_ret_pd_p11_config_p11_oe                           (0x100)                         
#define mask_gpio_ret_pd_p11_config_p11_pid                          (0xff)                          

