EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio_ret_pd_p12_config                                 (*(volatile uint32_t *)0x60004030)
#define adr_gpio_ret_pd_p12_config                                                       (0x60004030)
#define mask_gpio_ret_pd_p12_config_p12_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p12_config_p12_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p12_config_p12_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p12_config_p12_pu                           (0x800)                         
#define mask_gpio_ret_pd_p12_config_p12_pd                           (0x400)                         
#define mask_gpio_ret_pd_p12_config_p12_ie                           (0x200)                         
#define mask_gpio_ret_pd_p12_config_p12_oe                           (0x100)                         
#define mask_gpio_ret_pd_p12_config_p12_pid                          (0xff)                          

#define reg_gpio_ret_pd_p13_config                                 (*(volatile uint32_t *)0x60004034)
#define adr_gpio_ret_pd_p13_config                                                       (0x60004034)
#define mask_gpio_ret_pd_p13_config_p13_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p13_config_p13_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p13_config_p13_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p13_config_p13_pu                           (0x800)                         
#define mask_gpio_ret_pd_p13_config_p13_pd                           (0x400)                         
#define mask_gpio_ret_pd_p13_config_p13_ie                           (0x200)                         
#define mask_gpio_ret_pd_p13_config_p13_oe                           (0x100)                         
#define mask_gpio_ret_pd_p13_config_p13_pid                          (0xff)                          

#define reg_gpio_ret_pd_p14_config                                 (*(volatile uint32_t *)0x60004038)
#define adr_gpio_ret_pd_p14_config                                                       (0x60004038)
#define mask_gpio_ret_pd_p14_config_p14_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p14_config_p14_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p14_config_p14_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p14_config_p14_pu                           (0x800)                         
#define mask_gpio_ret_pd_p14_config_p14_pd                           (0x400)                         
#define mask_gpio_ret_pd_p14_config_p14_ie                           (0x200)                         
#define mask_gpio_ret_pd_p14_config_p14_oe                           (0x100)                         
#define mask_gpio_ret_pd_p14_config_p14_pid                          (0xff)                          

#define reg_gpio_ret_pd_p15_config                                 (*(volatile uint32_t *)0x6000403c)
#define adr_gpio_ret_pd_p15_config                                                       (0x6000403c)
#define mask_gpio_ret_pd_p15_config_p15_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p15_config_p15_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p15_config_p15_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p15_config_p15_pu                           (0x800)                         
#define mask_gpio_ret_pd_p15_config_p15_pd                           (0x400)                         
#define mask_gpio_ret_pd_p15_config_p15_ie                           (0x200)                         
#define mask_gpio_ret_pd_p15_config_p15_oe                           (0x100)                         
#define mask_gpio_ret_pd_p15_config_p15_pid                          (0xff)                          

#define reg_gpio_ret_pd_p16_config                                 (*(volatile uint32_t *)0x60004040)
#define adr_gpio_ret_pd_p16_config                                                       (0x60004040)
#define mask_gpio_ret_pd_p16_config_p16_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p16_config_p16_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p16_config_p16_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p16_config_p16_pu                           (0x800)                         
#define mask_gpio_ret_pd_p16_config_p16_pd                           (0x400)                         
#define mask_gpio_ret_pd_p16_config_p16_ie                           (0x200)                         
#define mask_gpio_ret_pd_p16_config_p16_oe                           (0x100)                         
#define mask_gpio_ret_pd_p16_config_p16_pid                          (0xff)                          

#define reg_gpio_ret_pd_p17_config                                 (*(volatile uint32_t *)0x60004044)
#define adr_gpio_ret_pd_p17_config                                                       (0x60004044)
#define mask_gpio_ret_pd_p17_config_p17_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p17_config_p17_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p17_config_p17_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p17_config_p17_pu                           (0x800)                         
#define mask_gpio_ret_pd_p17_config_p17_pd                           (0x400)                         
#define mask_gpio_ret_pd_p17_config_p17_ie                           (0x200)                         
#define mask_gpio_ret_pd_p17_config_p17_oe                           (0x100)                         
#define mask_gpio_ret_pd_p17_config_p17_pid                          (0xff)                          

#define reg_gpio_ret_pd_p18_config                                 (*(volatile uint32_t *)0x60004048)
#define adr_gpio_ret_pd_p18_config                                                       (0x60004048)
#define mask_gpio_ret_pd_p18_config_p18_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p18_config_p18_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p18_config_p18_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p18_config_p18_pu                           (0x800)                         
#define mask_gpio_ret_pd_p18_config_p18_pd                           (0x400)                         
#define mask_gpio_ret_pd_p18_config_p18_ie                           (0x200)                         
#define mask_gpio_ret_pd_p18_config_p18_oe                           (0x100)                         
#define mask_gpio_ret_pd_p18_config_p18_pid                          (0xff)                          

