EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio_ret_pd_p19_config                                 (*(volatile uint32_t *)0x6000404c)
#define adr_gpio_ret_pd_p19_config                                                       (0x6000404c)
#define mask_gpio_ret_pd_p19_config_p19_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p19_config_p19_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p19_config_p19_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p19_config_p19_pu                           (0x800)                         
#define mask_gpio_ret_pd_p19_config_p19_pd                           (0x400)                         
#define mask_gpio_ret_pd_p19_config_p19_ie                           (0x200)                         
#define mask_gpio_ret_pd_p19_config_p19_oe                           (0x100)                         
#define mask_gpio_ret_pd_p19_config_p19_pid                          (0xff)                          

#define reg_gpio_ret_pd_p20_config                                 (*(volatile uint32_t *)0x60004050)
#define adr_gpio_ret_pd_p20_config                                                       (0x60004050)
#define mask_gpio_ret_pd_p20_config_p20_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p20_config_p20_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p20_config_p20_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p20_config_p20_pu                           (0x800)                         
#define mask_gpio_ret_pd_p20_config_p20_pd                           (0x400)                         
#define mask_gpio_ret_pd_p20_config_p20_ie                           (0x200)                         
#define mask_gpio_ret_pd_p20_config_p20_oe                           (0x100)                         
#define mask_gpio_ret_pd_p20_config_p20_pid                          (0xff)                          

#define reg_gpio_ret_pd_p21_config                                 (*(volatile uint32_t *)0x60004054)
#define adr_gpio_ret_pd_p21_config                                                       (0x60004054)
#define mask_gpio_ret_pd_p21_config_p21_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p21_config_p21_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p21_config_p21_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p21_config_p21_pu                           (0x800)                         
#define mask_gpio_ret_pd_p21_config_p21_pd                           (0x400)                         
#define mask_gpio_ret_pd_p21_config_p21_ie                           (0x200)                         
#define mask_gpio_ret_pd_p21_config_p21_oe                           (0x100)                         
#define mask_gpio_ret_pd_p21_config_p21_pid                          (0xff)                          

#define reg_gpio_ret_pd_p22_config                                 (*(volatile uint32_t *)0x60004058)
#define adr_gpio_ret_pd_p22_config                                                       (0x60004058)
#define mask_gpio_ret_pd_p22_config_p22_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p22_config_p22_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p22_config_p22_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p22_config_p22_pu                           (0x800)                         
#define mask_gpio_ret_pd_p22_config_p22_pd                           (0x400)                         
#define mask_gpio_ret_pd_p22_config_p22_ie                           (0x200)                         
#define mask_gpio_ret_pd_p22_config_p22_oe                           (0x100)                         
#define mask_gpio_ret_pd_p22_config_p22_pid                          (0xff)                          

#define reg_gpio_ret_pd_p23_config                                 (*(volatile uint32_t *)0x6000405c)
#define adr_gpio_ret_pd_p23_config                                                       (0x6000405c)
#define mask_gpio_ret_pd_p23_config_p23_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p23_config_p23_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p23_config_p23_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p23_config_p23_pu                           (0x800)                         
#define mask_gpio_ret_pd_p23_config_p23_pd                           (0x400)                         
#define mask_gpio_ret_pd_p23_config_p23_ie                           (0x200)                         
#define mask_gpio_ret_pd_p23_config_p23_oe                           (0x100)                         
#define mask_gpio_ret_pd_p23_config_p23_pid                          (0xff)                          

#define reg_gpio_ret_pd_p24_config                                 (*(volatile uint32_t *)0x60004060)
#define adr_gpio_ret_pd_p24_config                                                       (0x60004060)
#define mask_gpio_ret_pd_p24_config_p24_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p24_config_p24_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p24_config_p24_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p24_config_p24_pu                           (0x800)                         
#define mask_gpio_ret_pd_p24_config_p24_pd                           (0x400)                         
#define mask_gpio_ret_pd_p24_config_p24_ie                           (0x200)                         
#define mask_gpio_ret_pd_p24_config_p24_oe                           (0x100)                         
#define mask_gpio_ret_pd_p24_config_p24_pid                          (0xff)                          

