EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio_ret_pd_p25_config                                 (*(volatile uint32_t *)0x60004064)
#define adr_gpio_ret_pd_p25_config                                                       (0x60004064)
#define mask_gpio_ret_pd_p25_config_p25_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p25_config_p25_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p25_config_p25_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p25_config_p25_pu                           (0x800)                         
#define mask_gpio_ret_pd_p25_config_p25_pd                           (0x400)                         
#define mask_gpio_ret_pd_p25_config_p25_ie                           (0x200)                         
#define mask_gpio_ret_pd_p25_config_p25_oe                           (0x100)                         
#define mask_gpio_ret_pd_p25_config_p25_pid                          (0xff)                          

#define reg_gpio_ret_pd_p26_config                                 (*(volatile uint32_t *)0x60004068)
#define adr_gpio_ret_pd_p26_config                                                       (0x60004068)
#define mask_gpio_ret_pd_p26_config_p26_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p26_config_p26_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p26_config_p26_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p26_config_p26_pu                           (0x800)                         
#define mask_gpio_ret_pd_p26_config_p26_pd                           (0x400)                         
#define mask_gpio_ret_pd_p26_config_p26_ie                           (0x200)                         
#define mask_gpio_ret_pd_p26_config_p26_oe                           (0x100)                         
#define mask_gpio_ret_pd_p26_config_p26_pid                          (0xff)                          

#define reg_gpio_ret_pd_p27_config                                 (*(volatile uint32_t *)0x6000406c)
#define adr_gpio_ret_pd_p27_config                                                       (0x6000406c)
#define mask_gpio_ret_pd_p27_config_p27_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p27_config_p27_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p27_config_p27_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p27_config_p27_pu                           (0x800)                         
#define mask_gpio_ret_pd_p27_config_p27_pd                           (0x400)                         
#define mask_gpio_ret_pd_p27_config_p27_ie                           (0x200)                         
#define mask_gpio_ret_pd_p27_config_p27_oe                           (0x100)                         
#define mask_gpio_ret_pd_p27_config_p27_pid                          (0xff)                          

#define reg_gpio_ret_pd_p28_config                                 (*(volatile uint32_t *)0x60004070)
#define adr_gpio_ret_pd_p28_config                                                       (0x60004070)
#define mask_gpio_ret_pd_p28_config_p28_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p28_config_p28_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p28_config_p28_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p28_config_p28_pu                           (0x800)                         
#define mask_gpio_ret_pd_p28_config_p28_pd                           (0x400)                         
#define mask_gpio_ret_pd_p28_config_p28_ie                           (0x200)                         
#define mask_gpio_ret_pd_p28_config_p28_oe                           (0x100)                         
#define mask_gpio_ret_pd_p28_config_p28_pid                          (0xff)                          

#define reg_gpio_ret_pd_p29_config                                 (*(volatile uint32_t *)0x60004074)
#define adr_gpio_ret_pd_p29_config                                                       (0x60004074)
#define mask_gpio_ret_pd_p29_config_p29_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p29_config_p29_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p29_config_p29_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p29_config_p29_pu                           (0x800)                         
#define mask_gpio_ret_pd_p29_config_p29_pd                           (0x400)                         
#define mask_gpio_ret_pd_p29_config_p29_ie                           (0x200)                         
#define mask_gpio_ret_pd_p29_config_p29_oe                           (0x100)                         
#define mask_gpio_ret_pd_p29_config_p29_pid                          (0xff)                          

#define reg_gpio_ret_pd_p30_config                                 (*(volatile uint32_t *)0x60004078)
#define adr_gpio_ret_pd_p30_config                                                       (0x60004078)
#define mask_gpio_ret_pd_p30_config_p30_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p30_config_p30_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p30_config_p30_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p30_config_p30_pu                           (0x800)                         
#define mask_gpio_ret_pd_p30_config_p30_pd                           (0x400)                         
#define mask_gpio_ret_pd_p30_config_p30_ie                           (0x200)                         
#define mask_gpio_ret_pd_p30_config_p30_oe                           (0x100)                         
#define mask_gpio_ret_pd_p30_config_p30_pid                          (0xff)                          

