EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio_ret_pd_p31_config                                 (*(volatile uint32_t *)0x6000407c)
#define adr_gpio_ret_pd_p31_config                                                       (0x6000407c)
#define mask_gpio_ret_pd_p31_config_p31_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p31_config_p31_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p31_config_p31_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p31_config_p31_pu                           (0x800)                         
#define mask_gpio_ret_pd_p31_config_p31_pd                           (0x400)                         
#define mask_gpio_ret_pd_p31_config_p31_ie                           (0x200)                         
#define mask_gpio_ret_pd_p31_config_p31_oe                           (0x100)                         
#define mask_gpio_ret_pd_p31_config_p31_pid                          (0xff)                          

#define reg_gpio_ret_pd_p32_config                                 (*(volatile uint32_t *)0x60004080)
#define adr_gpio_ret_pd_p32_config                                                       (0x60004080)
#define mask_gpio_ret_pd_p32_config_p32_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p32_config_p32_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p32_config_p32_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p32_config_p32_pu                           (0x800)                         
#define mask_gpio_ret_pd_p32_config_p32_pd                           (0x400)                         
#define mask_gpio_ret_pd_p32_config_p32_ie                           (0x200)                         
#define mask_gpio_ret_pd_p32_config_p32_oe                           (0x100)                         
#define mask_gpio_ret_pd_p32_config_p32_pid                          (0xff)                          

#define reg_gpio_ret_pd_p33_config                                 (*(volatile uint32_t *)0x60004084)
#define adr_gpio_ret_pd_p33_config                                                       (0x60004084)
#define mask_gpio_ret_pd_p33_config_p33_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p33_config_p33_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p33_config_p33_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p33_config_p33_pu                           (0x800)                         
#define mask_gpio_ret_pd_p33_config_p33_pd                           (0x400)                         
#define mask_gpio_ret_pd_p33_config_p33_ie                           (0x200)                         
#define mask_gpio_ret_pd_p33_config_p33_oe                           (0x100)                         
#define mask_gpio_ret_pd_p33_config_p33_pid                          (0xff)                          

#define reg_gpio_ret_pd_p34_config                                 (*(volatile uint32_t *)0x60004088)
#define adr_gpio_ret_pd_p34_config                                                       (0x60004088)
#define mask_gpio_ret_pd_p34_config_p34_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p34_config_p34_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p34_config_p34_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p34_config_p34_pu                           (0x800)                         
#define mask_gpio_ret_pd_p34_config_p34_pd                           (0x400)                         
#define mask_gpio_ret_pd_p34_config_p34_ie                           (0x200)                         
#define mask_gpio_ret_pd_p34_config_p34_oe                           (0x100)                         
#define mask_gpio_ret_pd_p34_config_p34_pid                          (0xff)                          

#define reg_gpio_ret_pd_p35_config                                 (*(volatile uint32_t *)0x6000408c)
#define adr_gpio_ret_pd_p35_config                                                       (0x6000408c)
#define mask_gpio_ret_pd_p35_config_p35_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p35_config_p35_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p35_config_p35_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p35_config_p35_pu                           (0x800)                         
#define mask_gpio_ret_pd_p35_config_p35_pd                           (0x400)                         
#define mask_gpio_ret_pd_p35_config_p35_ie                           (0x200)                         
#define mask_gpio_ret_pd_p35_config_p35_oe                           (0x100)                         
#define mask_gpio_ret_pd_p35_config_p35_pid                          (0xff)                          

#define reg_gpio_ret_pd_p36_config                                 (*(volatile uint32_t *)0x60004090)
#define adr_gpio_ret_pd_p36_config                                                       (0x60004090)
#define mask_gpio_ret_pd_p36_config_p36_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p36_config_p36_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p36_config_p36_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p36_config_p36_pu                           (0x800)                         
#define mask_gpio_ret_pd_p36_config_p36_pd                           (0x400)                         
#define mask_gpio_ret_pd_p36_config_p36_ie                           (0x200)                         
#define mask_gpio_ret_pd_p36_config_p36_oe                           (0x100)                         
#define mask_gpio_ret_pd_p36_config_p36_pid                          (0xff)                          

