EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio_ret_pd_p37_config                                 (*(volatile uint32_t *)0x60004094)
#define adr_gpio_ret_pd_p37_config                                                       (0x60004094)
#define mask_gpio_ret_pd_p37_config_p37_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p37_config_p37_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p37_config_p37_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p37_config_p37_pu                           (0x800)                         
#define mask_gpio_ret_pd_p37_config_p37_pd                           (0x400)                         
#define mask_gpio_ret_pd_p37_config_p37_ie                           (0x200)                         
#define mask_gpio_ret_pd_p37_config_p37_oe                           (0x100)                         
#define mask_gpio_ret_pd_p37_config_p37_pid                          (0xff)                          

#define reg_gpio_ret_pd_p38_config                                 (*(volatile uint32_t *)0x60004098)
#define adr_gpio_ret_pd_p38_config                                                       (0x60004098)
#define mask_gpio_ret_pd_p38_config_p38_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p38_config_p38_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p38_config_p38_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p38_config_p38_pu                           (0x800)                         
#define mask_gpio_ret_pd_p38_config_p38_pd                           (0x400)                         
#define mask_gpio_ret_pd_p38_config_p38_ie                           (0x200)                         
#define mask_gpio_ret_pd_p38_config_p38_oe                           (0x100)                         
#define mask_gpio_ret_pd_p38_config_p38_pid                          (0xff)                          

#define reg_gpio_ret_pd_p39_config                                 (*(volatile uint32_t *)0x6000409c)
#define adr_gpio_ret_pd_p39_config                                                       (0x6000409c)
#define mask_gpio_ret_pd_p39_config_p39_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p39_config_p39_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p39_config_p39_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p39_config_p39_pu                           (0x800)                         
#define mask_gpio_ret_pd_p39_config_p39_pd                           (0x400)                         
#define mask_gpio_ret_pd_p39_config_p39_ie                           (0x200)                         
#define mask_gpio_ret_pd_p39_config_p39_oe                           (0x100)                         
#define mask_gpio_ret_pd_p39_config_p39_pid                          (0xff)                          

#define reg_gpio_ret_pd_p40_config                                 (*(volatile uint32_t *)0x600040a0)
#define adr_gpio_ret_pd_p40_config                                                       (0x600040a0)
#define mask_gpio_ret_pd_p40_config_p40_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p40_config_p40_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p40_config_p40_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p40_config_p40_pu                           (0x800)                         
#define mask_gpio_ret_pd_p40_config_p40_pd                           (0x400)                         
#define mask_gpio_ret_pd_p40_config_p40_ie                           (0x200)                         
#define mask_gpio_ret_pd_p40_config_p40_oe                           (0x100)                         
#define mask_gpio_ret_pd_p40_config_p40_pid                          (0xff)                          

#define reg_gpio_ret_pd_p41_config                                 (*(volatile uint32_t *)0x600040a4)
#define adr_gpio_ret_pd_p41_config                                                       (0x600040a4)
#define mask_gpio_ret_pd_p41_config_p41_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p41_config_p41_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p41_config_p41_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p41_config_p41_pu                           (0x800)                         
#define mask_gpio_ret_pd_p41_config_p41_pd                           (0x400)                         
#define mask_gpio_ret_pd_p41_config_p41_ie                           (0x200)                         
#define mask_gpio_ret_pd_p41_config_p41_oe                           (0x100)                         
#define mask_gpio_ret_pd_p41_config_p41_pid                          (0xff)                          

#define reg_gpio_ret_pd_p42_config                                 (*(volatile uint32_t *)0x600040a8)
#define adr_gpio_ret_pd_p42_config                                                       (0x600040a8)
#define mask_gpio_ret_pd_p42_config_p42_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p42_config_p42_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p42_config_p42_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p42_config_p42_pu                           (0x800)                         
#define mask_gpio_ret_pd_p42_config_p42_pd                           (0x400)                         
#define mask_gpio_ret_pd_p42_config_p42_ie                           (0x200)                         
#define mask_gpio_ret_pd_p42_config_p42_oe                           (0x100)                         
#define mask_gpio_ret_pd_p42_config_p42_pid                          (0xff)                          

#define reg_gpio_ret_pd_p43_config                                 (*(volatile uint32_t *)0x600040ac)
#define adr_gpio_ret_pd_p43_config                                                       (0x600040ac)
#define mask_gpio_ret_pd_p43_config_p43_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p43_config_p43_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p43_config_p43_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p43_config_p43_pu                           (0x800)                         
#define mask_gpio_ret_pd_p43_config_p43_pd                           (0x400)                         
#define mask_gpio_ret_pd_p43_config_p43_ie                           (0x200)                         
#define mask_gpio_ret_pd_p43_config_p43_oe                           (0x100)                         
#define mask_gpio_ret_pd_p43_config_p43_pid                          (0xff)                          

#define reg_gpio_ret_pd_p44_config                                 (*(volatile uint32_t *)0x600040b0)
#define adr_gpio_ret_pd_p44_config                                                       (0x600040b0)
#define mask_gpio_ret_pd_p44_config_p44_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p44_config_p44_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p44_config_p44_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p44_config_p44_pu                           (0x800)                         
#define mask_gpio_ret_pd_p44_config_p44_pd                           (0x400)                         
#define mask_gpio_ret_pd_p44_config_p44_ie                           (0x200)                         
#define mask_gpio_ret_pd_p44_config_p44_oe                           (0x100)                         
#define mask_gpio_ret_pd_p44_config_p44_pid                          (0xff)                          

#define reg_gpio_ret_pd_p45_config                                 (*(volatile uint32_t *)0x600040b4)
#define adr_gpio_ret_pd_p45_config                                                       (0x600040b4)
#define mask_gpio_ret_pd_p45_config_p45_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p45_config_p45_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p45_config_p45_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p45_config_p45_pu                           (0x800)                         
#define mask_gpio_ret_pd_p45_config_p45_pd                           (0x400)                         
#define mask_gpio_ret_pd_p45_config_p45_ie                           (0x200)                         
#define mask_gpio_ret_pd_p45_config_p45_oe                           (0x100)                         
#define mask_gpio_ret_pd_p45_config_p45_pid                          (0xff)                          

