EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio_ret_pd_p46_config                                 (*(volatile uint32_t *)0x600040b8)
#define adr_gpio_ret_pd_p46_config                                                       (0x600040b8)
#define mask_gpio_ret_pd_p46_config_p46_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p46_config_p46_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p46_config_p46_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p46_config_p46_pu                           (0x800)                         
#define mask_gpio_ret_pd_p46_config_p46_pd                           (0x400)                         
#define mask_gpio_ret_pd_p46_config_p46_ie                           (0x200)                         
#define mask_gpio_ret_pd_p46_config_p46_oe                           (0x100)                         
#define mask_gpio_ret_pd_p46_config_p46_pid                          (0xff)                          

#define reg_gpio_ret_pd_p47_config                                 (*(volatile uint32_t *)0x600040bc)
#define adr_gpio_ret_pd_p47_config                                                       (0x600040bc)
#define mask_gpio_ret_pd_p47_config_p47_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p47_config_p47_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p47_config_p47_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p47_config_p47_pu                           (0x800)                         
#define mask_gpio_ret_pd_p47_config_p47_pd                           (0x400)                         
#define mask_gpio_ret_pd_p47_config_p47_ie                           (0x200)                         
#define mask_gpio_ret_pd_p47_config_p47_oe                           (0x100)                         
#define mask_gpio_ret_pd_p47_config_p47_pid                          (0xff)                          

#define reg_gpio_ret_pd_p48_config                                 (*(volatile uint32_t *)0x600040c0)
#define adr_gpio_ret_pd_p48_config                                                       (0x600040c0)
#define mask_gpio_ret_pd_p48_config_p48_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p48_config_p48_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p48_config_p48_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p48_config_p48_pu                           (0x800)                         
#define mask_gpio_ret_pd_p48_config_p48_pd                           (0x400)                         
#define mask_gpio_ret_pd_p48_config_p48_ie                           (0x200)                         
#define mask_gpio_ret_pd_p48_config_p48_oe                           (0x100)                         
#define mask_gpio_ret_pd_p48_config_p48_pid                          (0xff)                          

#define reg_gpio_ret_pd_p49_config                                 (*(volatile uint32_t *)0x600040c4)
#define adr_gpio_ret_pd_p49_config                                                       (0x600040c4)
#define mask_gpio_ret_pd_p49_config_p49_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p49_config_p49_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p49_config_p49_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p49_config_p49_pu                           (0x800)                         
#define mask_gpio_ret_pd_p49_config_p49_pd                           (0x400)                         
#define mask_gpio_ret_pd_p49_config_p49_ie                           (0x200)                         
#define mask_gpio_ret_pd_p49_config_p49_oe                           (0x100)                         
#define mask_gpio_ret_pd_p49_config_p49_pid                          (0xff)                          

#define reg_gpio_ret_pd_p50_config                                 (*(volatile uint32_t *)0x600040c8)
#define adr_gpio_ret_pd_p50_config                                                       (0x600040c8)
#define mask_gpio_ret_pd_p50_config_p50_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p50_config_p50_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p50_config_p50_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p50_config_p50_pu                           (0x800)                         
#define mask_gpio_ret_pd_p50_config_p50_pd                           (0x400)                         
#define mask_gpio_ret_pd_p50_config_p50_ie                           (0x200)                         
#define mask_gpio_ret_pd_p50_config_p50_oe                           (0x100)                         
#define mask_gpio_ret_pd_p50_config_p50_pid                          (0xff)                          

#define reg_gpio_ret_pd_p51_config                                 (*(volatile uint32_t *)0x600040cc)
#define adr_gpio_ret_pd_p51_config                                                       (0x600040cc)
#define mask_gpio_ret_pd_p51_config_p51_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p51_config_p51_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p51_config_p51_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p51_config_p51_pu                           (0x800)                         
#define mask_gpio_ret_pd_p51_config_p51_pd                           (0x400)                         
#define mask_gpio_ret_pd_p51_config_p51_ie                           (0x200)                         
#define mask_gpio_ret_pd_p51_config_p51_oe                           (0x100)                         
#define mask_gpio_ret_pd_p51_config_p51_pid                          (0xff)                          

#define reg_gpio_ret_pd_p52_config                                 (*(volatile uint32_t *)0x600040d0)
#define adr_gpio_ret_pd_p52_config                                                       (0x600040d0)
#define mask_gpio_ret_pd_p52_config_p52_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p52_config_p52_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p52_config_p52_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p52_config_p52_pu                           (0x800)                         
#define mask_gpio_ret_pd_p52_config_p52_pd                           (0x400)                         
#define mask_gpio_ret_pd_p52_config_p52_ie                           (0x200)                         
#define mask_gpio_ret_pd_p52_config_p52_oe                           (0x100)                         
#define mask_gpio_ret_pd_p52_config_p52_pid                          (0xff)                          

#define reg_gpio_ret_pd_p53_config                                 (*(volatile uint32_t *)0x600040d4)
#define adr_gpio_ret_pd_p53_config                                                       (0x600040d4)
#define mask_gpio_ret_pd_p53_config_p53_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p53_config_p53_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p53_config_p53_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p53_config_p53_pu                           (0x800)                         
#define mask_gpio_ret_pd_p53_config_p53_pd                           (0x400)                         
#define mask_gpio_ret_pd_p53_config_p53_ie                           (0x200)                         
#define mask_gpio_ret_pd_p53_config_p53_oe                           (0x100)                         
#define mask_gpio_ret_pd_p53_config_p53_pid                          (0xff)                          

#define reg_iomux_ret_pd_qspi_ctrl                                 (*(volatile uint32_t *)0x60004190)
#define adr_iomux_ret_pd_qspi_ctrl                                                       (0x60004190)
#define mask_iomux_ret_pd_qspi_ctrl_qspi3_en                         (0x8)                           
#define mask_iomux_ret_pd_qspi_ctrl_qspi2_en                         (0x4)                           
#define mask_iomux_ret_pd_qspi_ctrl_qspi1_en                         (0x2)                           
#define mask_iomux_ret_pd_qspi_ctrl_qspi0_en                         (0x1)                           

#define reg_IR_ir_ctrl                                             (*(volatile uint32_t *)0x60004194)
#define adr_IR_ir_ctrl                                                                   (0x60004194)
#define mask_IR_ir_ctrl_TX_EN_o                                      (0x10)                          
#define mask_IR_ir_ctrl_RX_AMP_EN_o                                  (0x8)                           
#define mask_IR_ir_ctrl_RX_RTUNE_o                                   (0x7)                           

#define reg_iomux_ext_cg_en                                        (*(volatile uint32_t *)0x60004198)
#define adr_iomux_ext_cg_en                                                              (0x60004198)

