EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_modem_fpga_ctrl                                        (*(volatile uint32_t *)0x6000419c)
#define adr_modem_fpga_ctrl                                                              (0x6000419c)


//---------------------------------------------------
// gpio_ret_pd in  domain address definition
//---------------------------------------------------

#define reg_gpio_ret_pd_p54_config                                 (*(volatile uint32_t *)0x60004400)
#define adr_gpio_ret_pd_p54_config                                                       (0x60004400)
#define mask_gpio_ret_pd_p54_config_p54_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p54_config_p54_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p54_config_p54_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p54_config_p54_pu                           (0x800)                         
#define mask_gpio_ret_pd_p54_config_p54_pd                           (0x400)                         
#define mask_gpio_ret_pd_p54_config_p54_ie                           (0x200)                         
#define mask_gpio_ret_pd_p54_config_p54_oe                           (0x100)                         
#define mask_gpio_ret_pd_p54_config_p54_pid                          (0xff)                          

#define reg_gpio_ret_pd_p55_config                                 (*(volatile uint32_t *)0x60004404)
#define adr_gpio_ret_pd_p55_config                                                       (0x60004404)
#define mask_gpio_ret_pd_p55_config_p55_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p55_config_p55_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p55_config_p55_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p55_config_p55_pu                           (0x800)                         
#define mask_gpio_ret_pd_p55_config_p55_pd                           (0x400)                         
#define mask_gpio_ret_pd_p55_config_p55_ie                           (0x200)                         
#define mask_gpio_ret_pd_p55_config_p55_oe                           (0x100)                         
#define mask_gpio_ret_pd_p55_config_p55_pid                          (0xff)                          

#define reg_gpio_ret_pd_p56_config                                 (*(volatile uint32_t *)0x60004408)
#define adr_gpio_ret_pd_p56_config                                                       (0x60004408)
#define mask_gpio_ret_pd_p56_config_p56_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p56_config_p56_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p56_config_p56_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p56_config_p56_pu                           (0x800)                         
#define mask_gpio_ret_pd_p56_config_p56_pd                           (0x400)                         
#define mask_gpio_ret_pd_p56_config_p56_ie                           (0x200)                         
#define mask_gpio_ret_pd_p56_config_p56_oe                           (0x100)                         
#define mask_gpio_ret_pd_p56_config_p56_pid                          (0xff)                          

#define reg_gpio_ret_pd_p57_config                                 (*(volatile uint32_t *)0x6000440c)
#define adr_gpio_ret_pd_p57_config                                                       (0x6000440c)
#define mask_gpio_ret_pd_p57_config_p57_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p57_config_p57_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p57_config_p57_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p57_config_p57_pu                           (0x800)                         
#define mask_gpio_ret_pd_p57_config_p57_pd                           (0x400)                         
#define mask_gpio_ret_pd_p57_config_p57_ie                           (0x200)                         
#define mask_gpio_ret_pd_p57_config_p57_oe                           (0x100)                         
#define mask_gpio_ret_pd_p57_config_p57_pid                          (0xff)                          

#define reg_gpio_ret_pd_p58_config                                 (*(volatile uint32_t *)0x60004410)
#define adr_gpio_ret_pd_p58_config                                                       (0x60004410)
#define mask_gpio_ret_pd_p58_config_p58_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p58_config_p58_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p58_config_p58_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p58_config_p58_pu                           (0x800)                         
#define mask_gpio_ret_pd_p58_config_p58_pd                           (0x400)                         
#define mask_gpio_ret_pd_p58_config_p58_ie                           (0x200)                         
#define mask_gpio_ret_pd_p58_config_p58_oe                           (0x100)                         
#define mask_gpio_ret_pd_p58_config_p58_pid                          (0xff)                          

#define reg_gpio_ret_pd_p59_config                                 (*(volatile uint32_t *)0x60004414)
#define adr_gpio_ret_pd_p59_config                                                       (0x60004414)
#define mask_gpio_ret_pd_p59_config_p59_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p59_config_p59_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p59_config_p59_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p59_config_p59_pu                           (0x800)                         
#define mask_gpio_ret_pd_p59_config_p59_pd                           (0x400)                         
#define mask_gpio_ret_pd_p59_config_p59_ie                           (0x200)                         
#define mask_gpio_ret_pd_p59_config_p59_oe                           (0x100)                         
#define mask_gpio_ret_pd_p59_config_p59_pid                          (0xff)                          

#define reg_gpio_ret_pd_p60_config                                 (*(volatile uint32_t *)0x60004418)
#define adr_gpio_ret_pd_p60_config                                                       (0x60004418)
#define mask_gpio_ret_pd_p60_config_p60_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p60_config_p60_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p60_config_p60_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p60_config_p60_pu                           (0x800)                         
#define mask_gpio_ret_pd_p60_config_p60_pd                           (0x400)                         
#define mask_gpio_ret_pd_p60_config_p60_ie                           (0x200)                         
#define mask_gpio_ret_pd_p60_config_p60_oe                           (0x100)                         
#define mask_gpio_ret_pd_p60_config_p60_pid                          (0xff)                          

