EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio_ret_pd_p61_config                                 (*(volatile uint32_t *)0x6000441c)
#define adr_gpio_ret_pd_p61_config                                                       (0x6000441c)
#define mask_gpio_ret_pd_p61_config_p61_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p61_config_p61_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p61_config_p61_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p61_config_p61_pu                           (0x800)                         
#define mask_gpio_ret_pd_p61_config_p61_pd                           (0x400)                         
#define mask_gpio_ret_pd_p61_config_p61_ie                           (0x200)                         
#define mask_gpio_ret_pd_p61_config_p61_oe                           (0x100)                         
#define mask_gpio_ret_pd_p61_config_p61_pid                          (0xff)                          

#define reg_gpio_ret_pd_p62_config                                 (*(volatile uint32_t *)0x60004420)
#define adr_gpio_ret_pd_p62_config                                                       (0x60004420)
#define mask_gpio_ret_pd_p62_config_p62_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p62_config_p62_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p62_config_p62_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p62_config_p62_pu                           (0x800)                         
#define mask_gpio_ret_pd_p62_config_p62_pd                           (0x400)                         
#define mask_gpio_ret_pd_p62_config_p62_ie                           (0x200)                         
#define mask_gpio_ret_pd_p62_config_p62_oe                           (0x100)                         
#define mask_gpio_ret_pd_p62_config_p62_pid                          (0xff)                          

#define reg_gpio_ret_pd_p63_config                                 (*(volatile uint32_t *)0x60004424)
#define adr_gpio_ret_pd_p63_config                                                       (0x60004424)
#define mask_gpio_ret_pd_p63_config_p63_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p63_config_p63_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p63_config_p63_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p63_config_p63_pu                           (0x800)                         
#define mask_gpio_ret_pd_p63_config_p63_pd                           (0x400)                         
#define mask_gpio_ret_pd_p63_config_p63_ie                           (0x200)                         
#define mask_gpio_ret_pd_p63_config_p63_oe                           (0x100)                         
#define mask_gpio_ret_pd_p63_config_p63_pid                          (0xff)                          

#define reg_gpio_ret_pd_p64_config                                 (*(volatile uint32_t *)0x60004428)
#define adr_gpio_ret_pd_p64_config                                                       (0x60004428)
#define mask_gpio_ret_pd_p64_config_p64_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p64_config_p64_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p64_config_p64_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p64_config_p64_pu                           (0x800)                         
#define mask_gpio_ret_pd_p64_config_p64_pd                           (0x400)                         
#define mask_gpio_ret_pd_p64_config_p64_ie                           (0x200)                         
#define mask_gpio_ret_pd_p64_config_p64_oe                           (0x100)                         
#define mask_gpio_ret_pd_p64_config_p64_pid                          (0xff)                          

#define reg_gpio_ret_pd_p65_config                                 (*(volatile uint32_t *)0x6000442c)
#define adr_gpio_ret_pd_p65_config                                                       (0x6000442c)
#define mask_gpio_ret_pd_p65_config_p65_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p65_config_p65_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p65_config_p65_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p65_config_p65_pu                           (0x800)                         
#define mask_gpio_ret_pd_p65_config_p65_pd                           (0x400)                         
#define mask_gpio_ret_pd_p65_config_p65_ie                           (0x200)                         
#define mask_gpio_ret_pd_p65_config_p65_oe                           (0x100)                         
#define mask_gpio_ret_pd_p65_config_p65_pid                          (0xff)                          

#define reg_gpio_ret_pd_p66_config                                 (*(volatile uint32_t *)0x60004430)
#define adr_gpio_ret_pd_p66_config                                                       (0x60004430)
#define mask_gpio_ret_pd_p66_config_p66_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p66_config_p66_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p66_config_p66_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p66_config_p66_pu                           (0x800)                         
#define mask_gpio_ret_pd_p66_config_p66_pd                           (0x400)                         
#define mask_gpio_ret_pd_p66_config_p66_ie                           (0x200)                         
#define mask_gpio_ret_pd_p66_config_p66_oe                           (0x100)                         
#define mask_gpio_ret_pd_p66_config_p66_pid                          (0xff)                          

