EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio_ret_pd_p67_config                                 (*(volatile uint32_t *)0x60004434)
#define adr_gpio_ret_pd_p67_config                                                       (0x60004434)
#define mask_gpio_ret_pd_p67_config_p67_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p67_config_p67_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p67_config_p67_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p67_config_p67_pu                           (0x800)                         
#define mask_gpio_ret_pd_p67_config_p67_pd                           (0x400)                         
#define mask_gpio_ret_pd_p67_config_p67_ie                           (0x200)                         
#define mask_gpio_ret_pd_p67_config_p67_oe                           (0x100)                         
#define mask_gpio_ret_pd_p67_config_p67_pid                          (0xff)                          

#define reg_gpio_ret_pd_p68_config                                 (*(volatile uint32_t *)0x60004438)
#define adr_gpio_ret_pd_p68_config                                                       (0x60004438)
#define mask_gpio_ret_pd_p68_config_p68_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p68_config_p68_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p68_config_p68_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p68_config_p68_pu                           (0x800)                         
#define mask_gpio_ret_pd_p68_config_p68_pd                           (0x400)                         
#define mask_gpio_ret_pd_p68_config_p68_ie                           (0x200)                         
#define mask_gpio_ret_pd_p68_config_p68_oe                           (0x100)                         
#define mask_gpio_ret_pd_p68_config_p68_pid                          (0xff)                          

#define reg_gpio_ret_pd_p69_config                                 (*(volatile uint32_t *)0x6000443c)
#define adr_gpio_ret_pd_p69_config                                                       (0x6000443c)
#define mask_gpio_ret_pd_p69_config_p69_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p69_config_p69_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p69_config_p69_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p69_config_p69_pu                           (0x800)                         
#define mask_gpio_ret_pd_p69_config_p69_pd                           (0x400)                         
#define mask_gpio_ret_pd_p69_config_p69_ie                           (0x200)                         
#define mask_gpio_ret_pd_p69_config_p69_oe                           (0x100)                         
#define mask_gpio_ret_pd_p69_config_p69_pid                          (0xff)                          

#define reg_gpio_ret_pd_p70_config                                 (*(volatile uint32_t *)0x60004440)
#define adr_gpio_ret_pd_p70_config                                                       (0x60004440)
#define mask_gpio_ret_pd_p70_config_p70_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p70_config_p70_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p70_config_p70_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p70_config_p70_pu                           (0x800)                         
#define mask_gpio_ret_pd_p70_config_p70_pd                           (0x400)                         
#define mask_gpio_ret_pd_p70_config_p70_ie                           (0x200)                         
#define mask_gpio_ret_pd_p70_config_p70_oe                           (0x100)                         
#define mask_gpio_ret_pd_p70_config_p70_pid                          (0xff)                          

#define reg_gpio_ret_pd_p71_config                                 (*(volatile uint32_t *)0x60004444)
#define adr_gpio_ret_pd_p71_config                                                       (0x60004444)
#define mask_gpio_ret_pd_p71_config_p71_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p71_config_p71_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p71_config_p71_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p71_config_p71_pu                           (0x800)                         
#define mask_gpio_ret_pd_p71_config_p71_pd                           (0x400)                         
#define mask_gpio_ret_pd_p71_config_p71_ie                           (0x200)                         
#define mask_gpio_ret_pd_p71_config_p71_oe                           (0x100)                         
#define mask_gpio_ret_pd_p71_config_p71_pid                          (0xff)                          

#define reg_gpio_ret_pd_p72_config                                 (*(volatile uint32_t *)0x60004448)
#define adr_gpio_ret_pd_p72_config                                                       (0x60004448)
#define mask_gpio_ret_pd_p72_config_p72_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p72_config_p72_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p72_config_p72_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p72_config_p72_pu                           (0x800)                         
#define mask_gpio_ret_pd_p72_config_p72_pd                           (0x400)                         
#define mask_gpio_ret_pd_p72_config_p72_ie                           (0x200)                         
#define mask_gpio_ret_pd_p72_config_p72_oe                           (0x100)                         
#define mask_gpio_ret_pd_p72_config_p72_pid                          (0xff)                          

#define reg_gpio_ret_pd_p73_config                                 (*(volatile uint32_t *)0x6000444c)
#define adr_gpio_ret_pd_p73_config                                                       (0x6000444c)
#define mask_gpio_ret_pd_p73_config_p73_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p73_config_p73_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p73_config_p73_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p73_config_p73_pu                           (0x800)                         
#define mask_gpio_ret_pd_p73_config_p73_pd                           (0x400)                         
#define mask_gpio_ret_pd_p73_config_p73_ie                           (0x200)                         
#define mask_gpio_ret_pd_p73_config_p73_oe                           (0x100)                         
#define mask_gpio_ret_pd_p73_config_p73_pid                          (0xff)                          

#define reg_gpio_ret_pd_p74_config                                 (*(volatile uint32_t *)0x60004450)
#define adr_gpio_ret_pd_p74_config                                                       (0x60004450)
#define mask_gpio_ret_pd_p74_config_p74_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p74_config_p74_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p74_config_p74_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p74_config_p74_pu                           (0x800)                         
#define mask_gpio_ret_pd_p74_config_p74_pd                           (0x400)                         
#define mask_gpio_ret_pd_p74_config_p74_ie                           (0x200)                         
#define mask_gpio_ret_pd_p74_config_p74_oe                           (0x100)                         
#define mask_gpio_ret_pd_p74_config_p74_pid                          (0xff)                          

#define reg_gpio_ret_pd_p75_config                                 (*(volatile uint32_t *)0x60004454)
#define adr_gpio_ret_pd_p75_config                                                       (0x60004454)
#define mask_gpio_ret_pd_p75_config_p75_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p75_config_p75_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p75_config_p75_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p75_config_p75_pu                           (0x800)                         
#define mask_gpio_ret_pd_p75_config_p75_pd                           (0x400)                         
#define mask_gpio_ret_pd_p75_config_p75_ie                           (0x200)                         
#define mask_gpio_ret_pd_p75_config_p75_oe                           (0x100)                         
#define mask_gpio_ret_pd_p75_config_p75_pid                          (0xff)                          

#define reg_gpio_ret_pd_p76_config                                 (*(volatile uint32_t *)0x60004458)
#define adr_gpio_ret_pd_p76_config                                                       (0x60004458)
#define mask_gpio_ret_pd_p76_config_p76_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p76_config_p76_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p76_config_p76_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p76_config_p76_pu                           (0x800)                         
#define mask_gpio_ret_pd_p76_config_p76_pd                           (0x400)                         
#define mask_gpio_ret_pd_p76_config_p76_ie                           (0x200)                         
#define mask_gpio_ret_pd_p76_config_p76_oe                           (0x100)                         
#define mask_gpio_ret_pd_p76_config_p76_pid                          (0xff)                          

#define reg_gpio_ret_pd_p77_config                                 (*(volatile uint32_t *)0x6000445c)
#define adr_gpio_ret_pd_p77_config                                                       (0x6000445c)
#define mask_gpio_ret_pd_p77_config_p77_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p77_config_p77_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p77_config_p77_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p77_config_p77_pu                           (0x800)                         
#define mask_gpio_ret_pd_p77_config_p77_pd                           (0x400)                         
#define mask_gpio_ret_pd_p77_config_p77_ie                           (0x200)                         
#define mask_gpio_ret_pd_p77_config_p77_oe                           (0x100)                         
#define mask_gpio_ret_pd_p77_config_p77_pid                          (0xff)                          

#define reg_gpio_ret_pd_p78_config                                 (*(volatile uint32_t *)0x60004460)
#define adr_gpio_ret_pd_p78_config                                                       (0x60004460)
#define mask_gpio_ret_pd_p78_config_p78_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p78_config_p78_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p78_config_p78_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p78_config_p78_pu                           (0x800)                         
#define mask_gpio_ret_pd_p78_config_p78_pd                           (0x400)                         
#define mask_gpio_ret_pd_p78_config_p78_ie                           (0x200)                         
#define mask_gpio_ret_pd_p78_config_p78_oe                           (0x100)                         
#define mask_gpio_ret_pd_p78_config_p78_pid                          (0xff)                          

