EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio_ret_pd_p79_config                                 (*(volatile uint32_t *)0x60004464)
#define adr_gpio_ret_pd_p79_config                                                       (0x60004464)
#define mask_gpio_ret_pd_p79_config_p79_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p79_config_p79_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p79_config_p79_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p79_config_p79_pu                           (0x800)                         
#define mask_gpio_ret_pd_p79_config_p79_pd                           (0x400)                         
#define mask_gpio_ret_pd_p79_config_p79_ie                           (0x200)                         
#define mask_gpio_ret_pd_p79_config_p79_oe                           (0x100)                         
#define mask_gpio_ret_pd_p79_config_p79_pid                          (0xff)                          

#define reg_gpio_ret_pd_p80_config                                 (*(volatile uint32_t *)0x60004468)
#define adr_gpio_ret_pd_p80_config                                                       (0x60004468)
#define mask_gpio_ret_pd_p80_config_p80_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p80_config_p80_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p80_config_p80_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p80_config_p80_pu                           (0x800)                         
#define mask_gpio_ret_pd_p80_config_p80_pd                           (0x400)                         
#define mask_gpio_ret_pd_p80_config_p80_ie                           (0x200)                         
#define mask_gpio_ret_pd_p80_config_p80_oe                           (0x100)                         
#define mask_gpio_ret_pd_p80_config_p80_pid                          (0xff)                          

#define reg_gpio_ret_pd_p81_config                                 (*(volatile uint32_t *)0x6000446c)
#define adr_gpio_ret_pd_p81_config                                                       (0x6000446c)
#define mask_gpio_ret_pd_p81_config_p81_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p81_config_p81_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p81_config_p81_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p81_config_p81_pu                           (0x800)                         
#define mask_gpio_ret_pd_p81_config_p81_pd                           (0x400)                         
#define mask_gpio_ret_pd_p81_config_p81_ie                           (0x200)                         
#define mask_gpio_ret_pd_p81_config_p81_oe                           (0x100)                         
#define mask_gpio_ret_pd_p81_config_p81_pid                          (0xff)                          

#define reg_gpio_ret_pd_p82_config                                 (*(volatile uint32_t *)0x60004470)
#define adr_gpio_ret_pd_p82_config                                                       (0x60004470)
#define mask_gpio_ret_pd_p82_config_p82_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p82_config_p82_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p82_config_p82_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p82_config_p82_pu                           (0x800)                         
#define mask_gpio_ret_pd_p82_config_p82_pd                           (0x400)                         
#define mask_gpio_ret_pd_p82_config_p82_ie                           (0x200)                         
#define mask_gpio_ret_pd_p82_config_p82_oe                           (0x100)                         
#define mask_gpio_ret_pd_p82_config_p82_pid                          (0xff)                          

#define reg_gpio_ret_pd_p83_config                                 (*(volatile uint32_t *)0x60004474)
#define adr_gpio_ret_pd_p83_config                                                       (0x60004474)
#define mask_gpio_ret_pd_p83_config_p83_cs                           (0x4000)                        
#define mask_gpio_ret_pd_p83_config_p83_dsh                          (0x2000)                        
#define mask_gpio_ret_pd_p83_config_p83_dsl                          (0x1000)                        
#define mask_gpio_ret_pd_p83_config_p83_pu                           (0x800)                         
#define mask_gpio_ret_pd_p83_config_p83_pd                           (0x400)                         
#define mask_gpio_ret_pd_p83_config_p83_ie                           (0x200)                         
#define mask_gpio_ret_pd_p83_config_p83_oe                           (0x100)                         
#define mask_gpio_ret_pd_p83_config_p83_pid                          (0xff)                          


//---------------------------------------------------
// gpadc0 in  domain address definition
//---------------------------------------------------

#define reg_gpadc0_fifo                                            (*(volatile uint32_t *)0x60020000)
#define adr_gpadc0_fifo                                                                  (0x60020000)


//---------------------------------------------------
// gpadc0 in  domain address definition
//---------------------------------------------------

#define reg_gpadc0_downsp                                          (*(volatile uint32_t *)0x60020004)
#define adr_gpadc0_downsp                                                                (0x60020004)

#define reg_gpadc0_coeff_0                                         (*(volatile uint32_t *)0x60020008)
#define adr_gpadc0_coeff_0                                                               (0x60020008)

#define reg_gpadc0_coeff_1                                         (*(volatile uint32_t *)0x6002000c)
#define adr_gpadc0_coeff_1                                                               (0x6002000c)

#define reg_gpadc0_coeff_2                                         (*(volatile uint32_t *)0x60020010)
#define adr_gpadc0_coeff_2                                                               (0x60020010)

#define reg_gpadc0_coeff_3                                         (*(volatile uint32_t *)0x60020014)
#define adr_gpadc0_coeff_3                                                               (0x60020014)

