EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpadc0_set                                             (*(volatile uint32_t *)0x60020018)
#define adr_gpadc0_set                                                                   (0x60020018)
#define mask_gpadc0_set_donsp_out_thd                                (0x1c000)                       
#define mask_gpadc0_set_bp_comp_en                                   (0x2000)                        
#define mask_gpadc0_set_adc_zero_move_en                             (0x1000)                        
#define mask_gpadc0_set_ext_cg_en                                    (0x800)                         
#define mask_gpadc0_set_fifo_thld                                    (0x600)                         
#define mask_gpadc0_set_adc_pos_sel                                  (0x100)                         
#define mask_gpadc0_set_cic_mode_en                                  (0x80)                          
#define mask_gpadc0_set_adc_org_sel                                  (0x40)                          
#define mask_gpadc0_set_reserved                                     (0x20)                          
#define mask_gpadc0_set_a_rshift                                     (0x1f)                          

#define reg_gpadc0_int_sta                                         (*(volatile uint32_t *)0x6002001c)
#define adr_gpadc0_int_sta                                                               (0x6002001c)

#define reg_gpadc0_int_clr                                         (*(volatile uint32_t *)0x60020020)
#define adr_gpadc0_int_clr                                                               (0x60020020)

#define reg_gpadc0_int_mask                                        (*(volatile uint32_t *)0x60020024)
#define adr_gpadc0_int_mask                                                              (0x60020024)

#define reg_gpadc0_ovflow                                          (*(volatile uint32_t *)0x60020028)
#define adr_gpadc0_ovflow                                                                (0x60020028)

#define reg_gpadc0_samp_set_cfg                                    (*(volatile uint32_t *)0x6002002c)
#define adr_gpadc0_samp_set_cfg                                                          (0x6002002c)
#define mask_gpadc0_samp_set_cfg_pwm_sel                             (0x1c0)                         
#define mask_gpadc0_samp_set_cfg_samp_mode_sel                       (0x30)                          
#define mask_gpadc0_samp_set_cfg_type_sel                            (0xf)                           

#define reg_gpadc0_en                                              (*(volatile uint32_t *)0x60020030)
#define adr_gpadc0_en                                                                    (0x60020030)

#define reg_gpadc0_data_test_cfg                                   (*(volatile uint32_t *)0x60020054)
#define adr_gpadc0_data_test_cfg                                                         (0x60020054)
#define mask_gpadc0_data_test_cfg_test_in_en                         (0x400)                         
#define mask_gpadc0_data_test_cfg_test_data                          (0x3ff)                         

#define reg_gpadc0_ch_en                                           (*(volatile uint32_t *)0x60020058)
#define adr_gpadc0_ch_en                                                                 (0x60020058)

#define reg_gpadc0_ch_wait_pcycle                                  (*(volatile uint32_t *)0x6002005c)
#define adr_gpadc0_ch_wait_pcycle                                                        (0x6002005c)

#define reg_gpadc0_samp_num                                        (*(volatile uint32_t *)0x60020060)
#define adr_gpadc0_samp_num                                                              (0x60020060)

#define reg_gpadc0_trig_reg                                        (*(volatile uint32_t *)0x60020064)
#define adr_gpadc0_trig_reg                                                              (0x60020064)
#define mask_gpadc0_trig_reg_clr_sampcnt                             (0x8)                           
#define mask_gpadc0_trig_reg_stop                                    (0x4)                           
#define mask_gpadc0_trig_reg_samp_trig                               (0x2)                           
#define mask_gpadc0_trig_reg_ch_trig                                 (0x1)                           

#define reg_gpadc0_sta_reg0                                        (*(volatile uint32_t *)0x60020068)
#define adr_gpadc0_sta_reg0                                                              (0x60020068)
#define mask_gpadc0_sta_reg0_adc_dat                                 (0xffff0000)                    
#define mask_gpadc0_sta_reg0_samp_cnt                                (0xffff)                        

#define reg_gpadc0_sta_reg1                                        (*(volatile uint32_t *)0x6002006c)
#define adr_gpadc0_sta_reg1                                                              (0x6002006c)
#define mask_gpadc0_sta_reg1_fifo_cnt                                (0x3c0000)                      
#define mask_gpadc0_sta_reg1_fsm                                     (0x38000)                       
#define mask_gpadc0_sta_reg1_aud_sta                                 (0x7fff)                        


//---------------------------------------------------
// gpadc1 in  domain address definition
//---------------------------------------------------

#define reg_gpadc1_fifo                                            (*(volatile uint32_t *)0x60020400)
#define adr_gpadc1_fifo                                                                  (0x60020400)


//---------------------------------------------------
// gpadc1 in  domain address definition
//---------------------------------------------------

#define reg_gpadc1_downsp                                          (*(volatile uint32_t *)0x60020404)
#define adr_gpadc1_downsp                                                                (0x60020404)

#define reg_gpadc1_coeff_0                                         (*(volatile uint32_t *)0x60020408)
#define adr_gpadc1_coeff_0                                                               (0x60020408)

#define reg_gpadc1_coeff_1                                         (*(volatile uint32_t *)0x6002040c)
#define adr_gpadc1_coeff_1                                                               (0x6002040c)

#define reg_gpadc1_coeff_2                                         (*(volatile uint32_t *)0x60020410)
#define adr_gpadc1_coeff_2                                                               (0x60020410)

#define reg_gpadc1_coeff_3                                         (*(volatile uint32_t *)0x60020414)
#define adr_gpadc1_coeff_3                                                               (0x60020414)

