EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpadc1_set                                             (*(volatile uint32_t *)0x60020418)
#define adr_gpadc1_set                                                                   (0x60020418)
#define mask_gpadc1_set_donsp_out_thd                                (0x1c000)                       
#define mask_gpadc1_set_bp_comp_en                                   (0x2000)                        
#define mask_gpadc1_set_adc_zero_move_en                             (0x1000)                        
#define mask_gpadc1_set_ext_cg_en                                    (0x800)                         
#define mask_gpadc1_set_fifo_thld                                    (0x600)                         
#define mask_gpadc1_set_adc_pos_sel                                  (0x100)                         
#define mask_gpadc1_set_cic_mode_en                                  (0x80)                          
#define mask_gpadc1_set_adc_org_sel                                  (0x40)                          
#define mask_gpadc1_set_reserved                                     (0x20)                          
#define mask_gpadc1_set_a_rshift                                     (0x1f)                          

#define reg_gpadc1_int_sta                                         (*(volatile uint32_t *)0x6002041c)
#define adr_gpadc1_int_sta                                                               (0x6002041c)

#define reg_gpadc1_int_clr                                         (*(volatile uint32_t *)0x60020420)
#define adr_gpadc1_int_clr                                                               (0x60020420)

#define reg_gpadc1_int_mask                                        (*(volatile uint32_t *)0x60020424)
#define adr_gpadc1_int_mask                                                              (0x60020424)

#define reg_gpadc1_ovflow                                          (*(volatile uint32_t *)0x60020428)
#define adr_gpadc1_ovflow                                                                (0x60020428)

#define reg_gpadc1_samp_set_cfg                                    (*(volatile uint32_t *)0x6002042c)
#define adr_gpadc1_samp_set_cfg                                                          (0x6002042c)
#define mask_gpadc1_samp_set_cfg_pwm_sel                             (0x1c0)                         
#define mask_gpadc1_samp_set_cfg_samp_mode_sel                       (0x30)                          
#define mask_gpadc1_samp_set_cfg_type_sel                            (0xf)                           

#define reg_gpadc1_en                                              (*(volatile uint32_t *)0x60020430)
#define adr_gpadc1_en                                                                    (0x60020430)

#define reg_gpadc1_data_test_cfg                                   (*(volatile uint32_t *)0x60020454)
#define adr_gpadc1_data_test_cfg                                                         (0x60020454)
#define mask_gpadc1_data_test_cfg_test_in_en                         (0x400)                         
#define mask_gpadc1_data_test_cfg_test_data                          (0x3ff)                         

#define reg_gpadc1_ch_en                                           (*(volatile uint32_t *)0x60020458)
#define adr_gpadc1_ch_en                                                                 (0x60020458)

#define reg_gpadc1_ch_wait_pcycle                                  (*(volatile uint32_t *)0x6002045c)
#define adr_gpadc1_ch_wait_pcycle                                                        (0x6002045c)

#define reg_gpadc1_samp_num                                        (*(volatile uint32_t *)0x60020460)
#define adr_gpadc1_samp_num                                                              (0x60020460)

#define reg_gpadc1_trig_reg                                        (*(volatile uint32_t *)0x60020464)
#define adr_gpadc1_trig_reg                                                              (0x60020464)
#define mask_gpadc1_trig_reg_clr_sampcnt                             (0x8)                           
#define mask_gpadc1_trig_reg_stop                                    (0x4)                           
#define mask_gpadc1_trig_reg_samp_trig                               (0x2)                           
#define mask_gpadc1_trig_reg_ch_trig                                 (0x1)                           

#define reg_gpadc1_sta_reg0                                        (*(volatile uint32_t *)0x60020468)
#define adr_gpadc1_sta_reg0                                                              (0x60020468)
#define mask_gpadc1_sta_reg0_adc_dat                                 (0xffff0000)                    
#define mask_gpadc1_sta_reg0_samp_cnt                                (0xffff)                        

#define reg_gpadc1_sta_reg1                                        (*(volatile uint32_t *)0x6002046c)
#define adr_gpadc1_sta_reg1                                                              (0x6002046c)
#define mask_gpadc1_sta_reg1_fifo_cnt                                (0x3c0000)                      
#define mask_gpadc1_sta_reg1_fsm                                     (0x38000)                       
#define mask_gpadc1_sta_reg1_aud_sta                                 (0x7fff)                        


//---------------------------------------------------
// i2s_seca in  domain address definition
//---------------------------------------------------

#define reg_i2s_seca_rx_fifo                                       (*(volatile uint32_t *)0x6002d000)
#define adr_i2s_seca_rx_fifo                                                             (0x6002d000)

#define reg_i2s_seca_tx_fifo                                       (*(volatile uint32_t *)0x6002d004)
#define adr_i2s_seca_tx_fifo                                                             (0x6002d004)


//---------------------------------------------------
// i2s in  domain address definition
//---------------------------------------------------

#define reg_i2s_intr_state                                         (*(volatile uint32_t *)0x6002d008)
#define adr_i2s_intr_state                                                               (0x6002d008)

#define reg_i2s_intr_clr                                           (*(volatile uint32_t *)0x6002d010)
#define adr_i2s_intr_clr                                                                 (0x6002d010)

#define reg_i2s_intr_mask                                          (*(volatile uint32_t *)0x6002d014)
#define adr_i2s_intr_mask                                                                (0x6002d014)

#define reg_i2s_config                                             (*(volatile uint32_t *)0x6002d018)
#define adr_i2s_config                                                                   (0x6002d018)
#define mask_i2s_config_rx_lr_exg_en                                 (0x40000)                       
#define mask_i2s_config_reserve                                      (0x38000)                       
#define mask_i2s_config_mclk_en                                      (0x4000)                        
#define mask_i2s_config_xo_32m_n16m                                  (0x2000)                        
#define mask_i2s_config_fs_num                                       (0x1800)                        
#define mask_i2s_config_master_slave                                 (0x400)                         
#define mask_i2s_config_mclk_div                                     (0x300)                         
#define mask_i2s_config_ch_mask                                      (0xc0)                          
#define mask_i2s_config_data_length                                  (0x30)                          
#define mask_i2s_config_data_format                                  (0xc)                           
#define mask_i2s_config_wclk_inv                                     (0x2)                           
#define mask_i2s_config_smpl_edge                                    (0x1)                           

#define reg_i2s_config2                                            (*(volatile uint32_t *)0x6002d01c)
#define adr_i2s_config2                                                                  (0x6002d01c)
#define mask_i2s_config2_tx_en                                       (0x200)                         
#define mask_i2s_config2_rx_en                                       (0x100)                         
#define mask_i2s_config2_wclk_width                                  (0xff)                          

#define reg_i2s_ext_cg_en                                          (*(volatile uint32_t *)0x6002d020)
#define adr_i2s_ext_cg_en                                                                (0x6002d020)


//---------------------------------------------------
// cic0 in  domain address definition
//---------------------------------------------------

#define reg_cic0_fifo                                              (*(volatile uint32_t *)0x6002e000)
#define adr_cic0_fifo                                                                    (0x6002e000)


//---------------------------------------------------
// cic0 in  domain address definition
//---------------------------------------------------

#define reg_cic0_downsp                                            (*(volatile uint32_t *)0x6002e004)
#define adr_cic0_downsp                                                                  (0x6002e004)

#define reg_cic0_coeff_0                                           (*(volatile uint32_t *)0x6002e008)
#define adr_cic0_coeff_0                                                                 (0x6002e008)

#define reg_cic0_coeff_1                                           (*(volatile uint32_t *)0x6002e00c)
#define adr_cic0_coeff_1                                                                 (0x6002e00c)

#define reg_cic0_coeff_2                                           (*(volatile uint32_t *)0x6002e010)
#define adr_cic0_coeff_2                                                                 (0x6002e010)

