EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_cic0_coeff_3                                           (*(volatile uint32_t *)0x6002e014)
#define adr_cic0_coeff_3                                                                 (0x6002e014)

#define reg_cic0_set                                               (*(volatile uint32_t *)0x6002e018)
#define adr_cic0_set                                                                     (0x6002e018)
#define mask_cic0_set_adc_zero_move_en                               (0x8000)                        
#define mask_cic0_set_en                                             (0x4000)                        
#define mask_cic0_set_pdmh_adcl_sel                                  (0x2000)                        
#define mask_cic0_set_adc_pos_sel                                    (0x1000)                        
#define mask_cic0_set_slpf_data_sel                                  (0x800)                         
#define mask_cic0_set_source_bp                                      (0x400)                         
#define mask_cic0_set_comp_bp                                        (0x200)                         
#define mask_cic0_set_slpf_bp                                        (0x100)                         
#define mask_cic0_set_slpf_bgn_flg_en                                (0x80)                          
#define mask_cic0_set_adc_org_sel                                    (0x40)                          
#define mask_cic0_set_adc_dbg_out_en                                 (0x20)                          
#define mask_cic0_set_a_rshift                                       (0x1f)                          

#define reg_cic0_sta_reg                                           (*(volatile uint32_t *)0x6002e01c)
#define adr_cic0_sta_reg                                                                 (0x6002e01c)

#define reg_cic0_int_mask                                          (*(volatile uint32_t *)0x6002e020)
#define adr_cic0_int_mask                                                                (0x6002e020)

#define reg_cic0_int_clr                                           (*(volatile uint32_t *)0x6002e024)
#define adr_cic0_int_clr                                                                 (0x6002e024)

#define reg_cic0_ovflow                                            (*(volatile uint32_t *)0x6002e028)
#define adr_cic0_ovflow                                                                  (0x6002e028)

#define reg_cic0_pdm_config                                        (*(volatile uint32_t *)0x6002e02c)
#define adr_cic0_pdm_config                                                              (0x6002e02c)
#define mask_cic0_pdm_config_pdm_rate                                (0x200)                         
#define mask_cic0_pdm_config_pdm_en                                  (0x100)                         
#define mask_cic0_pdm_config_pdm_falldge                             (0xf0)                          
#define mask_cic0_pdm_config_pdm_risedge                             (0xf)                           

#define reg_cic0_ext_cg_en                                         (*(volatile uint32_t *)0x6002e034)
#define adr_cic0_ext_cg_en                                                               (0x6002e034)


//---------------------------------------------------
// cic1 in  domain address definition
//---------------------------------------------------

#define reg_cic1_fifo                                              (*(volatile uint32_t *)0x6002e400)
#define adr_cic1_fifo                                                                    (0x6002e400)


//---------------------------------------------------
// cic1 in  domain address definition
//---------------------------------------------------

#define reg_cic1_downsp                                            (*(volatile uint32_t *)0x6002e404)
#define adr_cic1_downsp                                                                  (0x6002e404)

#define reg_cic1_coeff_0                                           (*(volatile uint32_t *)0x6002e408)
#define adr_cic1_coeff_0                                                                 (0x6002e408)

#define reg_cic1_coeff_1                                           (*(volatile uint32_t *)0x6002e40c)
#define adr_cic1_coeff_1                                                                 (0x6002e40c)

#define reg_cic1_coeff_2                                           (*(volatile uint32_t *)0x6002e410)
#define adr_cic1_coeff_2                                                                 (0x6002e410)

#define reg_cic1_coeff_3                                           (*(volatile uint32_t *)0x6002e414)
#define adr_cic1_coeff_3                                                                 (0x6002e414)

#define reg_cic1_set                                               (*(volatile uint32_t *)0x6002e418)
#define adr_cic1_set                                                                     (0x6002e418)
#define mask_cic1_set_adc_zero_move_en                               (0x8000)                        
#define mask_cic1_set_en                                             (0x4000)                        
#define mask_cic1_set_pdmh_adcl_sel                                  (0x2000)                        
#define mask_cic1_set_adc_pos_sel                                    (0x1000)                        
#define mask_cic1_set_slpf_data_sel                                  (0x800)                         
#define mask_cic1_set_source_bp                                      (0x400)                         
#define mask_cic1_set_comp_bp                                        (0x200)                         
#define mask_cic1_set_slpf_bp                                        (0x100)                         
#define mask_cic1_set_slpf_bgn_flg_en                                (0x80)                          
#define mask_cic1_set_adc_org_sel                                    (0x40)                          
#define mask_cic1_set_adc_dbg_out_en                                 (0x20)                          
#define mask_cic1_set_a_rshift                                       (0x1f)                          

