EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_cic1_sta_reg                                           (*(volatile uint32_t *)0x6002e41c)
#define adr_cic1_sta_reg                                                                 (0x6002e41c)

#define reg_cic1_int_mask                                          (*(volatile uint32_t *)0x6002e420)
#define adr_cic1_int_mask                                                                (0x6002e420)

#define reg_cic1_int_clr                                           (*(volatile uint32_t *)0x6002e424)
#define adr_cic1_int_clr                                                                 (0x6002e424)

#define reg_cic1_ovflow                                            (*(volatile uint32_t *)0x6002e428)
#define adr_cic1_ovflow                                                                  (0x6002e428)

#define reg_cic1_pdm_config                                        (*(volatile uint32_t *)0x6002e42c)
#define adr_cic1_pdm_config                                                              (0x6002e42c)
#define mask_cic1_pdm_config_pdm_rate                                (0x200)                         
#define mask_cic1_pdm_config_pdm_en                                  (0x100)                         
#define mask_cic1_pdm_config_pdm_falldge                             (0xf0)                          
#define mask_cic1_pdm_config_pdm_risedge                             (0xf)                           

#define reg_cic1_ext_cg_en                                         (*(volatile uint32_t *)0x6002e434)
#define adr_cic1_ext_cg_en                                                               (0x6002e434)


//---------------------------------------------------
// efuse in  domain address definition
//---------------------------------------------------

#define reg_efuse_soft_cmd                                         (*(volatile uint32_t *)0x6002f400)
#define adr_efuse_soft_cmd                                                               (0x6002f400)
#define mask_efuse_soft_cmd_flg_clr                                  (0x2)                           
#define mask_efuse_soft_cmd_program                                  (0x1)                           

#define reg_efuse_cmd_time                                         (*(volatile uint32_t *)0x6002f404)
#define adr_efuse_cmd_time                                                               (0x6002f404)
#define mask_efuse_cmd_time_tpd_csb_time                             (0xf0000)                       
#define mask_efuse_cmd_time_trpw_time                                (0xc000)                        
#define mask_efuse_cmd_time_tpi_time                                 (0x3f00)                        
#define mask_efuse_cmd_time_tpp_time                                 (0xff)                          

#define reg_efuse_cmd_adrs                                         (*(volatile uint32_t *)0x6002f408)
#define adr_efuse_cmd_adrs                                                               (0x6002f408)
#define mask_efuse_cmd_adrs_adr                                      (0x3f)                          

#define reg_efuse_wdata                                            (*(volatile uint32_t *)0x6002f40c)
#define adr_efuse_wdata                                                                  (0x6002f40c)

#define reg_efuse_2p5v_en                                          (*(volatile uint32_t *)0x6002f410)
#define adr_efuse_2p5v_en                                                                (0x6002f410)

#define reg_efuse_end                                              (*(volatile uint32_t *)0x6002f414)
#define adr_efuse_end                                                                    (0x6002f414)

#define reg_efuse_ext_cg_en                                        (*(volatile uint32_t *)0x6002f418)
#define adr_efuse_ext_cg_en                                                              (0x6002f418)


//---------------------------------------------------
// qdec in  domain address definition
//---------------------------------------------------

#define reg_qdec_int_status                                        (*(volatile uint32_t *)0x60030000)
#define adr_qdec_int_status                                                              (0x60030000)

#define reg_qdec_int_en                                            (*(volatile uint32_t *)0x60030004)
#define adr_qdec_int_en                                                                  (0x60030004)

#define reg_qdec_int_clear                                         (*(volatile uint32_t *)0x60030008)
#define adr_qdec_int_clear                                                               (0x60030008)

#define reg_qdec_qdec_ctrl                                         (*(volatile uint32_t *)0x6003000c)
#define adr_qdec_qdec_ctrl                                                               (0x6003000c)
#define mask_qdec_qdec_ctrl_chx_dir_pol                              (0x4)                           
#define mask_qdec_qdec_ctrl_chx_deb_en                               (0x2)                           
#define mask_qdec_qdec_ctrl_chx_en                                   (0x1)                           

#define reg_qdec_chx_led_pol                                       (*(volatile uint32_t *)0x60030010)
#define adr_qdec_chx_led_pol                                                             (0x60030010)

#define reg_qdec_chx_led_per                                       (*(volatile uint32_t *)0x60030014)
#define adr_qdec_chx_led_per                                                             (0x60030014)

#define reg_qdec_qdec_sample_per                                   (*(volatile uint32_t *)0x60030018)
#define adr_qdec_qdec_sample_per                                                         (0x60030018)
#define mask_qdec_qdec_sample_per_chx_sample_per                     (0x1fffff)                      

#define reg_qdec_chx_sample_acc                                    (*(volatile uint32_t *)0x6003001c)
#define adr_qdec_chx_sample_acc                                                          (0x6003001c)

#define reg_qdec_chx_sample_acc_dbl                                (*(volatile uint32_t *)0x60030020)
#define adr_qdec_chx_sample_acc_dbl                                                      (0x60030020)

#define reg_qdec_chx_sample_acc_no_change                          (*(volatile uint32_t *)0x60030024)
#define adr_qdec_chx_sample_acc_no_change                                                (0x60030024)

#define reg_qdec_chx_sample_rlt                                    (*(volatile uint32_t *)0x60030028)
#define adr_qdec_chx_sample_rlt                                                          (0x60030028)

#define reg_qdec_qdec_clr                                          (*(volatile uint32_t *)0x6003002c)
#define adr_qdec_qdec_clr                                                                (0x6003002c)
#define mask_qdec_qdec_clr_chx_acc_no_change_clr                     (0x4)                           
#define mask_qdec_qdec_clr_chx_acc_dbl_clr                           (0x2)                           
#define mask_qdec_qdec_clr_chx_acc_clr                               (0x1)                           

#define reg_qdec_chx_acc                                           (*(volatile uint32_t *)0x60030030)
#define adr_qdec_chx_acc                                                                 (0x60030030)

#define reg_qdec_chx_acc_dbl                                       (*(volatile uint32_t *)0x60030034)
#define adr_qdec_chx_acc_dbl                                                             (0x60030034)

