EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpt1_gpt_tim_decinval                                  (*(volatile uint32_t *)0x6003302c)
#define adr_gpt1_gpt_tim_decinval                                                        (0x6003302c)
#define mask_gpt1_gpt_tim_decinval_tim_cnta_decode_intval            (0xff00)                        
#define mask_gpt1_gpt_tim_decinval_tim_cntb_decode_intval            (0xff)                          

#define reg_gpt1_gpt_tim_pwmcnt_low                                (*(volatile uint32_t *)0x60033030)
#define adr_gpt1_gpt_tim_pwmcnt_low                                                      (0x60033030)
#define mask_gpt1_gpt_tim_pwmcnt_low_tim_cnta_pwm_low                (0xffff0000)                    
#define mask_gpt1_gpt_tim_pwmcnt_low_tim_cntb_pwm_low                (0xffff)                        

#define reg_gpt1_gpt_tim_pwmcnt_high                               (*(volatile uint32_t *)0x60033034)
#define adr_gpt1_gpt_tim_pwmcnt_high                                                     (0x60033034)
#define mask_gpt1_gpt_tim_pwmcnt_high_tim_cnta_pwm_high              (0xffff0000)                    
#define mask_gpt1_gpt_tim_pwmcnt_high_tim_cntb_pwm_high              (0xffff)                        

#define reg_gpt1_gpt_tim_cntb_int_status                           (*(volatile uint32_t *)0x60033038)
#define adr_gpt1_gpt_tim_cntb_int_status                                                 (0x60033038)

#define reg_gpt1_gpt_tim_cntb_int_clear                            (*(volatile uint32_t *)0x6003303c)
#define adr_gpt1_gpt_tim_cntb_int_clear                                                  (0x6003303c)

#define reg_gpt1_gpt_tim_cntb_int_mask                             (*(volatile uint32_t *)0x60033040)
#define adr_gpt1_gpt_tim_cntb_int_mask                                                   (0x60033040)
#define mask_gpt1_gpt_tim_cntb_int_mask_tim_cntb_wkup_mask           (0x3e0)                         
#define mask_gpt1_gpt_tim_cntb_int_mask_gpt_cntb_int_mask            (0x1f)                          

#define reg_gpt1_gpt_tim_cnta_int_status                           (*(volatile uint32_t *)0x60033044)
#define adr_gpt1_gpt_tim_cnta_int_status                                                 (0x60033044)

#define reg_gpt1_gpt_tim_cnta_int_clear                            (*(volatile uint32_t *)0x60033048)
#define adr_gpt1_gpt_tim_cnta_int_clear                                                  (0x60033048)

#define reg_gpt1_gpt_tim_cnta_int_mask                             (*(volatile uint32_t *)0x6003304c)
#define adr_gpt1_gpt_tim_cnta_int_mask                                                   (0x6003304c)
#define mask_gpt1_gpt_tim_cnta_int_mask_tim_cnta_wkup_mask           (0x3e0)                         
#define mask_gpt1_gpt_tim_cnta_int_mask_gpt_cnta_int_mask            (0x1f)                          

#define reg_gpt1_gpt_tim_cnta_ctrl                                 (*(volatile uint32_t *)0x60033050)
#define adr_gpt1_gpt_tim_cnta_ctrl                                                       (0x60033050)
#define mask_gpt1_gpt_tim_cnta_ctrl_cnta_cpu_cap_en                  (0x10)                          
#define mask_gpt1_gpt_tim_cnta_ctrl_cnta_sync_start_en               (0x8)                           
#define mask_gpt1_gpt_tim_cnta_ctrl_cnta_sync_stop_en                (0x4)                           
#define mask_gpt1_gpt_tim_cnta_ctrl_cnta_level_instruct_en           (0x2)                           
#define mask_gpt1_gpt_tim_cnta_ctrl_cnta_compare_delay_en            (0x1)                           

#define reg_gpt1_gpt_tim_cntb_ctrl                                 (*(volatile uint32_t *)0x60033054)
#define adr_gpt1_gpt_tim_cntb_ctrl                                                       (0x60033054)
#define mask_gpt1_gpt_tim_cntb_ctrl_cntb_cpu_cap_en                  (0x10)                          
#define mask_gpt1_gpt_tim_cntb_ctrl_cntb_sync_start_en               (0x8)                           
#define mask_gpt1_gpt_tim_cntb_ctrl_cntb_sync_stop_en                (0x4)                           
#define mask_gpt1_gpt_tim_cntb_ctrl_cntb_level_instruct_en           (0x2)                           
#define mask_gpt1_gpt_tim_cntb_ctrl_cntb_compare_delay_en            (0x1)                           

#define reg_gpt1_gpt_tim_cnta_work_flg                             (*(volatile uint32_t *)0x60033058)
#define adr_gpt1_gpt_tim_cnta_work_flg                                                   (0x60033058)
#define mask_gpt1_gpt_tim_cnta_work_flg_cnta_work_flg                (0x2)                           
#define mask_gpt1_gpt_tim_cnta_work_flg_cnta_inc_flg                 (0x1)                           

#define reg_gpt1_gpt_tim_cntb_work_flg                             (*(volatile uint32_t *)0x6003305c)
#define adr_gpt1_gpt_tim_cntb_work_flg                                                   (0x6003305c)
#define mask_gpt1_gpt_tim_cntb_work_flg_cntb_work_flg                (0x2)                           
#define mask_gpt1_gpt_tim_cntb_work_flg_cntb_inc_flg                 (0x1)                           

#define reg_gpt1_wakeup_flg                                        (*(volatile uint32_t *)0x60033060)
#define adr_gpt1_wakeup_flg                                                              (0x60033060)

#define reg_gpt1_ext_cg_en                                         (*(volatile uint32_t *)0x60033084)
#define adr_gpt1_ext_cg_en                                                               (0x60033084)


//---------------------------------------------------
// gpt2 in  domain address definition
//---------------------------------------------------

#define reg_gpt2_gpt_tim_cfgrdy_trig                               (*(volatile uint32_t *)0x6003b000)
#define adr_gpt2_gpt_tim_cfgrdy_trig                                                     (0x6003b000)
#define mask_gpt2_gpt_tim_cfgrdy_trig_tim_cnta_cfgrdy_trig           (0x2)                           
#define mask_gpt2_gpt_tim_cfgrdy_trig_tim_cntb_cfgrdy_trig           (0x1)                           

