EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpt2_gpt_tim_cfgrdy_flag                               (*(volatile uint32_t *)0x6003b004)
#define adr_gpt2_gpt_tim_cfgrdy_flag                                                     (0x6003b004)
#define mask_gpt2_gpt_tim_cfgrdy_flag_tim_cnta_cfgrdy_flag           (0x2)                           
#define mask_gpt2_gpt_tim_cfgrdy_flag_tim_cntb_cfgrdy_flag           (0x1)                           

#define reg_gpt2_gpt_tim_cfgrdy_clr                                (*(volatile uint32_t *)0x6003b008)
#define adr_gpt2_gpt_tim_cfgrdy_clr                                                      (0x6003b008)
#define mask_gpt2_gpt_tim_cfgrdy_clr_tim_cnta_cfgrdy_clr             (0x2)                           
#define mask_gpt2_gpt_tim_cfgrdy_clr_tim_cntb_cfgrdy_clr             (0x1)                           

#define reg_gpt2_gpt_tim_mode                                      (*(volatile uint32_t *)0x6003b00c)
#define adr_gpt2_gpt_tim_mode                                                            (0x6003b00c)
#define mask_gpt2_gpt_tim_mode_ir_out_1_en                           (0x80)                          
#define mask_gpt2_gpt_tim_mode_ir_out_0_en                           (0x40)                          
#define mask_gpt2_gpt_tim_mode_tim_decode_cap_loop                   (0x20)                          
#define mask_gpt2_gpt_tim_mode_ir_enable                             (0x10)                          
#define mask_gpt2_gpt_tim_mode_ir_pol                                (0x8)                           
#define mask_gpt2_gpt_tim_mode_tim_work_mode                         (0x7)                           

#define reg_gpt2_gpt_tim_config                                    (*(volatile uint32_t *)0x6003b010)
#define adr_gpt2_gpt_tim_config                                                          (0x6003b010)
#define mask_gpt2_gpt_tim_config_tim_cnta_pwm_enable                 (0x80000000)                    
#define mask_gpt2_gpt_tim_config_tim_cnta_pwm_pol                    (0x40000000)                    
#define mask_gpt2_gpt_tim_config_tim_cnta_decode_enable              (0x20000000)                    
#define mask_gpt2_gpt_tim_config_tim_cnta_decode_gpout_pol           (0x10000000)                    
#define mask_gpt2_gpt_tim_config_tim_cnta_decode_mode_sel            (0xc000000)                     
#define mask_gpt2_gpt_tim_config_tim_cnta_cap_enable                 (0x2000000)                     
#define mask_gpt2_gpt_tim_config_tim_cnta_cap_sig_sel                (0x1000000)                     
#define mask_gpt2_gpt_tim_config_tim_cnta_cap_mode_sel               (0xc00000)                      
#define mask_gpt2_gpt_tim_config_tim_cnta_prescale                   (0x3c0000)                      
#define mask_gpt2_gpt_tim_config_tim_cnta_rst_mode                   (0x20000)                       
#define mask_gpt2_gpt_tim_config_tim_cnta_rstval_mode                (0x10000)                       
#define mask_gpt2_gpt_tim_config_tim_cntb_pwm_enable                 (0x8000)                        
#define mask_gpt2_gpt_tim_config_tim_cntb_pwm_pol                    (0x4000)                        
#define mask_gpt2_gpt_tim_config_tim_cntb_decode_enable              (0x2000)                        
#define mask_gpt2_gpt_tim_config_tim_cntb_decode_gpout_pol           (0x1000)                        
#define mask_gpt2_gpt_tim_config_tim_cntb_decode_mode_sel            (0xc00)                         
#define mask_gpt2_gpt_tim_config_tim_cntb_cap_enable                 (0x200)                         
#define mask_gpt2_gpt_tim_config_tim_cntb_cap_sig_sel                (0x100)                         
#define mask_gpt2_gpt_tim_config_tim_cntb_cap_mode_sel               (0xc0)                          
#define mask_gpt2_gpt_tim_config_tim_cntb_prescale                   (0x3c)                          
#define mask_gpt2_gpt_tim_config_tim_cntb_rst_mode                   (0x2)                           
#define mask_gpt2_gpt_tim_config_tim_cntb_rstval_mode                (0x1)                           

#define reg_gpt2_gpt_tim_trig                                      (*(volatile uint32_t *)0x6003b014)
#define adr_gpt2_gpt_tim_trig                                                            (0x6003b014)
#define mask_gpt2_gpt_tim_trig_tim_cnta_clr                          (0x40)                          
#define mask_gpt2_gpt_tim_trig_tim_cnta_stop                         (0x20)                          
#define mask_gpt2_gpt_tim_trig_tim_cnta_start                        (0x10)                          
#define mask_gpt2_gpt_tim_trig_tim_cntb_clr                          (0x4)                           
#define mask_gpt2_gpt_tim_trig_tim_cntb_stop                         (0x2)                           
#define mask_gpt2_gpt_tim_trig_tim_cntb_start                        (0x1)                           

#define reg_gpt2_gpt_tim_cnt                                       (*(volatile uint32_t *)0x6003b018)
#define adr_gpt2_gpt_tim_cnt                                                             (0x6003b018)
#define mask_gpt2_gpt_tim_cnt_tim_cnta                               (0xffff0000)                    
#define mask_gpt2_gpt_tim_cnt_tim_cntb                               (0xffff)                        

#define reg_gpt2_gpt_tim_compare                                   (*(volatile uint32_t *)0x6003b01c)
#define adr_gpt2_gpt_tim_compare                                                         (0x6003b01c)

#define reg_gpt2_gpt_tim_capcnt_32bit                              (*(volatile uint32_t *)0x6003b020)
#define adr_gpt2_gpt_tim_capcnt_32bit                                                    (0x6003b020)
#define mask_gpt2_gpt_tim_capcnt_32bit_tim_cnt32_capcnt              (0xffffffff)                    

#define reg_gpt2_gpt_tim_capcnt_a                                  (*(volatile uint32_t *)0x6003b024)
#define adr_gpt2_gpt_tim_capcnt_a                                                        (0x6003b024)
#define mask_gpt2_gpt_tim_capcnt_a_tim_cnta_capcnt                   (0xffff)                        

#define reg_gpt2_gpt_tim_capcnt_b                                  (*(volatile uint32_t *)0x6003b028)
#define adr_gpt2_gpt_tim_capcnt_b                                                        (0x6003b028)
#define mask_gpt2_gpt_tim_capcnt_b_tim_cntb_capcnt                   (0xffff)                        

