EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpt3_gpt_tim_pwmcnt_low                                (*(volatile uint32_t *)0x6003c030)
#define adr_gpt3_gpt_tim_pwmcnt_low                                                      (0x6003c030)
#define mask_gpt3_gpt_tim_pwmcnt_low_tim_cnta_pwm_low                (0xffff0000)                    
#define mask_gpt3_gpt_tim_pwmcnt_low_tim_cntb_pwm_low                (0xffff)                        

#define reg_gpt3_gpt_tim_pwmcnt_high                               (*(volatile uint32_t *)0x6003c034)
#define adr_gpt3_gpt_tim_pwmcnt_high                                                     (0x6003c034)
#define mask_gpt3_gpt_tim_pwmcnt_high_tim_cnta_pwm_high              (0xffff0000)                    
#define mask_gpt3_gpt_tim_pwmcnt_high_tim_cntb_pwm_high              (0xffff)                        

#define reg_gpt3_gpt_tim_cntb_int_status                           (*(volatile uint32_t *)0x6003c038)
#define adr_gpt3_gpt_tim_cntb_int_status                                                 (0x6003c038)

#define reg_gpt3_gpt_tim_cntb_int_clear                            (*(volatile uint32_t *)0x6003c03c)
#define adr_gpt3_gpt_tim_cntb_int_clear                                                  (0x6003c03c)

#define reg_gpt3_gpt_tim_cntb_int_mask                             (*(volatile uint32_t *)0x6003c040)
#define adr_gpt3_gpt_tim_cntb_int_mask                                                   (0x6003c040)
#define mask_gpt3_gpt_tim_cntb_int_mask_tim_cntb_wkup_mask           (0x3e0)                         
#define mask_gpt3_gpt_tim_cntb_int_mask_gpt_cntb_int_mask            (0x1f)                          

#define reg_gpt3_gpt_tim_cnta_int_status                           (*(volatile uint32_t *)0x6003c044)
#define adr_gpt3_gpt_tim_cnta_int_status                                                 (0x6003c044)

#define reg_gpt3_gpt_tim_cnta_int_clear                            (*(volatile uint32_t *)0x6003c048)
#define adr_gpt3_gpt_tim_cnta_int_clear                                                  (0x6003c048)

#define reg_gpt3_gpt_tim_cnta_int_mask                             (*(volatile uint32_t *)0x6003c04c)
#define adr_gpt3_gpt_tim_cnta_int_mask                                                   (0x6003c04c)
#define mask_gpt3_gpt_tim_cnta_int_mask_tim_cnta_wkup_mask           (0x3e0)                         
#define mask_gpt3_gpt_tim_cnta_int_mask_gpt_cnta_int_mask            (0x1f)                          

#define reg_gpt3_gpt_tim_cnta_ctrl                                 (*(volatile uint32_t *)0x6003c050)
#define adr_gpt3_gpt_tim_cnta_ctrl                                                       (0x6003c050)
#define mask_gpt3_gpt_tim_cnta_ctrl_cnta_cpu_cap_en                  (0x10)                          
#define mask_gpt3_gpt_tim_cnta_ctrl_cnta_sync_start_en               (0x8)                           
#define mask_gpt3_gpt_tim_cnta_ctrl_cnta_sync_stop_en                (0x4)                           
#define mask_gpt3_gpt_tim_cnta_ctrl_cnta_level_instruct_en           (0x2)                           
#define mask_gpt3_gpt_tim_cnta_ctrl_cnta_compare_delay_en            (0x1)                           

#define reg_gpt3_gpt_tim_cntb_ctrl                                 (*(volatile uint32_t *)0x6003c054)
#define adr_gpt3_gpt_tim_cntb_ctrl                                                       (0x6003c054)
#define mask_gpt3_gpt_tim_cntb_ctrl_cntb_cpu_cap_en                  (0x10)                          
#define mask_gpt3_gpt_tim_cntb_ctrl_cntb_sync_start_en               (0x8)                           
#define mask_gpt3_gpt_tim_cntb_ctrl_cntb_sync_stop_en                (0x4)                           
#define mask_gpt3_gpt_tim_cntb_ctrl_cntb_level_instruct_en           (0x2)                           
#define mask_gpt3_gpt_tim_cntb_ctrl_cntb_compare_delay_en            (0x1)                           

#define reg_gpt3_gpt_tim_cnta_work_flg                             (*(volatile uint32_t *)0x6003c058)
#define adr_gpt3_gpt_tim_cnta_work_flg                                                   (0x6003c058)
#define mask_gpt3_gpt_tim_cnta_work_flg_cnta_work_flg                (0x2)                           
#define mask_gpt3_gpt_tim_cnta_work_flg_cnta_inc_flg                 (0x1)                           

#define reg_gpt3_gpt_tim_cntb_work_flg                             (*(volatile uint32_t *)0x6003c05c)
#define adr_gpt3_gpt_tim_cntb_work_flg                                                   (0x6003c05c)
#define mask_gpt3_gpt_tim_cntb_work_flg_cntb_work_flg                (0x2)                           
#define mask_gpt3_gpt_tim_cntb_work_flg_cntb_inc_flg                 (0x1)                           

#define reg_gpt3_wakeup_flg                                        (*(volatile uint32_t *)0x6003c060)
#define adr_gpt3_wakeup_flg                                                              (0x6003c060)

#define reg_gpt3_ext_cg_en                                         (*(volatile uint32_t *)0x6003c084)
#define adr_gpt3_ext_cg_en                                                               (0x6003c084)


//---------------------------------------------------
// gpioir in  domain address definition
//---------------------------------------------------

#define reg_gpioir_gpio_int_status                                 (*(volatile uint32_t *)0x6004b000)
#define adr_gpioir_gpio_int_status                                                       (0x6004b000)

#define reg_gpioir_gpio_int_mask                                   (*(volatile uint32_t *)0x6004b004)
#define adr_gpioir_gpio_int_mask                                                         (0x6004b004)

#define reg_gpioir_gpio_int_clear                                  (*(volatile uint32_t *)0x6004b008)
#define adr_gpioir_gpio_int_clear                                                        (0x6004b008)

#define reg_gpio_out_status                                        (*(volatile uint32_t *)0x6004b00c)
#define adr_gpio_out_status                                                              (0x6004b00c)

#define reg_gpio_out_set                                           (*(volatile uint32_t *)0x6004b010)
#define adr_gpio_out_set                                                                 (0x6004b010)

#define reg_gpio_out_clear                                         (*(volatile uint32_t *)0x6004b014)
#define adr_gpio_out_clear                                                               (0x6004b014)

