EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio_int_pol                                           (*(volatile uint32_t *)0x6004b018)
#define adr_gpio_int_pol                                                                 (0x6004b018)

#define reg_gpio_int_edge_nlevel                                   (*(volatile uint32_t *)0x6004b01c)
#define adr_gpio_int_edge_nlevel                                                         (0x6004b01c)

#define reg_gpio_int_both_edge                                     (*(volatile uint32_t *)0x6004b020)
#define adr_gpio_int_both_edge                                                           (0x6004b020)

#define reg_gpio_int0_en                                           (*(volatile uint32_t *)0x6004b024)
#define adr_gpio_int0_en                                                                 (0x6004b024)

#define reg_gpio_int1_en                                           (*(volatile uint32_t *)0x6004b028)
#define adr_gpio_int1_en                                                                 (0x6004b028)

#define reg_gpio_int2_en                                           (*(volatile uint32_t *)0x6004b02c)
#define adr_gpio_int2_en                                                                 (0x6004b02c)

#define reg_gpio_in                                                (*(volatile uint32_t *)0x6004b030)
#define adr_gpio_in                                                                      (0x6004b030)

#define reg_gpio_pwt_pol                                           (*(volatile uint32_t *)0x6004b034)
#define adr_gpio_pwt_pol                                                                 (0x6004b034)

#define reg_gpio_pwt_en                                            (*(volatile uint32_t *)0x6004b038)
#define adr_gpio_pwt_en                                                                  (0x6004b038)

#define reg_gpioir_gpio1_int_status                                (*(volatile uint32_t *)0x6004b080)
#define adr_gpioir_gpio1_int_status                                                      (0x6004b080)

#define reg_gpioir_gpio1_int_mask                                  (*(volatile uint32_t *)0x6004b084)
#define adr_gpioir_gpio1_int_mask                                                        (0x6004b084)

#define reg_gpioir_gpio1_int_clear                                 (*(volatile uint32_t *)0x6004b088)
#define adr_gpioir_gpio1_int_clear                                                       (0x6004b088)

#define reg_gpio1_out_status                                       (*(volatile uint32_t *)0x6004b08c)
#define adr_gpio1_out_status                                                             (0x6004b08c)

#define reg_gpio1_out_set                                          (*(volatile uint32_t *)0x6004b090)
#define adr_gpio1_out_set                                                                (0x6004b090)

#define reg_gpio1_out_clear                                        (*(volatile uint32_t *)0x6004b094)
#define adr_gpio1_out_clear                                                              (0x6004b094)

#define reg_gpio1_int_pol                                          (*(volatile uint32_t *)0x6004b098)
#define adr_gpio1_int_pol                                                                (0x6004b098)

#define reg_gpio1_int_edge_nlevel                                  (*(volatile uint32_t *)0x6004b09c)
#define adr_gpio1_int_edge_nlevel                                                        (0x6004b09c)

#define reg_gpio1_int_both_edge                                    (*(volatile uint32_t *)0x6004b0a0)
#define adr_gpio1_int_both_edge                                                          (0x6004b0a0)

#define reg_gpio1_int0_en                                          (*(volatile uint32_t *)0x6004b0a4)
#define adr_gpio1_int0_en                                                                (0x6004b0a4)

#define reg_gpio1_int1_en                                          (*(volatile uint32_t *)0x6004b0a8)
#define adr_gpio1_int1_en                                                                (0x6004b0a8)

#define reg_gpio1_int2_en                                          (*(volatile uint32_t *)0x6004b0ac)
#define adr_gpio1_int2_en                                                                (0x6004b0ac)

#define reg_gpio1_in                                               (*(volatile uint32_t *)0x6004b0b0)
#define adr_gpio1_in                                                                     (0x6004b0b0)

#define reg_gpio1_pwt_pol                                          (*(volatile uint32_t *)0x6004b0b4)
#define adr_gpio1_pwt_pol                                                                (0x6004b0b4)

#define reg_gpio1_pwt_en                                           (*(volatile uint32_t *)0x6004b0b8)
#define adr_gpio1_pwt_en                                                                 (0x6004b0b8)

#define reg_gpioir_gpio2_int_status                                (*(volatile uint32_t *)0x6004b0bc)
#define adr_gpioir_gpio2_int_status                                                      (0x6004b0bc)

#define reg_gpioir_gpio2_int_mask                                  (*(volatile uint32_t *)0x6004b0c0)
#define adr_gpioir_gpio2_int_mask                                                        (0x6004b0c0)

#define reg_gpioir_gpio2_int_clear                                 (*(volatile uint32_t *)0x6004b0c4)
#define adr_gpioir_gpio2_int_clear                                                       (0x6004b0c4)

#define reg_gpio2_out_status                                       (*(volatile uint32_t *)0x6004b0c8)
#define adr_gpio2_out_status                                                             (0x6004b0c8)

#define reg_gpio2_out_set                                          (*(volatile uint32_t *)0x6004b0cc)
#define adr_gpio2_out_set                                                                (0x6004b0cc)

#define reg_gpio2_out_clear                                        (*(volatile uint32_t *)0x6004b0d0)
#define adr_gpio2_out_clear                                                              (0x6004b0d0)

#define reg_gpio2_int_pol                                          (*(volatile uint32_t *)0x6004b0d4)
#define adr_gpio2_int_pol                                                                (0x6004b0d4)

