EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio2_int_edge_nlevel                                  (*(volatile uint32_t *)0x6004b0d8)
#define adr_gpio2_int_edge_nlevel                                                        (0x6004b0d8)

#define reg_gpio2_int_both_edge                                    (*(volatile uint32_t *)0x6004b0dc)
#define adr_gpio2_int_both_edge                                                          (0x6004b0dc)

#define reg_gpio2_int0_en                                          (*(volatile uint32_t *)0x6004b0e0)
#define adr_gpio2_int0_en                                                                (0x6004b0e0)

#define reg_gpio2_int1_en                                          (*(volatile uint32_t *)0x6004b0e4)
#define adr_gpio2_int1_en                                                                (0x6004b0e4)

#define reg_gpio2_int2_en                                          (*(volatile uint32_t *)0x6004b0e8)
#define adr_gpio2_int2_en                                                                (0x6004b0e8)

#define reg_gpio2_in                                               (*(volatile uint32_t *)0x6004b0ec)
#define adr_gpio2_in                                                                     (0x6004b0ec)

#define reg_gpio2_pwt_pol                                          (*(volatile uint32_t *)0x6004b0f0)
#define adr_gpio2_pwt_pol                                                                (0x6004b0f0)

#define reg_gpio2_pwt_en                                           (*(volatile uint32_t *)0x6004b0f4)
#define adr_gpio2_pwt_en                                                                 (0x6004b0f4)

#define reg_gpio_pwt_32k_load                                      (*(volatile uint32_t *)0x6004b100)
#define adr_gpio_pwt_32k_load                                                            (0x6004b100)

#define reg_gpio_pwt_deb_config                                    (*(volatile uint32_t *)0x6004b104)
#define adr_gpio_pwt_deb_config                                                          (0x6004b104)
#define mask_gpio_pwt_deb_config_pwt_ms_n32k                         (0x40)                          
#define mask_gpio_pwt_deb_config_pwt_deb                             (0x3f)                          

#define reg_gpio_pwt_wakeup_clr                                    (*(volatile uint32_t *)0x6004b108)
#define adr_gpio_pwt_wakeup_clr                                                          (0x6004b108)

#define reg_gpio_sw_set                                            (*(volatile uint32_t *)0x6004b140)
#define adr_gpio_sw_set                                                                  (0x6004b140)
#define mask_gpio_sw_set_swdio_set                                   (0x2)                           
#define mask_gpio_sw_set_swclk_set                                   (0x1)                           

#define reg_gpio_sw_clr                                            (*(volatile uint32_t *)0x6004b144)
#define adr_gpio_sw_clr                                                                  (0x6004b144)
#define mask_gpio_sw_clr_swdio_clr                                   (0x2)                           
#define mask_gpio_sw_clr_swclk_clr                                   (0x1)                           

#define reg_gpio_swclk_config                                      (*(volatile uint32_t *)0x6004b148)
#define adr_gpio_swclk_config                                                            (0x6004b148)
#define mask_gpio_swclk_config_swclk_cs                              (0x40)                          
#define mask_gpio_swclk_config_swclk_dsh                             (0x20)                          
#define mask_gpio_swclk_config_swclk_dsl                             (0x10)                          
#define mask_gpio_swclk_config_swclk_pu                              (0x8)                           
#define mask_gpio_swclk_config_swclk_pd                              (0x4)                           
#define mask_gpio_swclk_config_swclk_ie                              (0x2)                           
#define mask_gpio_swclk_config_swclk_oe                              (0x1)                           

#define reg_gpio_swdio_config                                      (*(volatile uint32_t *)0x6004b14c)
#define adr_gpio_swdio_config                                                            (0x6004b14c)
#define mask_gpio_swdio_config_swdio_cs                              (0x40)                          
#define mask_gpio_swdio_config_swdio_dsh                             (0x20)                          
#define mask_gpio_swdio_config_swdio_dsl                             (0x10)                          
#define mask_gpio_swdio_config_swdio_pu                              (0x8)                           
#define mask_gpio_swdio_config_swdio_pd                              (0x4)                           
#define mask_gpio_swdio_config_swdio_ie                              (0x2)                           
#define mask_gpio_swdio_config_swdio_oe                              (0x1)                           

#define reg_gpio_sw_in                                             (*(volatile uint32_t *)0x6004b150)
#define adr_gpio_sw_in                                                                   (0x6004b150)
#define mask_gpio_sw_in_swdio_in                                     (0x2)                           
#define mask_gpio_sw_in_swclk_in                                     (0x1)                           

#define reg_gpio_sw_dis                                            (*(volatile uint32_t *)0x6004b154)
#define adr_gpio_sw_dis                                                                  (0x6004b154)

#define reg_gpio_m33_sw_set                                        (*(volatile uint32_t *)0x6004b158)
#define adr_gpio_m33_sw_set                                                              (0x6004b158)
#define mask_gpio_m33_sw_set_m33_swdio_set                           (0x2)                           
#define mask_gpio_m33_sw_set_m33_swclk_set                           (0x1)                           

