EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_gpio_m33_sw_clr                                        (*(volatile uint32_t *)0x6004b15c)
#define adr_gpio_m33_sw_clr                                                              (0x6004b15c)
#define mask_gpio_m33_sw_clr_m33_swdio_clr                           (0x2)                           
#define mask_gpio_m33_sw_clr_m33_swclk_clr                           (0x1)                           

#define reg_gpio_m33_swclk_config                                  (*(volatile uint32_t *)0x6004b160)
#define adr_gpio_m33_swclk_config                                                        (0x6004b160)
#define mask_gpio_m33_swclk_config_m33_swclk_cs                      (0x40)                          
#define mask_gpio_m33_swclk_config_m33_swclk_dsh                     (0x20)                          
#define mask_gpio_m33_swclk_config_m33_swclk_dsl                     (0x10)                          
#define mask_gpio_m33_swclk_config_m33_swclk_pu                      (0x8)                           
#define mask_gpio_m33_swclk_config_m33_swclk_pd                      (0x4)                           
#define mask_gpio_m33_swclk_config_m33_swclk_ie                      (0x2)                           
#define mask_gpio_m33_swclk_config_m33_swclk_oe                      (0x1)                           

#define reg_gpio_m33_swdio_config                                  (*(volatile uint32_t *)0x6004b164)
#define adr_gpio_m33_swdio_config                                                        (0x6004b164)
#define mask_gpio_m33_swdio_config_m33_swdio_cs                      (0x40)                          
#define mask_gpio_m33_swdio_config_m33_swdio_dsh                     (0x20)                          
#define mask_gpio_m33_swdio_config_m33_swdio_dsl                     (0x10)                          
#define mask_gpio_m33_swdio_config_m33_swdio_pu                      (0x8)                           
#define mask_gpio_m33_swdio_config_m33_swdio_pd                      (0x4)                           
#define mask_gpio_m33_swdio_config_m33_swdio_ie                      (0x2)                           
#define mask_gpio_m33_swdio_config_m33_swdio_oe                      (0x1)                           

#define reg_gpio_m33_sw_in                                         (*(volatile uint32_t *)0x6004b168)
#define adr_gpio_m33_sw_in                                                               (0x6004b168)
#define mask_gpio_m33_sw_in_m33_swdio_in                             (0x2)                           
#define mask_gpio_m33_sw_in_m33_swclk_in                             (0x1)                           

#define reg_gpio_m33_sw_dis                                        (*(volatile uint32_t *)0x6004b16c)
#define adr_gpio_m33_sw_dis                                                              (0x6004b16c)

#define reg_gpio_ext_cg_en                                         (*(volatile uint32_t *)0x6004b170)
#define adr_gpio_ext_cg_en                                                               (0x6004b170)

#define reg_gpio_32k_out_cfg                                       (*(volatile uint32_t *)0x6004b174)
#define adr_gpio_32k_out_cfg                                                             (0x6004b174)
#define mask_gpio_32k_out_cfg_32k_out1_oe                            (0x2)                           
#define mask_gpio_32k_out_cfg_32k_out0_oe                            (0x1)                           

#define reg_gpio_wakeup_source                                     (*(volatile uint32_t *)0x6004b178)
#define adr_gpio_wakeup_source                                                           (0x6004b178)


//---------------------------------------------------
// rtcir in  domain address definition
//---------------------------------------------------

#define reg_rtcir_rtc_int_status                                   (*(volatile uint32_t *)0x6004d000)
#define adr_rtcir_rtc_int_status                                                         (0x6004d000)

#define reg_rtcir_rtc_int_mask                                     (*(volatile uint32_t *)0x6004d004)
#define adr_rtcir_rtc_int_mask                                                           (0x6004d004)

#define reg_rtcir_rtc_int_clr                                      (*(volatile uint32_t *)0x6004d008)
#define adr_rtcir_rtc_int_clr                                                            (0x6004d008)

#define reg_rtc_int_to_cpu_ch_en                                   (*(volatile uint32_t *)0x6004d00c)
#define adr_rtc_int_to_cpu_ch_en                                                         (0x6004d00c)

#define reg_rtc_rd_frz                                             (*(volatile uint32_t *)0x6004d010)
#define adr_rtc_rd_frz                                                                   (0x6004d010)

#define reg_rtc_comp0_hi                                           (*(volatile uint32_t *)0x6004d018)
#define adr_rtc_comp0_hi                                                                 (0x6004d018)

#define reg_rtc_comp0_low                                          (*(volatile uint32_t *)0x6004d01c)
#define adr_rtc_comp0_low                                                                (0x6004d01c)

#define reg_rtc_comp1_hi                                           (*(volatile uint32_t *)0x6004d020)
#define adr_rtc_comp1_hi                                                                 (0x6004d020)

#define reg_rtc_comp1_low                                          (*(volatile uint32_t *)0x6004d024)
#define adr_rtc_comp1_low                                                                (0x6004d024)

#define reg_rtc_comp2_hi                                           (*(volatile uint32_t *)0x6004d028)
#define adr_rtc_comp2_hi                                                                 (0x6004d028)

#define reg_rtc_comp2_low                                          (*(volatile uint32_t *)0x6004d02c)
#define adr_rtc_comp2_low                                                                (0x6004d02c)

#define reg_rtc_comp3_hi                                           (*(volatile uint32_t *)0x6004d030)
#define adr_rtc_comp3_hi                                                                 (0x6004d030)

#define reg_rtc_comp3_low                                          (*(volatile uint32_t *)0x6004d034)
#define adr_rtc_comp3_low                                                                (0x6004d034)

#define reg_rtc_set_load_trig                                      (*(volatile uint32_t *)0x6004d038)
#define adr_rtc_set_load_trig                                                            (0x6004d038)
#define mask_rtc_set_load_trig_wakeup_mask_trig                      (0x10)                          
#define mask_rtc_set_load_trig_comp3_trig                            (0x8)                           
#define mask_rtc_set_load_trig_comp2_trig                            (0x4)                           
#define mask_rtc_set_load_trig_comp1_trig                            (0x2)                           
#define mask_rtc_set_load_trig_comp0_trig                            (0x1)                           

