EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_rtc_set_flg                                            (*(volatile uint32_t *)0x6004d03c)
#define adr_rtc_set_flg                                                                  (0x6004d03c)

#define reg_rtc_set_flg_clr                                        (*(volatile uint32_t *)0x6004d040)
#define adr_rtc_set_flg_clr                                                              (0x6004d040)
#define mask_rtc_set_flg_clr_prescale_set_clr                        (0x200)                         
#define mask_rtc_set_flg_clr_trigovrflw_trig_cfg_set_clr             (0x100)                         
#define mask_rtc_set_flg_clr_cnt_clr_trig_cfg_set_clr                (0x80)                          
#define mask_rtc_set_flg_clr_stp_trig_cfg_set_clr                    (0x40)                          
#define mask_rtc_set_flg_clr_sta_trig_cfg_set_clr                    (0x20)                          
#define mask_rtc_set_flg_clr_wakeup_mask_set_clr                     (0x10)                          
#define mask_rtc_set_flg_clr_comp3_set_clr                           (0x8)                           
#define mask_rtc_set_flg_clr_comp2_set_clr                           (0x4)                           
#define mask_rtc_set_flg_clr_comp1_set_clr                           (0x2)                           
#define mask_rtc_set_flg_clr_comp0_set_clr                           (0x1)                           

#define reg_rtc_cnt_hi                                             (*(volatile uint32_t *)0x6004d044)
#define adr_rtc_cnt_hi                                                                   (0x6004d044)

#define reg_rtc_cnt_low                                            (*(volatile uint32_t *)0x6004d048)
#define adr_rtc_cnt_low                                                                  (0x6004d048)

#define reg_rtc_cnt_work_flg                                       (*(volatile uint32_t *)0x6004d04c)
#define adr_rtc_cnt_work_flg                                                             (0x6004d04c)

#define reg_rtc_wakeup_flg                                         (*(volatile uint32_t *)0x6004d050)
#define adr_rtc_wakeup_flg                                                               (0x6004d050)
#define mask_rtc_wakeup_flg_chn3_pmu_wakeup_flag                     (0x8)                           
#define mask_rtc_wakeup_flg_chn2_pmu_wakeup_flag                     (0x4)                           
#define mask_rtc_wakeup_flg_chn1_pmu_wakeup_flag                     (0x2)                           
#define mask_rtc_wakeup_flg_chn0_pmu_wakeup_flag                     (0x1)                           

#define reg_rtc_ext_cg_en                                          (*(volatile uint32_t *)0x6004d074)
#define adr_rtc_ext_cg_en                                                                (0x6004d074)


//---------------------------------------------------
// rtc_pdw in  domain address definition
//---------------------------------------------------

#define reg_rtc_pdw_prescale                                       (*(volatile uint32_t *)0x6004d400)
#define adr_rtc_pdw_prescale                                                             (0x6004d400)

#define reg_rtc_pdw_cnt_trig                                       (*(volatile uint32_t *)0x6004d404)
#define adr_rtc_pdw_cnt_trig                                                             (0x6004d404)
#define mask_rtc_pdw_cnt_trig_prescale_trig                          (0x10)                          
#define mask_rtc_pdw_cnt_trig_cnt_trigovrflw                         (0x8)                           
#define mask_rtc_pdw_cnt_trig_cnt_clr                                (0x4)                           
#define mask_rtc_pdw_cnt_trig_cnt_stp                                (0x2)                           
#define mask_rtc_pdw_cnt_trig_cnt_sta                                (0x1)                           

#define reg_rtc_pdw_srst                                           (*(volatile uint32_t *)0x6004d408)
#define adr_rtc_pdw_srst                                                                 (0x6004d408)

#define reg_rtc_pdw_32k_src_sel                                    (*(volatile uint32_t *)0x6004d440)
#define adr_rtc_pdw_32k_src_sel                                                          (0x6004d440)

#define reg_rtc_pdw_dcxolf_en_cfg                                  (*(volatile uint32_t *)0x6004d444)
#define adr_rtc_pdw_dcxolf_en_cfg                                                        (0x6004d444)
#define mask_rtc_pdw_dcxolf_en_cfg_dcxolf_clk_en                     (0x2)                           
#define mask_rtc_pdw_dcxolf_en_cfg_dcxolf_en                         (0x1)                           

#define reg_rtc_pdw_dcxolf_ana_intf                                (*(volatile uint32_t *)0x6004d448)
#define adr_rtc_pdw_dcxolf_ana_intf                                                      (0x6004d448)

#define reg_rtc_pdw_dcxolf_buf_ana_intf                            (*(volatile uint32_t *)0x6004d44c)
#define adr_rtc_pdw_dcxolf_buf_ana_intf                                                  (0x6004d44c)

#define reg_rtc_pdw_32k_src_sel_state                              (*(volatile uint32_t *)0x6004d450)
#define adr_rtc_pdw_32k_src_sel_state                                                    (0x6004d450)

#define reg_rtc_pdw_dcxolf_state                                   (*(volatile uint32_t *)0x6004d454)
#define adr_rtc_pdw_dcxolf_state                                                         (0x6004d454)
#define mask_rtc_pdw_dcxolf_state_dcxolf_clk_en                      (0x2)                           
#define mask_rtc_pdw_dcxolf_state_dcxolf_en                          (0x1)                           

#define reg_rtc_pdw_dcxolf_ana_intf_state                          (*(volatile uint32_t *)0x6004d458)
#define adr_rtc_pdw_dcxolf_ana_intf_state                                                (0x6004d458)
#define mask_rtc_pdw_dcxolf_ana_intf_state_dcxolf_ana_intf           (0x3fffffff)                    

#define reg_rtc_pdw_dcxolf_buf_ana_intf_state                      (*(volatile uint32_t *)0x6004d45c)
#define adr_rtc_pdw_dcxolf_buf_ana_intf_state                                            (0x6004d45c)
#define mask_rtc_pdw_dcxolf_buf_ana_intf_state_dcxolf_buf_ana_intf   (0x3f)                          

