EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_rtc_pdw_dcxolf_cfg_valid_trig                          (*(volatile uint32_t *)0x6004d460)
#define adr_rtc_pdw_dcxolf_cfg_valid_trig                                                (0x6004d460)
#define mask_rtc_pdw_dcxolf_cfg_valid_trig_dcxolf_clk_en_trig        (0x8)                           
#define mask_rtc_pdw_dcxolf_cfg_valid_trig_dcxolf_en_trig            (0x4)                           
#define mask_rtc_pdw_dcxolf_cfg_valid_trig_dcxolf_ana_intf_trig      (0x2)                           
#define mask_rtc_pdw_dcxolf_cfg_valid_trig_32k_src_sel_trig          (0x1)                           

#define reg_rtc_pdw_ldo_ret_ana_intf                               (*(volatile uint32_t *)0x6004d488)
#define adr_rtc_pdw_ldo_ret_ana_intf                                                     (0x6004d488)
#define mask_rtc_pdw_ldo_ret_ana_intf_ldo_ret                        (0x7)                           

#define reg_rtc_pdw_ldo_ret                                        (*(volatile uint32_t *)0x6004d48c)
#define adr_rtc_pdw_ldo_ret                                                              (0x6004d48c)

#define reg_rtc_pdw_ldo_ret_trig                                   (*(volatile uint32_t *)0x6004d490)
#define adr_rtc_pdw_ldo_ret_trig                                                         (0x6004d490)

#define reg_rtc_pdw_backup_tag                                     (*(volatile uint32_t *)0x6004d4c8)
#define adr_rtc_pdw_backup_tag                                                           (0x6004d4c8)

#define reg_rtc_pdw_backup_tag_state                               (*(volatile uint32_t *)0x6004d4cc)
#define adr_rtc_pdw_backup_tag_state                                                     (0x6004d4cc)
#define mask_rtc_pdw_backup_tag_state_backup_tag                     (0xffffffff)                    

#define reg_rtc_pdw_backup_tag_trig                                (*(volatile uint32_t *)0x6004d4d0)
#define adr_rtc_pdw_backup_tag_trig                                                      (0x6004d4d0)


//---------------------------------------------------
// wdt0 in  domain address definition
//---------------------------------------------------

#define reg_wdt0_wdt_int_status                                    (*(volatile uint32_t *)0x6004e000)
#define adr_wdt0_wdt_int_status                                                          (0x6004e000)

#define reg_wdt0_wdt_int_mask                                      (*(volatile uint32_t *)0x6004e004)
#define adr_wdt0_wdt_int_mask                                                            (0x6004e004)

#define reg_wdt0_wdt_int_clear                                     (*(volatile uint32_t *)0x6004e008)
#define adr_wdt0_wdt_int_clear                                                           (0x6004e008)

#define reg_wdt0_trig_cfg                                          (*(volatile uint32_t *)0x6004e00c)
#define adr_wdt0_trig_cfg                                                                (0x6004e00c)
#define mask_wdt0_trig_cfg_rst_time_trig                             (0x10)                          
#define mask_wdt0_trig_cfg_wen_trig                                  (0x8)                           
#define mask_wdt0_trig_cfg_trigovrflw                                (0x4)                           
#define mask_wdt0_trig_cfg_comp_trig                                 (0x2)                           
#define mask_wdt0_trig_cfg_cnt_clr                                   (0x1)                           

#define reg_wdt0_ctrl                                              (*(volatile uint32_t *)0x6004e010)
#define adr_wdt0_ctrl                                                                    (0x6004e010)
#define mask_wdt0_ctrl_wen                                           (0x7f)                          

#define reg_wdt0_compare                                           (*(volatile uint32_t *)0x6004e014)
#define adr_wdt0_compare                                                                 (0x6004e014)

#define reg_wdt0_cnt_value                                         (*(volatile uint32_t *)0x6004e018)
#define adr_wdt0_cnt_value                                                               (0x6004e018)

#define reg_wdt0_rst_en_ctrl                                       (*(volatile uint32_t *)0x6004e01c)
#define adr_wdt0_rst_en_ctrl                                                             (0x6004e01c)

#define reg_wdt0_rst_gen_time                                      (*(volatile uint32_t *)0x6004e020)
#define adr_wdt0_rst_gen_time                                                            (0x6004e020)

#define reg_wdt0_trig_cfg_vld                                      (*(volatile uint32_t *)0x6004e024)
#define adr_wdt0_trig_cfg_vld                                                            (0x6004e024)

#define reg_wdt0_trig_cfg_vld_clr                                  (*(volatile uint32_t *)0x6004e028)
#define adr_wdt0_trig_cfg_vld_clr                                                        (0x6004e028)

#define reg_wdt0_ext_cg_en                                         (*(volatile uint32_t *)0x6004e02c)
#define adr_wdt0_ext_cg_en                                                               (0x6004e02c)


//---------------------------------------------------
// wdt1 in  domain address definition
//---------------------------------------------------

#define reg_wdt1_wdt_int_status                                    (*(volatile uint32_t *)0x6004e800)
#define adr_wdt1_wdt_int_status                                                          (0x6004e800)

#define reg_wdt1_wdt_int_mask                                      (*(volatile uint32_t *)0x6004e804)
#define adr_wdt1_wdt_int_mask                                                            (0x6004e804)

#define reg_wdt1_wdt_int_clear                                     (*(volatile uint32_t *)0x6004e808)
#define adr_wdt1_wdt_int_clear                                                           (0x6004e808)

#define reg_wdt1_trig_cfg                                          (*(volatile uint32_t *)0x6004e80c)
#define adr_wdt1_trig_cfg                                                                (0x6004e80c)
#define mask_wdt1_trig_cfg_rst_time_trig                             (0x10)                          
#define mask_wdt1_trig_cfg_wen_trig                                  (0x8)                           
#define mask_wdt1_trig_cfg_trigovrflw                                (0x4)                           
#define mask_wdt1_trig_cfg_comp_trig                                 (0x2)                           
#define mask_wdt1_trig_cfg_cnt_clr                                   (0x1)                           

#define reg_wdt1_ctrl                                              (*(volatile uint32_t *)0x6004e810)
#define adr_wdt1_ctrl                                                                    (0x6004e810)
#define mask_wdt1_ctrl_wen                                           (0x7f)                          

#define reg_wdt1_compare                                           (*(volatile uint32_t *)0x6004e814)
#define adr_wdt1_compare                                                                 (0x6004e814)

#define reg_wdt1_cnt_value                                         (*(volatile uint32_t *)0x6004e818)
#define adr_wdt1_cnt_value                                                               (0x6004e818)

#define reg_wdt1_rst_en_ctrl                                       (*(volatile uint32_t *)0x6004e81c)
#define adr_wdt1_rst_en_ctrl                                                             (0x6004e81c)

#define reg_wdt1_rst_gen_time                                      (*(volatile uint32_t *)0x6004e820)
#define adr_wdt1_rst_gen_time                                                            (0x6004e820)

