EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_wdt1_trig_cfg_vld                                      (*(volatile uint32_t *)0x6004e824)
#define adr_wdt1_trig_cfg_vld                                                            (0x6004e824)

#define reg_wdt1_trig_cfg_vld_clr                                  (*(volatile uint32_t *)0x6004e828)
#define adr_wdt1_trig_cfg_vld_clr                                                        (0x6004e828)

#define reg_wdt1_ext_cg_en                                         (*(volatile uint32_t *)0x6004e82c)
#define adr_wdt1_ext_cg_en                                                               (0x6004e82c)


//---------------------------------------------------
// crg in  domain address definition
//---------------------------------------------------

#define reg_crg_clk_src_ctrl                                         (*(volatile uint32_t *)0x6004f000)
#define adr_crg_clk_src_ctrl                                                               (0x6004f000)
#define mask_crg_clk_src_ctrl_pll_128m_div_val                         (0x30)                          
#define mask_crg_clk_src_ctrl_lp_clk_src_sel                           (0xc)                           
#define mask_crg_clk_src_ctrl_16m_for_32k_en                           (0x2)                           
#define mask_crg_clk_src_ctrl_dcxo_32m_16m_sel                         (0x1)                           

#define reg_crg_sys_clk_src_sel                                      (*(volatile uint32_t *)0x6004f004)
#define adr_crg_sys_clk_src_sel                                                            (0x6004f004)

#define reg_crg_sys_sel                                              (*(volatile uint32_t *)0x6004f008)
#define adr_crg_sys_sel                                                                    (0x6004f008)
#define mask_crg_sys_sel_clk_sys_pll_sel                               (0x8)                           
#define mask_crg_sys_sel_clk_sys_dcxo_div2_sel                         (0x4)                           
#define mask_crg_sys_sel_clk_sys_dcxo_sel                              (0x2)                           
#define mask_crg_sys_sel_clk_sys_rc16m_sel                             (0x1)                           

#define reg_crg_clk_src_div_val_real_sta                             (*(volatile uint32_t *)0x6004f00c)
#define adr_crg_clk_src_div_val_real_sta                                                   (0x6004f00c)
#define mask_crg_clk_src_div_val_real_sta_cpto1_ahb_core_div_val_real  (0x1c000)                       
#define mask_crg_clk_src_div_val_real_sta_cpto0_ahb_core_div_val_real  (0x3800)                        
#define mask_crg_clk_src_div_val_real_sta_ahb_llc_16m_div_val_real     (0x700)                         
#define mask_crg_clk_src_div_val_real_sta_m0_ahb_core_div_val_real     (0xe0)                          
#define mask_crg_clk_src_div_val_real_sta_ahb_apb_div_val_real         (0x1c)                          
#define mask_crg_clk_src_div_val_real_sta_sys_ahb_div_val_real         (0x3)                           

#define reg_crg_clk_div_ctrl0                                        (*(volatile uint32_t *)0x6004f010)
#define adr_crg_clk_div_ctrl0                                                              (0x6004f010)
#define mask_crg_clk_div_ctrl0_cpto1_ahb_core_div_val                  (0xe000000)                     
#define mask_crg_clk_div_ctrl0_sys_div_16m_val                         (0x1c00000)                     
#define mask_crg_clk_div_ctrl0_rc16m_sys_pmu_div_val                   (0x380000)                      
#define mask_crg_clk_div_ctrl0_lp_div_val                              (0x60000)                       
#define mask_crg_clk_div_ctrl0_pwt_lp_div_val                          (0x1c000)                       
#define mask_crg_clk_div_ctrl0_cpto0_ahb_core_div_val                  (0x3800)                        
#define mask_crg_clk_div_ctrl0_ahb_llc_16m_div_val                     (0x700)                         
#define mask_crg_clk_div_ctrl0_m0_ahb_core_div_val                     (0xe0)                          
#define mask_crg_clk_div_ctrl0_ahb_apb_div_val                         (0x1c)                          
#define mask_crg_clk_div_ctrl0_sys_ahb_div_val                         (0x3)                           

#define reg_crg_clk_div_ctrl1                                        (*(volatile uint32_t *)0x6004f014)
#define adr_crg_clk_div_ctrl1                                                              (0x6004f014)
#define mask_crg_clk_div_ctrl1_dcxo_fix_16m_div_val                    (0x3e000000)                    
#define mask_crg_clk_div_ctrl1_ana_test_clk_sel                        (0x1e00000)                     
#define mask_crg_clk_div_ctrl1_sys_div_out_div_val                     (0x1e0000)                      
#define mask_crg_clk_div_ctrl1_gtim3_clk_src_sel                       (0x18000)                       
#define mask_crg_clk_div_ctrl1_gtim2_clk_src_sel                       (0x6000)                        
#define mask_crg_clk_div_ctrl1_gtim1_clk_src_sel                       (0x1800)                        
#define mask_crg_clk_div_ctrl1_gtim0_clk_src_sel                       (0x600)                         
#define mask_crg_clk_div_ctrl1_aud0_clk_src_sel                        (0x100)                         
#define mask_crg_clk_div_ctrl1_sys_div_aud0_val                        (0xff)                          

#define reg_crg_clk_div_ctrl2                                        (*(volatile uint32_t *)0x6004f018)
#define adr_crg_clk_div_ctrl2                                                              (0x6004f018)
#define mask_crg_clk_div_ctrl2_rc48m_div3_en                           (0x20000000)                    
#define mask_crg_clk_div_ctrl2_aud1_clk_src_sel                        (0x10000000)                    
#define mask_crg_clk_div_ctrl2_sys_div_aud1_val                        (0xff00000)                     
#define mask_crg_clk_div_ctrl2_qspi3_sys_clk_src_sel                   (0xc0000)                       
#define mask_crg_clk_div_ctrl2_qspi3_sys_div_val                       (0x38000)                       
#define mask_crg_clk_div_ctrl2_qspi2_sys_clk_src_sel                   (0x6000)                        
#define mask_crg_clk_div_ctrl2_qspi2_sys_div_val                       (0x1c00)                        
#define mask_crg_clk_div_ctrl2_qspi1_sys_clk_src_sel                   (0x300)                         
#define mask_crg_clk_div_ctrl2_qspi1_sys_div_val                       (0xe0)                          
#define mask_crg_clk_div_ctrl2_qspi0_sys_clk_src_sel                   (0x18)                          
#define mask_crg_clk_div_ctrl2_rc16m_qspi0_sys_div_val                 (0x7)                           

#define reg_crg_ext_clk_gate_ctrl0                                   (*(volatile uint32_t *)0x6004f01c)
#define adr_crg_ext_clk_gate_ctrl0                                                         (0x6004f01c)
#define mask_crg_ext_clk_gate_ctrl0_dcxo_32k_out_ext_cg_en             (0x80000000)                    
#define mask_crg_ext_clk_gate_ctrl0_cali_ext_cg_en                     (0x40000000)                    
#define mask_crg_ext_clk_gate_ctrl0_ahb5_ext_cg_en                     (0x20000000)                    
#define mask_crg_ext_clk_gate_ctrl0_ahb4_ext_cg_en                     (0x10000000)                    
#define mask_crg_ext_clk_gate_ctrl0_efuse_ext_cg_en                    (0x8000000)                     
#define mask_crg_ext_clk_gate_ctrl0_rtc_ext_cg_en                      (0x4000000)                     
#define mask_crg_ext_clk_gate_ctrl0_llc_lp_ext_cg_en                   (0x2000000)                     
#define mask_crg_ext_clk_gate_ctrl0_pwt_ext_cg_en                      (0x1000000)                     
#define mask_crg_ext_clk_gate_ctrl0_wdt0_ext_cg_en                     (0x800000)                      
#define mask_crg_ext_clk_gate_ctrl0_qspi3_ext_cg_en                    (0x400000)                      
#define mask_crg_ext_clk_gate_ctrl0_qspi2_ext_cg_en                    (0x200000)                      
#define mask_crg_ext_clk_gate_ctrl0_qspi1_ext_cg_en                    (0x100000)                      
#define mask_crg_ext_clk_gate_ctrl0_qspi0_ext_cg_en                    (0x80000)                       
#define mask_crg_ext_clk_gate_ctrl0_m0_h2h_ahb_ext_cg_en               (0x40000)                       
#define mask_crg_ext_clk_gate_ctrl0_trng_ext_cg_en                     (0x20000)                       
#define mask_crg_ext_clk_gate_ctrl0_cpto0_ext_cg_en                    (0x10000)                       
#define mask_crg_ext_clk_gate_ctrl0_llc_ext_cg_en                      (0x8000)                        
#define mask_crg_ext_clk_gate_ctrl0_aud_adc0_ext_cg_en                 (0x4000)                        
#define mask_crg_ext_clk_gate_ctrl0_gtim3_ext_cg_en                    (0x2000)                        
#define mask_crg_ext_clk_gate_ctrl0_gtim2_ext_cg_en                    (0x1000)                        
#define mask_crg_ext_clk_gate_ctrl0_gtim1_ext_cg_en                    (0x800)                         
#define mask_crg_ext_clk_gate_ctrl0_gtim0_ext_cg_en                    (0x400)                         
#define mask_crg_ext_clk_gate_ctrl0_usb_ext_cg_en                      (0x200)                         
#define mask_crg_ext_clk_gate_ctrl0_qdec_ext_cg_en                     (0x100)                         
#define mask_crg_ext_clk_gate_ctrl0_spi1_ext_cg_en                     (0x80)                          
#define mask_crg_ext_clk_gate_ctrl0_spi0_ext_cg_en                     (0x40)                          
#define mask_crg_ext_clk_gate_ctrl0_i2c2_ext_cg_en                     (0x20)                          
#define mask_crg_ext_clk_gate_ctrl0_i2c1_ext_cg_en                     (0x10)                          
#define mask_crg_ext_clk_gate_ctrl0_i2c0_ext_cg_en                     (0x8)                           
#define mask_crg_ext_clk_gate_ctrl0_uart2_ext_cg_en                    (0x4)                           
#define mask_crg_ext_clk_gate_ctrl0_uart1_ext_cg_en                    (0x2)                           
#define mask_crg_ext_clk_gate_ctrl0_uart0_ext_cg_en                    (0x1)                           

#define reg_crg_ext_clk_gate_ctrl1                                   (*(volatile uint32_t *)0x6004f020)
#define adr_crg_ext_clk_gate_ctrl1                                                         (0x6004f020)
#define mask_crg_ext_clk_gate_ctrl1_cpto1_h2h_ext_cg_en                (0x20000000)                    
#define mask_crg_ext_clk_gate_ctrl1_cpto1_ext_cg_en                    (0x10000000)                    
#define mask_crg_ext_clk_gate_ctrl1_pd_snc_ahb_ext_cg_en               (0x8000000)                     
#define mask_crg_ext_clk_gate_ctrl1_stim1_ext_cg_en                    (0x4000000)                     
#define mask_crg_ext_clk_gate_ctrl1_stim0_ext_cg_en                    (0x2000000)                     
#define mask_crg_ext_clk_gate_ctrl1_wdt1_ext_cg_en                     (0x1000000)                     
#define mask_crg_ext_clk_gate_ctrl1_aud_adc1_ext_cg_en                 (0x800000)                      
#define mask_crg_ext_clk_gate_ctrl1_cpto0_h2h_ext_cg_en                (0x400000)                      
#define mask_crg_ext_clk_gate_ctrl1_i2c3_ext_cg_en                     (0x200000)                      
#define mask_crg_ext_clk_gate_ctrl1_dma_ext_cg_en                      (0x100000)                      
#define mask_crg_ext_clk_gate_ctrl1_rom_ext_cg_en                      (0x80000)                       
#define mask_crg_ext_clk_gate_ctrl1_sram_ext_cg_en                     (0x40000)                       
#define mask_crg_ext_clk_gate_ctrl1_pd_snc_apb_ext_cg_en               (0x20000)                       
#define mask_crg_ext_clk_gate_ctrl1_cic_ext_cg_en                      (0x10000)                       
#define mask_crg_ext_clk_gate_ctrl1_h2p1_ahb_ext_cg_en                 (0x8000)                        
#define mask_crg_ext_clk_gate_ctrl1_pd_mem_ext_cg_en                   (0x4000)                        
#define mask_crg_ext_clk_gate_ctrl1_sys_ctrl_ext_cg_en                 (0x2000)                        
#define mask_crg_ext_clk_gate_ctrl1_pmu_ext_cg_en                      (0x1000)                        
#define mask_crg_ext_clk_gate_ctrl1_gpio_ext_cg_en                     (0x800)                         
#define mask_crg_ext_clk_gate_ctrl1_crg_ext_cg_en                      (0x400)                         
#define mask_crg_ext_clk_gate_ctrl1_m0_ahb_ext_cg_en                   (0x200)                         
#define mask_crg_ext_clk_gate_ctrl1_m0_sys_ext_cg_en                   (0x100)                         
#define mask_crg_ext_clk_gate_ctrl1_sys_div_out_ext_cg_en              (0x80)                          
#define mask_crg_ext_clk_gate_ctrl1_mdm_ext_cg_en                      (0x40)                          
#define mask_crg_ext_clk_gate_ctrl1_sdm_ext_cg_en                      (0x20)                          
#define mask_crg_ext_clk_gate_ctrl1_lo_ext_cg_en                       (0x10)                          
#define mask_crg_ext_clk_gate_ctrl1_fd_ext_cg_en                       (0x8)                           
#define mask_crg_ext_clk_gate_ctrl1_i2s_ext_cg_en                      (0x4)                           
#define mask_crg_ext_clk_gate_ctrl1_m0_dap_ext_cg_en                   (0x2)                           
#define mask_crg_ext_clk_gate_ctrl1_m33_ext_cg_en                      (0x1)                           

#define reg_crg_clk_gate_ctrl0                                       (*(volatile uint32_t *)0x6004f024)
#define adr_crg_clk_gate_ctrl0                                                             (0x6004f024)
#define mask_crg_clk_gate_ctrl0_i2c3_cg_en                             (0x80000000)                    
#define mask_crg_clk_gate_ctrl0_i2c2_cg_en                             (0x40000000)                    
#define mask_crg_clk_gate_ctrl0_i2c1_cg_en                             (0x20000000)                    
#define mask_crg_clk_gate_ctrl0_i2c0_cg_en                             (0x10000000)                    
#define mask_crg_clk_gate_ctrl0_usb_cg_en                              (0x8000000)                     
#define mask_crg_clk_gate_ctrl0_qspi3_cg_en                            (0x4000000)                     
#define mask_crg_clk_gate_ctrl0_qspi2_cg_en                            (0x2000000)                     
#define mask_crg_clk_gate_ctrl0_qspi1_cg_en                            (0x1000000)                     
#define mask_crg_clk_gate_ctrl0_dma_ahb_cg_en                          (0x800000)                      
#define mask_crg_clk_gate_ctrl0_i2s_cg_en                              (0x400000)                      
#define mask_crg_clk_gate_ctrl0_aud_adc1_cg_en                         (0x200000)                      
#define mask_crg_clk_gate_ctrl0_aud_adc0_cg_en                         (0x100000)                      
#define mask_crg_clk_gate_ctrl0_cic_cg_en                              (0x80000)                       
#define mask_crg_clk_gate_ctrl0_trng_cg_en                             (0x40000)                       
#define mask_crg_clk_gate_ctrl0_cali_cg_en                             (0x20000)                       
#define mask_crg_clk_gate_ctrl0_cpto0_cg_en                            (0x10000)                       
#define mask_crg_clk_gate_ctrl0_llc_lp_cg_en                           (0x8000)                        
#define mask_crg_clk_gate_ctrl0_llc_cg_en                              (0x4000)                        
#define mask_crg_clk_gate_ctrl0_mdm_cg_en                              (0x2000)                        
#define mask_crg_clk_gate_ctrl0_sdm_cg_en                              (0x1000)                        
#define mask_crg_clk_gate_ctrl0_lo_cg_en                               (0x800)                         
#define mask_crg_clk_gate_ctrl0_fd_cg_en                               (0x400)                         
#define mask_crg_clk_gate_ctrl0_wdt1_lp_cg_en                          (0x200)                         
#define mask_crg_clk_gate_ctrl0_wdt0_lp_cg_en                          (0x100)                         
#define mask_crg_clk_gate_ctrl0_rtc_rc_32k_cg_en                       (0x80)                          
#define mask_crg_clk_gate_ctrl0_rtc_apb_cg_en                          (0x40)                          
#define mask_crg_clk_gate_ctrl0_stim1_cg_en                            (0x20)                          
#define mask_crg_clk_gate_ctrl0_stim0_cg_en                            (0x10)                          
#define mask_crg_clk_gate_ctrl0_gtim3_cg_en                            (0x8)                           
#define mask_crg_clk_gate_ctrl0_gtim2_cg_en                            (0x4)                           
#define mask_crg_clk_gate_ctrl0_gtim1_cg_en                            (0x2)                           
#define mask_crg_clk_gate_ctrl0_gtim0_cg_en                            (0x1)                           

