EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_crg_clk_gate_ctrl1                                       (*(volatile uint32_t *)0x6004f028)
#define adr_crg_clk_gate_ctrl1                                                             (0x6004f028)
#define mask_crg_clk_gate_ctrl1_cpto1_cg_en                            (0x200000)                      
#define mask_crg_clk_gate_ctrl1_dcxo_32k_out1_cg_en                    (0x100000)                      
#define mask_crg_clk_gate_ctrl1_dcxo_32k_out0_cg_en                    (0x80000)                       
#define mask_crg_clk_gate_ctrl1_atest_clk_cg_en                        (0x40000)                       
#define mask_crg_clk_gate_ctrl1_sys_div_out_cg_en                      (0x20000)                       
#define mask_crg_clk_gate_ctrl1_qdec_cg_en                             (0x10000)                       
#define mask_crg_clk_gate_ctrl1_spi1_cg_en                             (0x8000)                        
#define mask_crg_clk_gate_ctrl1_spi0_cg_en                             (0x4000)                        
#define mask_crg_clk_gate_ctrl1_uart2_cg_en                            (0x2000)                        
#define mask_crg_clk_gate_ctrl1_uart1_cg_en                            (0x1000)                        
#define mask_crg_clk_gate_ctrl1_uart0_cg_en                            (0x800)                         
#define mask_crg_clk_gate_ctrl1_m0_dap_cg_en                           (0x400)                         
#define mask_crg_clk_gate_ctrl1_m0_cg_en                               (0x200)                         
#define mask_crg_clk_gate_ctrl1_ahb4_cg_en                             (0x100)                         
#define mask_crg_clk_gate_ctrl1_qspi0_cg_en                            (0x80)                          
#define mask_crg_clk_gate_ctrl1_pwt_lp_cg_en                           (0x40)                          
#define mask_crg_clk_gate_ctrl1_gpio_cg_en                             (0x20)                          
#define mask_crg_clk_gate_ctrl1_efuse_cg_en                            (0x10)                          
#define mask_crg_clk_gate_ctrl1_sys_ctrl_cg_en                         (0x8)                           
#define mask_crg_clk_gate_ctrl1_h2p1_ahb_cg_en                         (0x4)                           
#define mask_crg_clk_gate_ctrl1_ahb5_cg_en                             (0x2)                           
#define mask_crg_clk_gate_ctrl1_m33_cg_en                              (0x1)                           

#define reg_crg_soft_reset_ctrl0                                     (*(volatile uint32_t *)0x6004f080)
#define adr_crg_soft_reset_ctrl0                                                           (0x6004f080)
#define mask_crg_soft_reset_ctrl0_i2c3_srst_n                          (0x80000000)                    
#define mask_crg_soft_reset_ctrl0_ahb5_srst_n                          (0x40000000)                    
#define mask_crg_soft_reset_ctrl0_cali_srst_n                          (0x20000000)                    
#define mask_crg_soft_reset_ctrl0_sys_ctrl_srst_n                      (0x10000000)                    
#define mask_crg_soft_reset_ctrl0_rtc_srst_n                           (0x8000000)                     
#define mask_crg_soft_reset_ctrl0_pwt_srst_n                           (0x4000000)                     
#define mask_crg_soft_reset_ctrl0_wdt0_srst_n                          (0x2000000)                     
#define mask_crg_soft_reset_ctrl0_ahb4_srst_n                          (0x1000000)                     
#define mask_crg_soft_reset_ctrl0_dma_srst_n                           (0x800000)                      
#define mask_crg_soft_reset_ctrl0_qspi3_srst_n                         (0x400000)                      
#define mask_crg_soft_reset_ctrl0_qspi2_srst_n                         (0x200000)                      
#define mask_crg_soft_reset_ctrl0_qspi1_srst_n                         (0x100000)                      
#define mask_crg_soft_reset_ctrl0_qspi0_srst_n                         (0x80000)                       
#define mask_crg_soft_reset_ctrl0_gpadc0_srst_n                        (0x40000)                       
#define mask_crg_soft_reset_ctrl0_cic_srst_n                           (0x20000)                       
#define mask_crg_soft_reset_ctrl0_efuse_srst_n                         (0x10000)                       
#define mask_crg_soft_reset_ctrl0_i2s_srst_n                           (0x8000)                        
#define mask_crg_soft_reset_ctrl0_gpio_srst_n                          (0x4000)                        
#define mask_crg_soft_reset_ctrl0_gtim3_srst_n                         (0x2000)                        
#define mask_crg_soft_reset_ctrl0_gtim2_srst_n                         (0x1000)                        
#define mask_crg_soft_reset_ctrl0_gtim1_srst_n                         (0x800)                         
#define mask_crg_soft_reset_ctrl0_gtim0_srst_n                         (0x400)                         
#define mask_crg_soft_reset_ctrl0_usb_srst_n                           (0x200)                         
#define mask_crg_soft_reset_ctrl0_qdec_srst_n                          (0x100)                         
#define mask_crg_soft_reset_ctrl0_spi0_srst_n                          (0x80)                          
#define mask_crg_soft_reset_ctrl0_spi1_srst_n                          (0x40)                          
#define mask_crg_soft_reset_ctrl0_i2c2_srst_n                          (0x20)                          
#define mask_crg_soft_reset_ctrl0_i2c1_srst_n                          (0x10)                          
#define mask_crg_soft_reset_ctrl0_i2c0_srst_n                          (0x8)                           
#define mask_crg_soft_reset_ctrl0_uart2_srst_n                         (0x4)                           
#define mask_crg_soft_reset_ctrl0_uart1_srst_n                         (0x2)                           
#define mask_crg_soft_reset_ctrl0_uart0_srst_n                         (0x1)                           

