EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_crg_soft_reset_ctrl1                                     (*(volatile uint32_t *)0x6004f084)
#define adr_crg_soft_reset_ctrl1                                                           (0x6004f084)
#define mask_crg_soft_reset_ctrl1_cpto1_srst_n                         (0x200)                         
#define mask_crg_soft_reset_ctrl1_stim1_srst_n                         (0x100)                         
#define mask_crg_soft_reset_ctrl1_stim0_srst_n                         (0x80)                          
#define mask_crg_soft_reset_ctrl1_wdt1_srst_n                          (0x40)                          
#define mask_crg_soft_reset_ctrl1_gpadc1_srst_n                        (0x20)                          
#define mask_crg_soft_reset_ctrl1_trng_srst_n                          (0x10)                          
#define mask_crg_soft_reset_ctrl1_cpto0_srst_n                         (0x8)                           
#define mask_crg_soft_reset_ctrl1_mdm_srst_n                           (0x4)                           
#define mask_crg_soft_reset_ctrl1_llc_srst_n                           (0x2)                           
#define mask_crg_soft_reset_ctrl1_m0_srst_n                            (0x1)                           

#define reg_crg_m33_vect_srst                                        (*(volatile uint32_t *)0x6004f088)
#define adr_crg_m33_vect_srst                                                              (0x6004f088)

#define reg_crg_m0_vect_srst                                         (*(volatile uint32_t *)0x6004f08c)
#define adr_crg_m0_vect_srst                                                               (0x6004f08c)

#define reg_crg_soc_srst_vect                                        (*(volatile uint32_t *)0x6004f090)
#define adr_crg_soc_srst_vect                                                              (0x6004f090)

#define reg_crg_rst_flag                                             (*(volatile uint32_t *)0x6004f094)
#define adr_crg_rst_flag                                                                   (0x6004f094)
#define mask_crg_rst_flag_wdt1_rst_flag                                (0x100)                         
#define mask_crg_rst_flag_pwrup_rst_flag                               (0x80)                          
#define mask_crg_rst_flag_hw_rst_flag                                  (0x40)                          
#define mask_crg_rst_flag_soc_srst_flag                                (0x20)                          
#define mask_crg_rst_flag_wdt0_rst_flag                                (0x10)                          
#define mask_crg_rst_flag_m33_vect_srst_flag                           (0x8)                           
#define mask_crg_rst_flag_m33_sysresetreq_flag                         (0x4)                           
#define mask_crg_rst_flag_m0_vect_srst_flag                            (0x2)                           
#define mask_crg_rst_flag_m0_sysresetreq_flag                          (0x1)                           

#define reg_crg_rst_flag_clr1                                        (*(volatile uint32_t *)0x6004f098)
#define adr_crg_rst_flag_clr1                                                              (0x6004f098)
#define mask_crg_rst_flag_clr1_wdt1_rst_flag_clr                       (0x100)                         
#define mask_crg_rst_flag_clr1_pwrup_rst_flag_clr                      (0x80)                          
#define mask_crg_rst_flag_clr1_hw_rst_flag_clr                         (0x40)                          
#define mask_crg_rst_flag_clr1_soc_srst_flag_clr                       (0x20)                          
#define mask_crg_rst_flag_clr1_wdt0_rst_flag_clr                       (0x10)                          
#define mask_crg_rst_flag_clr1_m33_vect_srst_flag_clr                  (0x8)                           
#define mask_crg_rst_flag_clr1_m33_sysresetreq_flag_clr                (0x4)                           
#define mask_crg_rst_flag_clr1_m0_vect_srst_flag_clr                   (0x2)                           
#define mask_crg_rst_flag_clr1_m0_sysresetreq_flag_clr                 (0x1)                           

#define reg_crg_wdt1_rst_sys_mask                                    (*(volatile uint32_t *)0x6004f09c)
#define adr_crg_wdt1_rst_sys_mask                                                          (0x6004f09c)

#define reg_crg_cali_ctrl                                            (*(volatile uint32_t *)0x6004f100)
#define adr_crg_cali_ctrl                                                                  (0x6004f100)
#define mask_crg_cali_ctrl_xo16m_clk_en_force                          (0x80)                          
#define mask_crg_cali_ctrl_cali_speed                                  (0x78)                          
#define mask_crg_cali_ctrl_cali_src_sel                                (0x4)                           
#define mask_crg_cali_ctrl_pmu_cali_en                                 (0x2)                           
#define mask_crg_cali_ctrl_cali_en                                     (0x1)                           

#define reg_crg_cali_32k_prd                                         (*(volatile uint32_t *)0x6004f104)
#define adr_crg_cali_32k_prd                                                               (0x6004f104)

#define reg_crg_test_clk_reuse_en                                    (*(volatile uint32_t *)0x6004f180)
#define adr_crg_test_clk_reuse_en                                                          (0x6004f180)


//---------------------------------------------------
// pmu in  domain address definition
//---------------------------------------------------

#define reg_pmu_lut_rowxx_irq_state                                (*(volatile uint32_t *)0x60050000)
#define adr_pmu_lut_rowxx_irq_state                                                      (0x60050000)

#define reg_pmu_lut_rowxx_irq_clr                                  (*(volatile uint32_t *)0x60050004)
#define adr_pmu_lut_rowxx_irq_clr                                                        (0x60050004)

#define reg_pmu_lut_row00                                          (*(volatile uint32_t *)0x60050008)
#define adr_pmu_lut_row00                                                                (0x60050008)
#define mask_pmu_lut_row00_lut_row00_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row00_lut_row00_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row00_lut_row00_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row00_lut_row00_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row00_lut_row00_trig_id                         (0x7c)                          
#define mask_pmu_lut_row00_lut_row00_trig_sel                        (0x3)                           

#define reg_pmu_lut_row01                                          (*(volatile uint32_t *)0x6005000c)
#define adr_pmu_lut_row01                                                                (0x6005000c)
#define mask_pmu_lut_row01_lut_row01_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row01_lut_row01_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row01_lut_row01_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row01_lut_row01_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row01_lut_row01_trig_id                         (0x7c)                          
#define mask_pmu_lut_row01_lut_row01_trig_sel                        (0x3)                           

