EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_pmu_lut_row02                                          (*(volatile uint32_t *)0x60050010)
#define adr_pmu_lut_row02                                                                (0x60050010)
#define mask_pmu_lut_row02_lut_row02_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row02_lut_row02_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row02_lut_row02_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row02_lut_row02_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row02_lut_row02_trig_id                         (0x7c)                          
#define mask_pmu_lut_row02_lut_row02_trig_sel                        (0x3)                           

#define reg_pmu_lut_row03                                          (*(volatile uint32_t *)0x60050014)
#define adr_pmu_lut_row03                                                                (0x60050014)
#define mask_pmu_lut_row03_lut_row03_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row03_lut_row03_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row03_lut_row03_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row03_lut_row03_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row03_lut_row03_trig_id                         (0x7c)                          
#define mask_pmu_lut_row03_lut_row03_trig_sel                        (0x3)                           

#define reg_pmu_lut_row04                                          (*(volatile uint32_t *)0x60050018)
#define adr_pmu_lut_row04                                                                (0x60050018)
#define mask_pmu_lut_row04_lut_row04_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row04_lut_row04_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row04_lut_row04_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row04_lut_row04_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row04_lut_row04_trig_id                         (0x7c)                          
#define mask_pmu_lut_row04_lut_row04_trig_sel                        (0x3)                           

#define reg_pmu_lut_row05                                          (*(volatile uint32_t *)0x6005001c)
#define adr_pmu_lut_row05                                                                (0x6005001c)
#define mask_pmu_lut_row05_lut_row05_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row05_lut_row05_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row05_lut_row05_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row05_lut_row05_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row05_lut_row05_trig_id                         (0x7c)                          
#define mask_pmu_lut_row05_lut_row05_trig_sel                        (0x3)                           

#define reg_pmu_lut_row06                                          (*(volatile uint32_t *)0x60050020)
#define adr_pmu_lut_row06                                                                (0x60050020)
#define mask_pmu_lut_row06_lut_row06_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row06_lut_row06_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row06_lut_row06_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row06_lut_row06_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row06_lut_row06_trig_id                         (0x7c)                          
#define mask_pmu_lut_row06_lut_row06_trig_sel                        (0x3)                           

#define reg_pmu_lut_row07                                          (*(volatile uint32_t *)0x60050024)
#define adr_pmu_lut_row07                                                                (0x60050024)
#define mask_pmu_lut_row07_lut_row07_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row07_lut_row07_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row07_lut_row07_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row07_lut_row07_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row07_lut_row07_trig_id                         (0x7c)                          
#define mask_pmu_lut_row07_lut_row07_trig_sel                        (0x3)                           

#define reg_pmu_lut_row08                                          (*(volatile uint32_t *)0x60050028)
#define adr_pmu_lut_row08                                                                (0x60050028)
#define mask_pmu_lut_row08_lut_row08_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row08_lut_row08_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row08_lut_row08_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row08_lut_row08_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row08_lut_row08_trig_id                         (0x7c)                          
#define mask_pmu_lut_row08_lut_row08_trig_sel                        (0x3)                           

#define reg_pmu_lut_row09                                          (*(volatile uint32_t *)0x6005002c)
#define adr_pmu_lut_row09                                                                (0x6005002c)
#define mask_pmu_lut_row09_lut_row09_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row09_lut_row09_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row09_lut_row09_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row09_lut_row09_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row09_lut_row09_trig_id                         (0x7c)                          
#define mask_pmu_lut_row09_lut_row09_trig_sel                        (0x3)                           

#define reg_pmu_lut_row10                                          (*(volatile uint32_t *)0x60050030)
#define adr_pmu_lut_row10                                                                (0x60050030)
#define mask_pmu_lut_row10_lut_row10_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row10_lut_row10_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row10_lut_row10_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row10_lut_row10_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row10_lut_row10_trig_id                         (0x7c)                          
#define mask_pmu_lut_row10_lut_row10_trig_sel                        (0x3)                           

