EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_pmu_lut_row11                                          (*(volatile uint32_t *)0x60050034)
#define adr_pmu_lut_row11                                                                (0x60050034)
#define mask_pmu_lut_row11_lut_row11_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row11_lut_row11_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row11_lut_row11_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row11_lut_row11_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row11_lut_row11_trig_id                         (0x7c)                          
#define mask_pmu_lut_row11_lut_row11_trig_sel                        (0x3)                           

#define reg_pmu_lut_row12                                          (*(volatile uint32_t *)0x60050038)
#define adr_pmu_lut_row12                                                                (0x60050038)
#define mask_pmu_lut_row12_lut_row12_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row12_lut_row12_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row12_lut_row12_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row12_lut_row12_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row12_lut_row12_trig_id                         (0x7c)                          
#define mask_pmu_lut_row12_lut_row12_trig_sel                        (0x3)                           

#define reg_pmu_lut_row13                                          (*(volatile uint32_t *)0x6005003c)
#define adr_pmu_lut_row13                                                                (0x6005003c)
#define mask_pmu_lut_row13_lut_row13_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row13_lut_row13_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row13_lut_row13_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row13_lut_row13_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row13_lut_row13_trig_id                         (0x7c)                          
#define mask_pmu_lut_row13_lut_row13_trig_sel                        (0x3)                           

#define reg_pmu_lut_row14                                          (*(volatile uint32_t *)0x60050040)
#define adr_pmu_lut_row14                                                                (0x60050040)
#define mask_pmu_lut_row14_lut_row14_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row14_lut_row14_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row14_lut_row14_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row14_lut_row14_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row14_lut_row14_trig_id                         (0x7c)                          
#define mask_pmu_lut_row14_lut_row14_trig_sel                        (0x3)                           

#define reg_pmu_lut_row15                                          (*(volatile uint32_t *)0x60050044)
#define adr_pmu_lut_row15                                                                (0x60050044)
#define mask_pmu_lut_row15_lut_row15_action_m33_irq_en               (0x400)                         
#define mask_pmu_lut_row15_lut_row15_action_m0p_irq_en               (0x200)                         
#define mask_pmu_lut_row15_lut_row15_action_en_xtal                  (0x100)                         
#define mask_pmu_lut_row15_lut_row15_action_en_pd_sys                (0x80)                          
#define mask_pmu_lut_row15_lut_row15_trig_id                         (0x7c)                          
#define mask_pmu_lut_row15_lut_row15_trig_sel                        (0x3)                           

#define reg_pmu_power_mode_on_th                                   (*(volatile uint32_t *)0x60050048)
#define adr_pmu_power_mode_on_th                                                         (0x60050048)
#define mask_pmu_power_mode_on_th_ldo_dcdc_on_th                     (0xff00)                        
#define mask_pmu_power_mode_on_th_ldo_dig_on_th                      (0xff)                          

#define reg_pmu_clk_en_together                                    (*(volatile uint32_t *)0x6005004c)
#define adr_pmu_clk_en_together                                                          (0x6005004c)

#define reg_pmu_power_mode_off_th                                  (*(volatile uint32_t *)0x60050050)
#define adr_pmu_power_mode_off_th                                                        (0x60050050)
#define mask_pmu_power_mode_off_th_ldo_dcdc_off_th                   (0xff)                          

#define reg_pmu_buck_act_lp                                        (*(volatile uint32_t *)0x60050054)
#define adr_pmu_buck_act_lp                                                              (0x60050054)
#define mask_pmu_buck_act_lp_buck_act2lp_tim                         (0x2)                           
#define mask_pmu_buck_act_lp_buck_lp2act_tim                         (0x1)                           

#define reg_pmu_power_psw_th                                       (*(volatile uint32_t *)0x60050058)
#define adr_pmu_power_psw_th                                                             (0x60050058)
#define mask_pmu_power_psw_th_retpsw_digoff_th                       (0xf0)                          
#define mask_pmu_power_psw_th_digon_retpswn_th                       (0xf)                           

#define reg_pmu_hs_dcxo_stable_th                                  (*(volatile uint32_t *)0x6005005c)
#define adr_pmu_hs_dcxo_stable_th                                                        (0x6005005c)

