EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_pmu_sram_ret_en                                        (*(volatile uint32_t *)0x60050060)
#define adr_pmu_sram_ret_en                                                              (0x60050060)

#define reg_pmu_power_mode                                         (*(volatile uint32_t *)0x60050064)
#define adr_pmu_power_mode                                                               (0x60050064)
#define mask_pmu_power_mode_sleep_mode                               (0x3)                           

#define reg_pmu_pd_sys_ret_psw                                     (*(volatile uint32_t *)0x60050068)
#define adr_pmu_pd_sys_ret_psw                                                           (0x60050068)

#define reg_pmu_force_sleep                                        (*(volatile uint32_t *)0x6005006c)
#define adr_pmu_force_sleep                                                              (0x6005006c)

#define reg_pmu_buck_act_en                                        (*(volatile uint32_t *)0x60050070)
#define adr_pmu_buck_act_en                                                              (0x60050070)

#define reg_pmu_buck_act_cfg                                       (*(volatile uint32_t *)0x60050074)
#define adr_pmu_buck_act_cfg                                                             (0x60050074)
#define mask_pmu_buck_act_cfg_buck_ocp                               (0x78000000)                    
#define mask_pmu_buck_act_cfg_buck_zcd                               (0x7800000)                     
#define mask_pmu_buck_act_cfg_buck_ton                               (0x700000)                      
#define mask_pmu_buck_act_cfg_buck_pulse                             (0xe0000)                       
#define mask_pmu_buck_act_cfg_buck_bbm                               (0x1c000)                       
#define mask_pmu_buck_act_cfg_buck_hysb                              (0x3000)                        
#define mask_pmu_buck_act_cfg_buck_toff                              (0xe00)                         
#define mask_pmu_buck_act_cfg_buck_ocp_cmp_hys                       (0x1c0)                         
#define mask_pmu_buck_act_cfg_buck_zcd_cmp_hys                       (0x38)                          
#define mask_pmu_buck_act_cfg_buck_do_bbm                            (0x7)                           

#define reg_pmu_buck_act_cfg1                                      (*(volatile uint32_t *)0x60050078)
#define adr_pmu_buck_act_cfg1                                                            (0x60050078)
#define mask_pmu_buck_act_cfg1_buck_fb_l                             (0x3f80)                        
#define mask_pmu_buck_act_cfg1_buck_fb_h                             (0x7f)                          

#define reg_pmu_buck_lp_en                                         (*(volatile uint32_t *)0x6005007c)
#define adr_pmu_buck_lp_en                                                               (0x6005007c)

#define reg_pmu_buck_lp_cfg                                        (*(volatile uint32_t *)0x60050080)
#define adr_pmu_buck_lp_cfg                                                              (0x60050080)
#define mask_pmu_buck_lp_cfg_buck_lp_zcd_h_en                        (0x8)                           
#define mask_pmu_buck_lp_cfg_buck_lp_zcd_l_en                        (0x4)                           
#define mask_pmu_buck_lp_cfg_buck_lp_zcd_h_sel                       (0x2)                           
#define mask_pmu_buck_lp_cfg_buck_lp_zcd_l_sel                       (0x1)                           

#define reg_pmu_buck_lp_cfg1                                       (*(volatile uint32_t *)0x60050084)
#define adr_pmu_buck_lp_cfg1                                                             (0x60050084)
#define mask_pmu_buck_lp_cfg1_buck_lp_n_h                            (0xffff0000)                    
#define mask_pmu_buck_lp_cfg1_buck_lp_n_l                            (0xffff)                        

#define reg_pmu_buck_lp_cfg2                                       (*(volatile uint32_t *)0x60050088)
#define adr_pmu_buck_lp_cfg2                                                             (0x60050088)
#define mask_pmu_buck_lp_cfg2_buck_lp_bbm                            (0x7000000)                     
#define mask_pmu_buck_lp_cfg2_buck_lp_fb_h                           (0xf00000)                      
#define mask_pmu_buck_lp_cfg2_buck_lp_fb_l                           (0xf0000)                       
#define mask_pmu_buck_lp_cfg2_buck_lp_p_h                            (0xff00)                        
#define mask_pmu_buck_lp_cfg2_buck_lp_p_l                            (0xff)                          

#define reg_pmu_buck_lpck_div_val                                  (*(volatile uint32_t *)0x6005008c)
#define adr_pmu_buck_lpck_div_val                                                        (0x6005008c)

#define reg_pmu_ldo_act_en                                         (*(volatile uint32_t *)0x60050090)
#define adr_pmu_ldo_act_en                                                               (0x60050090)

#define reg_pmu_ldo_act                                            (*(volatile uint32_t *)0x60050094)
#define adr_pmu_ldo_act                                                                  (0x60050094)
#define mask_pmu_ldo_act_ldo_act_cfg                                 (0xe)                           
#define mask_pmu_ldo_act_ldo_act_byp                                 (0x1)                           

#define reg_pmu_ldo_1v8_en                                         (*(volatile uint32_t *)0x60050098)
#define adr_pmu_ldo_1v8_en                                                               (0x60050098)

#define reg_pmu_ldo_dig_en                                         (*(volatile uint32_t *)0x6005009c)
#define adr_pmu_ldo_dig_en                                                               (0x6005009c)

#define reg_pmu_ldo_dig                                            (*(volatile uint32_t *)0x600500a0)
#define adr_pmu_ldo_dig                                                                  (0x600500a0)
#define mask_pmu_ldo_dig_ldo_dig_cfg                                 (0xe)                           
#define mask_pmu_ldo_dig_ldo_dig_byp                                 (0x1)                           

