EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_pmu_ldo_retpsw_n                                       (*(volatile uint32_t *)0x600500a4)
#define adr_pmu_ldo_retpsw_n                                                             (0x600500a4)
#define mask_pmu_ldo_retpsw_n_force_retpsw                           (0x2)                           
#define mask_pmu_ldo_retpsw_n_retpsw_ctrl                            (0x1)                           

#define reg_pmu_ldo_ret                                            (*(volatile uint32_t *)0x600500a8)
#define adr_pmu_ldo_ret                                                                  (0x600500a8)
#define mask_pmu_ldo_ret_ldo_ret_slp_cfg                             (0x38)                          
#define mask_pmu_ldo_ret_ldo_ret_act_cfg                             (0x7)                           

#define reg_pmu_ana_clock                                          (*(volatile uint32_t *)0x600500ac)
#define adr_pmu_ana_clock                                                                (0x600500ac)
#define mask_pmu_ana_clock_pll_on                                    (0x2000)                        
#define mask_pmu_ana_clock_pll_off                                   (0x1000)                        
#define mask_pmu_ana_clock_pll_128m_clk_en                           (0x800)                         
#define mask_pmu_ana_clock_pll_96m_clk_en                            (0x400)                         
#define mask_pmu_ana_clock_pll_128m_clk_dis                          (0x200)                         
#define mask_pmu_ana_clock_pll_96m_clk_dis                           (0x100)                         
#define mask_pmu_ana_clock_dcxo_pwr_on                               (0x80)                          
#define mask_pmu_ana_clock_dcxo_pwr_off                              (0x40)                          
#define mask_pmu_ana_clock_dcxo_clk_en                               (0x20)                          
#define mask_pmu_ana_clock_dcxo_clk_dis                              (0x10)                          
#define mask_pmu_ana_clock_hs_rc_en                                  (0x8)                           
#define mask_pmu_ana_clock_hs_rc_dis                                 (0x4)                           
#define mask_pmu_ana_clock_ls_rc_en                                  (0x2)                           
#define mask_pmu_ana_clock_ls_rc_dis                                 (0x1)                           

#define reg_pmu_clock_state                                        (*(volatile uint32_t *)0x600500b0)
#define adr_pmu_clock_state                                                              (0x600500b0)
#define mask_pmu_clock_state_pll_en                                  (0x80)                          
#define mask_pmu_clock_state_pll_128m_cken                           (0x40)                          
#define mask_pmu_clock_state_pll_96m_cken                            (0x20)                          
#define mask_pmu_clock_state_dcxo_clk_en                             (0x10)                          
#define mask_pmu_clock_state_dcxo_en                                 (0x8)                           
#define mask_pmu_clock_state_hs_rc_cken_st                           (0x4)                           
#define mask_pmu_clock_state_hs_rc_en_st                             (0x2)                           
#define mask_pmu_clock_state_ls_rc_en_st                             (0x1)                           

#define reg_pmu_hs_dcxo_pwr_sel                                    (*(volatile uint32_t *)0x600500b4)
#define adr_pmu_hs_dcxo_pwr_sel                                                          (0x600500b4)

#define reg_pmu_hs_dcxo_ana_intf                                   (*(volatile uint32_t *)0x600500b8)
#define adr_pmu_hs_dcxo_ana_intf                                                         (0x600500b8)
#define mask_pmu_hs_dcxo_ana_intf_dcxo_backup                        (0x3fc00000)                    
#define mask_pmu_hs_dcxo_ana_intf_dcxo_ib                            (0x380000)                      
#define mask_pmu_hs_dcxo_ana_intf_dcxo_ngm                           (0x70000)                       
#define mask_pmu_hs_dcxo_ana_intf_dcxo_capl                          (0xff00)                        
#define mask_pmu_hs_dcxo_ana_intf_dcxo_capr                          (0xff)                          

#define reg_pmu_hs_rc_tune                                         (*(volatile uint32_t *)0x600500bc)
#define adr_pmu_hs_rc_tune                                                               (0x600500bc)

#define reg_pmu_ls_rc_tune                                         (*(volatile uint32_t *)0x600500c0)
#define adr_pmu_ls_rc_tune                                                               (0x600500c0)

#define reg_pmu_pll_cfg                                            (*(volatile uint32_t *)0x600500c4)
#define adr_pmu_pll_cfg                                                                  (0x600500c4)

#define reg_pmu_power_domain_on                                    (*(volatile uint32_t *)0x600500c8)
#define adr_pmu_power_domain_on                                                          (0x600500c8)
#define mask_pmu_power_domain_on_pd_tim_force_on_p                   (0x4)                           
#define mask_pmu_power_domain_on_pd_com_force_on_p                   (0x2)                           
#define mask_pmu_power_domain_on_pd_sys_on_p                         (0x1)                           

#define reg_pmu_power_domain_off                                   (*(volatile uint32_t *)0x600500cc)
#define adr_pmu_power_domain_off                                                         (0x600500cc)
#define mask_pmu_power_domain_off_pd_tim_force_off_p                 (0x4)                           
#define mask_pmu_power_domain_off_pd_com_force_off_p                 (0x2)                           
#define mask_pmu_power_domain_off_pd_sys_off_p                       (0x1)                           

