EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_pmu_dpsw_ack                                           (*(volatile uint32_t *)0x600500d0)
#define adr_pmu_dpsw_ack                                                                 (0x600500d0)
#define mask_pmu_dpsw_ack_cache_psw_ack                              (0x1000000)                     
#define mask_pmu_dpsw_ack_pd_ret_psw_ack                             (0x800000)                      
#define mask_pmu_dpsw_ack_pd_tim_psw_ack                             (0x400000)                      
#define mask_pmu_dpsw_ack_pd_com_psw_ack                             (0x200000)                      
#define mask_pmu_dpsw_ack_pd_sys_psw_ack                             (0x100000)                      
#define mask_pmu_dpsw_ack_sram_psw_ack                               (0xfffff)                       

#define reg_pmu_code                                               (*(volatile uint32_t *)0x600500d4)
#define adr_pmu_code                                                                     (0x600500d4)
#define mask_pmu_code_c_done                                         (0x2)                           
#define mask_pmu_code_c_flag                                         (0x1)                           

#define reg_pmu_ret_reset_sel                                      (*(volatile uint32_t *)0x600500d8)
#define adr_pmu_ret_reset_sel                                                            (0x600500d8)

#define reg_pmu_phy_iso_sel                                        (*(volatile uint32_t *)0x600500dc)
#define adr_pmu_phy_iso_sel                                                              (0x600500dc)

#define reg_pmu_bg_cfg                                             (*(volatile uint32_t *)0x600500e0)
#define adr_pmu_bg_cfg                                                                   (0x600500e0)

#define reg_pmu_ana_backup                                         (*(volatile uint32_t *)0x600500e4)
#define adr_pmu_ana_backup                                                               (0x600500e4)

#define reg_pmu_test_ctrl                                          (*(volatile uint32_t *)0x600500e8)
#define adr_pmu_test_ctrl                                                                (0x600500e8)

#define reg_pmu_test_en                                            (*(volatile uint32_t *)0x600500ec)
#define adr_pmu_test_en                                                                  (0x600500ec)
#define mask_pmu_test_en_pdon_timeout_en                             (0x4)                           
#define mask_pmu_test_en_wakeup_deb_en                               (0x2)                           
#define mask_pmu_test_en_test_force_en                               (0x1)                           

#define reg_pmu_ana_backup2                                        (*(volatile uint32_t *)0x600500f0)
#define adr_pmu_ana_backup2                                                              (0x600500f0)

#define reg_pmu_ana_sta_backup                                     (*(volatile uint32_t *)0x600500f4)
#define adr_pmu_ana_sta_backup                                                           (0x600500f4)

#define reg_pmu_cdc_cnt                                            (*(volatile uint32_t *)0x600500f8)
#define adr_pmu_cdc_cnt                                                                  (0x600500f8)


//---------------------------------------------------
// sys_ctrl_ret_pd in  domain address definition
//---------------------------------------------------

#define reg_sys_ctrl_ret_pd_m0_addr_remap_ctrl                             (*(volatile uint32_t *)0x60051000)
#define adr_sys_ctrl_ret_pd_m0_addr_remap_ctrl                                                   (0x60051000)
#define mask_sys_ctrl_ret_pd_m0_addr_remap_ctrl_m0_addr_remap_val            (0xfffffc00)                    
#define mask_sys_ctrl_ret_pd_m0_addr_remap_ctrl_m0_addr_remap_end_addr       (0x3fc)                         
#define mask_sys_ctrl_ret_pd_m0_addr_remap_ctrl_m0_addr_remap_ctrl_reserved  (0x2)                           
#define mask_sys_ctrl_ret_pd_m0_addr_remap_ctrl_m0_addr_remap_en             (0x1)                           

#define reg_sys_ctrl_ret_pd_h2h_1d_en                                      (*(volatile uint32_t *)0x60051004)
#define adr_sys_ctrl_ret_pd_h2h_1d_en                                                            (0x60051004)

#define reg_sys_ctrl_ret_pd_sram_timing_cfg0                               (*(volatile uint32_t *)0x60051008)
#define adr_sys_ctrl_ret_pd_sram_timing_cfg0                                                     (0x60051008)
#define mask_sys_ctrl_ret_pd_sram_timing_cfg0_sram_test                      (0x2000)                        
#define mask_sys_ctrl_ret_pd_sram_timing_cfg0_sram_rme                       (0x1000)                        
#define mask_sys_ctrl_ret_pd_sram_timing_cfg0_sram_rm                        (0xf00)                         
#define mask_sys_ctrl_ret_pd_sram_timing_cfg0_sram_ra                        (0xc0)                          
#define mask_sys_ctrl_ret_pd_sram_timing_cfg0_sram_wa                        (0x38)                          
#define mask_sys_ctrl_ret_pd_sram_timing_cfg0_sram_wpulse                    (0x7)                           

#define reg_sys_ctrl_ret_pd_sram_timing_cfg1                               (*(volatile uint32_t *)0x6005100c)
#define adr_sys_ctrl_ret_pd_sram_timing_cfg1                                                     (0x6005100c)
#define mask_sys_ctrl_ret_pd_sram_timing_cfg1_usb_mem_cfg                    (0x7fff)                        

#define reg_sys_ctrl_ret_pd_cache_timing_cfg0                              (*(volatile uint32_t *)0x60051010)
#define adr_sys_ctrl_ret_pd_cache_timing_cfg0                                                    (0x60051010)
#define mask_sys_ctrl_ret_pd_cache_timing_cfg0_cache_test                    (0x2000)                        
#define mask_sys_ctrl_ret_pd_cache_timing_cfg0_cache_rme                     (0x1000)                        
#define mask_sys_ctrl_ret_pd_cache_timing_cfg0_cache_rm                      (0xf00)                         
#define mask_sys_ctrl_ret_pd_cache_timing_cfg0_cache_ra                      (0xc0)                          
#define mask_sys_ctrl_ret_pd_cache_timing_cfg0_cache_wa                      (0x38)                          
#define mask_sys_ctrl_ret_pd_cache_timing_cfg0_cache_wpulse                  (0x7)                           

#define reg_sys_ctrl_device_busy_sta0                                      (*(volatile uint32_t *)0x60051040)
#define adr_sys_ctrl_device_busy_sta0                                                            (0x60051040)

#define reg_sys_ctrl_device_busy_set0                                      (*(volatile uint32_t *)0x60051044)
#define adr_sys_ctrl_device_busy_set0                                                            (0x60051044)

#define reg_sys_ctrl_device_busy_clr0                                      (*(volatile uint32_t *)0x60051048)
#define adr_sys_ctrl_device_busy_clr0                                                            (0x60051048)

#define reg_sys_ctrl_device_busy_sta1                                      (*(volatile uint32_t *)0x6005104c)
#define adr_sys_ctrl_device_busy_sta1                                                            (0x6005104c)

#define reg_sys_ctrl_device_busy_set1                                      (*(volatile uint32_t *)0x60051050)
#define adr_sys_ctrl_device_busy_set1                                                            (0x60051050)

#define reg_sys_ctrl_device_busy_clr1                                      (*(volatile uint32_t *)0x60051054)
#define adr_sys_ctrl_device_busy_clr1                                                            (0x60051054)

#define reg_sys_ctrl_device_busy_sta2                                      (*(volatile uint32_t *)0x60051058)
#define adr_sys_ctrl_device_busy_sta2                                                            (0x60051058)

#define reg_sys_ctrl_device_busy_set2                                      (*(volatile uint32_t *)0x6005105c)
#define adr_sys_ctrl_device_busy_set2                                                            (0x6005105c)

