EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_sys_ctrl_device_busy_clr2                                      (*(volatile uint32_t *)0x60051060)
#define adr_sys_ctrl_device_busy_clr2                                                            (0x60051060)

#define reg_sys_ctrl_ret_pd_m33_initnsvtor                                 (*(volatile uint32_t *)0x60051064)
#define adr_sys_ctrl_ret_pd_m33_initnsvtor                                                       (0x60051064)

#define reg_sys_ctrl_m0_sw_intr_sta                                        (*(volatile uint32_t *)0x60051080)
#define adr_sys_ctrl_m0_sw_intr_sta                                                              (0x60051080)

#define reg_sys_ctrl_m0_sw_intr_set                                        (*(volatile uint32_t *)0x60051084)
#define adr_sys_ctrl_m0_sw_intr_set                                                              (0x60051084)

#define reg_sys_ctrl_m0_sw_intr_clr                                        (*(volatile uint32_t *)0x60051088)
#define adr_sys_ctrl_m0_sw_intr_clr                                                              (0x60051088)

#define reg_sys_ctrl_m33_sw_intr_sta                                       (*(volatile uint32_t *)0x6005108c)
#define adr_sys_ctrl_m33_sw_intr_sta                                                             (0x6005108c)

#define reg_sys_ctrl_m33_sw_intr_set                                       (*(volatile uint32_t *)0x60051090)
#define adr_sys_ctrl_m33_sw_intr_set                                                             (0x60051090)

#define reg_sys_ctrl_m33_sw_intr_clr                                       (*(volatile uint32_t *)0x60051094)
#define adr_sys_ctrl_m33_sw_intr_clr                                                             (0x60051094)

#define reg_sys_ctrl_ret_pd_perp_int_rut_m0_grp0                           (*(volatile uint32_t *)0x600510c0)
#define adr_sys_ctrl_ret_pd_perp_int_rut_m0_grp0                                                 (0x600510c0)

#define reg_sys_ctrl_ret_pd_perp_int_rut_m33_grp0                          (*(volatile uint32_t *)0x600510c4)
#define adr_sys_ctrl_ret_pd_perp_int_rut_m33_grp0                                                (0x600510c4)

#define reg_sys_ctrl_ret_pd_perp_int_rut_m33_grp1                          (*(volatile uint32_t *)0x600510c8)
#define adr_sys_ctrl_ret_pd_perp_int_rut_m33_grp1                                                (0x600510c8)

#define reg_sys_ctrl_ret_pd_pmu_int_ctrl_mask                              (*(volatile uint32_t *)0x600510cc)
#define adr_sys_ctrl_ret_pd_pmu_int_ctrl_mask                                                    (0x600510cc)
#define mask_sys_ctrl_ret_pd_pmu_int_ctrl_mask_m33_pmu_int_ctrl_mask         (0x2)                           
#define mask_sys_ctrl_ret_pd_pmu_int_ctrl_mask_m0p_pmu_int_ctrl_mask         (0x1)                           

#define reg_sys_ctrl_ret_pd_m33_common0                                    (*(volatile uint32_t *)0x60051100)
#define adr_sys_ctrl_ret_pd_m33_common0                                                          (0x60051100)

#define reg_sys_ctrl_ret_pd_m33_common1                                    (*(volatile uint32_t *)0x60051104)
#define adr_sys_ctrl_ret_pd_m33_common1                                                          (0x60051104)

#define reg_sys_ctrl_ret_pd_m33_common2                                    (*(volatile uint32_t *)0x60051108)
#define adr_sys_ctrl_ret_pd_m33_common2                                                          (0x60051108)

#define reg_sys_ctrl_ret_pd_m33_common3                                    (*(volatile uint32_t *)0x6005110c)
#define adr_sys_ctrl_ret_pd_m33_common3                                                          (0x6005110c)

#define reg_sys_ctrl_ret_pd_m33_common4                                    (*(volatile uint32_t *)0x60051110)
#define adr_sys_ctrl_ret_pd_m33_common4                                                          (0x60051110)

#define reg_sys_ctrl_ret_pd_m33_common5                                    (*(volatile uint32_t *)0x60051114)
#define adr_sys_ctrl_ret_pd_m33_common5                                                          (0x60051114)

#define reg_sys_ctrl_ret_pd_m33_common6                                    (*(volatile uint32_t *)0x60051118)
#define adr_sys_ctrl_ret_pd_m33_common6                                                          (0x60051118)

#define reg_sys_ctrl_gpt_sync_trigger                                      (*(volatile uint32_t *)0x60051140)
#define adr_sys_ctrl_gpt_sync_trigger                                                            (0x60051140)
#define mask_sys_ctrl_gpt_sync_trigger_gpt3_cntb_sync_stop                   (0x8000)                        
#define mask_sys_ctrl_gpt_sync_trigger_gpt3_cntb_sync_start                  (0x4000)                        
#define mask_sys_ctrl_gpt_sync_trigger_gpt3_cnta_sync_stop                   (0x2000)                        
#define mask_sys_ctrl_gpt_sync_trigger_gpt3_cnta_sync_start                  (0x1000)                        
#define mask_sys_ctrl_gpt_sync_trigger_gpt2_cntb_sync_stop                   (0x800)                         
#define mask_sys_ctrl_gpt_sync_trigger_gpt2_cntb_sync_start                  (0x400)                         
#define mask_sys_ctrl_gpt_sync_trigger_gpt2_cnta_sync_stop                   (0x200)                         
#define mask_sys_ctrl_gpt_sync_trigger_gpt2_cnta_sync_start                  (0x100)                         
#define mask_sys_ctrl_gpt_sync_trigger_gpt1_cntb_sync_stop                   (0x80)                          
#define mask_sys_ctrl_gpt_sync_trigger_gpt1_cntb_sync_start                  (0x40)                          
#define mask_sys_ctrl_gpt_sync_trigger_gpt1_cnta_sync_stop                   (0x20)                          
#define mask_sys_ctrl_gpt_sync_trigger_gpt1_cnta_sync_start                  (0x10)                          
#define mask_sys_ctrl_gpt_sync_trigger_gpt0_cntb_sync_stop                   (0x8)                           
#define mask_sys_ctrl_gpt_sync_trigger_gpt0_cntb_sync_start                  (0x4)                           
#define mask_sys_ctrl_gpt_sync_trigger_gpt0_cnta_sync_stop                   (0x2)                           
#define mask_sys_ctrl_gpt_sync_trigger_gpt0_cnta_sync_start                  (0x1)                           

#define reg_sys_ctrl_usb_phy_int_sta                                       (*(volatile uint32_t *)0x60051180)
#define adr_sys_ctrl_usb_phy_int_sta                                                             (0x60051180)

#define reg_sys_ctrl_ret_pd_usb_phy_int_mask                               (*(volatile uint32_t *)0x60051184)
#define adr_sys_ctrl_ret_pd_usb_phy_int_mask                                                     (0x60051184)

#define reg_sys_ctrl_usb_phy_int_clr                                       (*(volatile uint32_t *)0x60051188)
#define adr_sys_ctrl_usb_phy_int_clr                                                             (0x60051188)

