EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_sys_ctrl_usb_phy_int_event_sta                                 (*(volatile uint32_t *)0x6005118c)
#define adr_sys_ctrl_usb_phy_int_event_sta                                                       (0x6005118c)

#define reg_sys_ctrl_wdt_wakeup_int_sta                                    (*(volatile uint32_t *)0x600511c0)
#define adr_sys_ctrl_wdt_wakeup_int_sta                                                          (0x600511c0)

#define reg_sys_ctrl_ret_pd_wdt_wakeup_int_mask                            (*(volatile uint32_t *)0x600511c4)
#define adr_sys_ctrl_ret_pd_wdt_wakeup_int_mask                                                  (0x600511c4)

#define reg_sys_ctrl_wdt_wakeup_int_clr                                    (*(volatile uint32_t *)0x600511c8)
#define adr_sys_ctrl_wdt_wakeup_int_clr                                                          (0x600511c8)

#define reg_sys_ctrl_ret_pd_m0_stcalib                                     (*(volatile uint32_t *)0x60051200)
#define adr_sys_ctrl_ret_pd_m0_stcalib                                                           (0x60051200)

#define reg_sys_ctrl_ret_pd_m33_nsstcalib                                  (*(volatile uint32_t *)0x60051204)
#define adr_sys_ctrl_ret_pd_m33_nsstcalib                                                        (0x60051204)


//---------------------------------------------------
// stim0 in  domain address definition
//---------------------------------------------------

#define reg_stim0_stim_int_status                                  (*(volatile uint32_t *)0x60052000)
#define adr_stim0_stim_int_status                                                        (0x60052000)

#define reg_stim0_stim_int_mask                                    (*(volatile uint32_t *)0x60052004)
#define adr_stim0_stim_int_mask                                                          (0x60052004)

#define reg_stim0_stim_int_clr                                     (*(volatile uint32_t *)0x60052008)
#define adr_stim0_stim_int_clr                                                           (0x60052008)

#define reg_stim0_int_to_cpu_ch_en                                 (*(volatile uint32_t *)0x6005200c)
#define adr_stim0_int_to_cpu_ch_en                                                       (0x6005200c)

#define reg_stim0_trig_cfg                                         (*(volatile uint32_t *)0x60052010)
#define adr_stim0_trig_cfg                                                               (0x60052010)
#define mask_stim0_trig_cfg_rd_frz                                   (0x10)                          
#define mask_stim0_trig_cfg_trigovrflw                               (0x8)                           
#define mask_stim0_trig_cfg_cnt_clr                                  (0x4)                           
#define mask_stim0_trig_cfg_stp                                      (0x2)                           
#define mask_stim0_trig_cfg_sta                                      (0x1)                           

#define reg_stim0_prescale                                         (*(volatile uint32_t *)0x60052014)
#define adr_stim0_prescale                                                               (0x60052014)

#define reg_stim0_comp0                                            (*(volatile uint32_t *)0x60052018)
#define adr_stim0_comp0                                                                  (0x60052018)

#define reg_stim0_comp1                                            (*(volatile uint32_t *)0x6005201c)
#define adr_stim0_comp1                                                                  (0x6005201c)

#define reg_stim0_comp2                                            (*(volatile uint32_t *)0x60052020)
#define adr_stim0_comp2                                                                  (0x60052020)

#define reg_stim0_comp3                                            (*(volatile uint32_t *)0x60052024)
#define adr_stim0_comp3                                                                  (0x60052024)

#define reg_stim0_set_load_trig                                    (*(volatile uint32_t *)0x60052028)
#define adr_stim0_set_load_trig                                                          (0x60052028)
#define mask_stim0_set_load_trig_wakeup_mask_trig                    (0x20)                          
#define mask_stim0_set_load_trig_prescale_trig                       (0x10)                          
#define mask_stim0_set_load_trig_comp3_trig                          (0x8)                           
#define mask_stim0_set_load_trig_comp2_trig                          (0x4)                           
#define mask_stim0_set_load_trig_comp1_trig                          (0x2)                           
#define mask_stim0_set_load_trig_comp0_trig                          (0x1)                           

#define reg_stim0_set_flg                                          (*(volatile uint32_t *)0x6005202c)
#define adr_stim0_set_flg                                                                (0x6005202c)

#define reg_stim0_set_flg_clr                                      (*(volatile uint32_t *)0x60052030)
#define adr_stim0_set_flg_clr                                                            (0x60052030)
#define mask_stim0_set_flg_clr_trigovrflw_trig_cfg_set_clr           (0x200)                         
#define mask_stim0_set_flg_clr_cnt_clr_trig_cfg_set_clr              (0x100)                         
#define mask_stim0_set_flg_clr_stp_trig_cfg_set_clr                  (0x80)                          
#define mask_stim0_set_flg_clr_sta_trig_cfg_set_clr                  (0x40)                          
#define mask_stim0_set_flg_clr_wakeup_mask_set_clr                   (0x20)                          
#define mask_stim0_set_flg_clr_prescale_set_clr                      (0x10)                          
#define mask_stim0_set_flg_clr_comp3_set_clr                         (0x8)                           
#define mask_stim0_set_flg_clr_comp2_set_clr                         (0x4)                           
#define mask_stim0_set_flg_clr_comp1_set_clr                         (0x2)                           
#define mask_stim0_set_flg_clr_comp0_set_clr                         (0x1)                           

#define reg_stim0_cnt                                              (*(volatile uint32_t *)0x60052034)
#define adr_stim0_cnt                                                                    (0x60052034)

