EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/ht32f675x5_reg.h
#define reg_stim0_cnt_work_flg                                     (*(volatile uint32_t *)0x60052038)
#define adr_stim0_cnt_work_flg                                                           (0x60052038)

#define reg_stim0_wakeup_flg                                       (*(volatile uint32_t *)0x6005203c)
#define adr_stim0_wakeup_flg                                                             (0x6005203c)
#define mask_stim0_wakeup_flg_chn3_pmu_wakeup_flag                   (0x8)                           
#define mask_stim0_wakeup_flg_chn2_pmu_wakeup_flag                   (0x4)                           
#define mask_stim0_wakeup_flg_chn1_pmu_wakeup_flag                   (0x2)                           
#define mask_stim0_wakeup_flg_chn0_pmu_wakeup_flag                   (0x1)                           

#define reg_stim0_ext_cg_en                                        (*(volatile uint32_t *)0x60052060)
#define adr_stim0_ext_cg_en                                                              (0x60052060)


//---------------------------------------------------
// stim1 in  domain address definition
//---------------------------------------------------

#define reg_stim1_stim_int_status                                  (*(volatile uint32_t *)0x60053000)
#define adr_stim1_stim_int_status                                                        (0x60053000)

#define reg_stim1_stim_int_mask                                    (*(volatile uint32_t *)0x60053004)
#define adr_stim1_stim_int_mask                                                          (0x60053004)

#define reg_stim1_stim_int_clr                                     (*(volatile uint32_t *)0x60053008)
#define adr_stim1_stim_int_clr                                                           (0x60053008)

#define reg_stim1_int_to_cpu_ch_en                                 (*(volatile uint32_t *)0x6005300c)
#define adr_stim1_int_to_cpu_ch_en                                                       (0x6005300c)

#define reg_stim1_trig_cfg                                         (*(volatile uint32_t *)0x60053010)
#define adr_stim1_trig_cfg                                                               (0x60053010)
#define mask_stim1_trig_cfg_rd_frz                                   (0x10)                          
#define mask_stim1_trig_cfg_trigovrflw                               (0x8)                           
#define mask_stim1_trig_cfg_cnt_clr                                  (0x4)                           
#define mask_stim1_trig_cfg_stp                                      (0x2)                           
#define mask_stim1_trig_cfg_sta                                      (0x1)                           

#define reg_stim1_prescale                                         (*(volatile uint32_t *)0x60053014)
#define adr_stim1_prescale                                                               (0x60053014)

#define reg_stim1_comp0                                            (*(volatile uint32_t *)0x60053018)
#define adr_stim1_comp0                                                                  (0x60053018)

#define reg_stim1_comp1                                            (*(volatile uint32_t *)0x6005301c)
#define adr_stim1_comp1                                                                  (0x6005301c)

#define reg_stim1_comp2                                            (*(volatile uint32_t *)0x60053020)
#define adr_stim1_comp2                                                                  (0x60053020)

#define reg_stim1_comp3                                            (*(volatile uint32_t *)0x60053024)
#define adr_stim1_comp3                                                                  (0x60053024)

#define reg_stim1_set_load_trig                                    (*(volatile uint32_t *)0x60053028)
#define adr_stim1_set_load_trig                                                          (0x60053028)
#define mask_stim1_set_load_trig_wakeup_mask_trig                    (0x20)                          
#define mask_stim1_set_load_trig_prescale_trig                       (0x10)                          
#define mask_stim1_set_load_trig_comp3_trig                          (0x8)                           
#define mask_stim1_set_load_trig_comp2_trig                          (0x4)                           
#define mask_stim1_set_load_trig_comp1_trig                          (0x2)                           
#define mask_stim1_set_load_trig_comp0_trig                          (0x1)                           

#define reg_stim1_set_flg                                          (*(volatile uint32_t *)0x6005302c)
#define adr_stim1_set_flg                                                                (0x6005302c)

#define reg_stim1_set_flg_clr                                      (*(volatile uint32_t *)0x60053030)
#define adr_stim1_set_flg_clr                                                            (0x60053030)
#define mask_stim1_set_flg_clr_trigovrflw_trig_cfg_set_clr           (0x200)                         
#define mask_stim1_set_flg_clr_cnt_clr_trig_cfg_set_clr              (0x100)                         
#define mask_stim1_set_flg_clr_stp_trig_cfg_set_clr                  (0x80)                          
#define mask_stim1_set_flg_clr_sta_trig_cfg_set_clr                  (0x40)                          
#define mask_stim1_set_flg_clr_wakeup_mask_set_clr                   (0x20)                          
#define mask_stim1_set_flg_clr_prescale_set_clr                      (0x10)                          
#define mask_stim1_set_flg_clr_comp3_set_clr                         (0x8)                           
#define mask_stim1_set_flg_clr_comp2_set_clr                         (0x4)                           
#define mask_stim1_set_flg_clr_comp1_set_clr                         (0x2)                           
#define mask_stim1_set_flg_clr_comp0_set_clr                         (0x1)                           

#define reg_stim1_cnt                                              (*(volatile uint32_t *)0x60053034)
#define adr_stim1_cnt                                                                    (0x60053034)

#define reg_stim1_cnt_work_flg                                     (*(volatile uint32_t *)0x60053038)
#define adr_stim1_cnt_work_flg                                                           (0x60053038)

#define reg_stim1_wakeup_flg                                       (*(volatile uint32_t *)0x6005303c)
#define adr_stim1_wakeup_flg                                                             (0x6005303c)
#define mask_stim1_wakeup_flg_chn3_pmu_wakeup_flag                   (0x8)                           
#define mask_stim1_wakeup_flg_chn2_pmu_wakeup_flag                   (0x4)                           
#define mask_stim1_wakeup_flg_chn1_pmu_wakeup_flag                   (0x2)                           
#define mask_stim1_wakeup_flg_chn0_pmu_wakeup_flag                   (0x1)                           

#define reg_stim1_ext_cg_en                                        (*(volatile uint32_t *)0x60053060)
#define adr_stim1_ext_cg_en                                                              (0x60053060)

#endif /* __HT32F675X5_REG_H__ */
